{
  "alternatePhrases": [],
  "definition": "Introduction\n============\n\nIn order to extend algebraic geometry to deal with fields that are not\nalgebraically closed, it is necessary to generalize the notions of\naffine variety and projective variety. The most suitable generalization\nseems to be the notion of a scheme. A scheme in some sense captures the\nequations defining an algebraic object, so that the points of that\nobject can be examined over many different fields. In fact, the points\nof such an object take a secondary role: this is necessary because, for\nexample, over a finite field most curves have no points at all until you\npass to a suitable field extension. The underlying machinery allowing\nthis is the tensor product of rings: given a $k$-algebra $A$ and a field\nextension $K$ of $k$, $A\\otimes_k K$ is the $K$-algebra that is, in some\nsense, defined by the same equations as $A$.\n\nAlong with this ability to deal with varying base fields, schemes offer\na great number of other possibilities. In particular, the tools for\ndealing with individual schemes can usually also be adapted to deal with\nfamilies of schemes. These families can even span different\ncharacteristics, which can be a powerful tool for applying the tools of\ncharacteristic zero geometry to problems in positive characteristic.\n\nDefinitions\n===========\n\nAn *affine scheme* is a locally ringed space $(X,{\\mathcal{O}}_X)$ with\nthe property that there exists a ring $R$ (commutative, with identity)\nwhose prime spectrum ${\\operatorname{Spec}}(R)$ is isomorphic to $X$ as\na locally ringed space.\n\nA *scheme* is a locally ringed space $(X,{\\mathcal{O}}_X)$ which has an\nopen cover $\\{U_\\alpha\\}_{\\alpha \\in I}$ with the property that each\nopen set $U_\\alpha$, together with its restriction sheaf\n${\\mathcal{O}}_X|_{U_\\alpha}$, is an affine scheme.\n\nWe define a *morphism of schemes* between two schemes\n$(X,{\\mathcal{O}}_X)$ and $(Y,{\\mathcal{O}}_Y)$ to be a morphism of\nlocally ringed spaces\n$f: (X,{\\mathcal{O}}_X) {\\longrightarrow}(Y,{\\mathcal{O}}_Y)$.\n\nWith these definitions, schemes of course form a category. However,\nfrequently one wishes to work in a slightly different category, such as\nthe category of “complex schemes”, that is, schemes obtained from\ncomplex algebras. However, these schemes will have strange automorphisms\nobtained from automorphisms of the complex numbers. In order to prevent\nthis problem, we often look at another category.\n\nFix a scheme $Y$. Then a *scheme over $Y$* is defined to be a scheme $X$\ntogether with a morphism of schemes $X {\\longrightarrow}Y$, called the\nstructure morphism of $X$. A morphism $X\\to X'$ of schemes over $Y$ is a\nmorphism $X\\to X'$ which makes the following diagram commute:\n$$\\xymatrix{\nX \\ar[rr]\\ar[dr] & & X' \\ar[dl] \\\\\n& Y &\n}$$ The resulting category is called the category of schemes over $Y$,\nand is sometimes denoted $\\text{Sch}/Y$. Frequently, $Y$ will be the\nspectrum of a ring (or especially a field) $R$, and in this case we will\nalso call this the category of schemes over $R$ (rather than schemes\nover ${\\operatorname{Spec}}R$).\n\nObserve that this resolves the problem of automorphisms of the complex\nnumbers leading to automorphisms of schemes over $\\mathbb{C}$.\n\nIf $Y$ is not simply the spectrum of a field (perhaps it is a curve or\nsome more general scheme) then one should interpret this as saying that\n$X$ is a family of schemes; for each point of $Y$, we have a scheme,\nnamely the fiber of $X$ over that point of $Y$.\n\n**Note:** Some authors, notably Mumford and Grothendieck, require that a\nscheme be separated as well (and use the term *prescheme* to describe a\nscheme that is not separated), but we will not impose this requirement.\n\nFor many problems, the points of the underlying topological space of a\nscheme do not represent what we want to work with. For example, if we\ntake the coordinate ring $R$ of a variety over an algebraically closed\nfield $k$, ${\\operatorname{Spec}}R$ (as a scheme over $k$) behaves very\nmuch like the variety in question, but there are “extra” points in the\nunderlying topological space: for every irreducible closed subset, we\nhave a point whose closure is the whole subset. Such a point is called a\n*generic point*. As a result, we have a more elaborate definition for a\npoint on a scheme.\n\nFix a scheme $S$. Then an *$S$-point on a scheme* $X$ is a morphism\n$S\\to X$. If $X$ is a scheme over $Y$, then this morphism is expected to\nbe a $Y$-morphism. The functor $S\\mapsto {\\operatorname{Hom}}(S,X)$ is\ncalled the *functor of points* on $X$. The set of $S$-points on $X$ is\ndenoted $X(S)$. If $R$ is a ring, then $X({\\operatorname{Spec}}R)$ is\noften written $X(R)$. Thus, for example, the complex points on $X$ might\nbe written $X(\\mathbb{C})$.\n\nExamples\n========\n\n-   Every affine scheme is clearly a scheme as well. In particular,\n    ${\\operatorname{Spec}}(R)$ is a scheme for any commutative ring $R$.\n\n-   Every variety can be interpreted as a scheme. An affine variety\n    corresponds to the prime spectrum of its coordinate ring, and a\n    projective variety has an open cover by affine pieces each of which\n    is an affine variety, and hence an affine scheme.\n\nReferences\n==========\n\nSee the . Hartshorne’s book, *Algebraic Geometry*, is an excellent\nreference for these ideas.",
  "language": "INFORMAL",
  "phrase": "Scheme",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Scheme"
    }
  ],
  "indexable": true
}