{
  "alternatePhrases": [],
  "definition": "Let $(X,{\\mathcal{O}}_X)$ be a ringed space. By definition, for every\n$U$ we have a ring ${\\mathcal{O}}_X(U)$. If $S_U$ is the set of elements\nthat are not zero divisors, we can construct the localization\n$K_U = S_U^{-1}{\\mathcal{O}}_X(U)$. If ${\\mathcal{O}}_X(U)$ is actually\nan integral domain, then $K$ will be its field of fractions. It is easy\nto verify that the restriction maps of the sheaf ${\\mathcal{O}}_X(U)$\nyield restriction maps on the rings $K_U$, so that we can define a\npresheaf $U\\mapsto K_U$. Let $\\mathcal{K}_X$ be the sheafification of\nthis presheaf. Then $\\mathcal{K}_X$ is called the *sheaf of meromorphic\nfunctions*.\n\nIf $X$ is a connected complex manifold, then $X$ has a sheaf\n${\\mathcal{O}}_X$ of holomorphic functions making it into a ringed\nspace. These rings are always integral domains, and their quotients are\nall the same, so $\\mathcal{K}_X$ is a constant sheaf; in fact it always\ntakes the same value, a field $K$. We recognize $K$ as precisely the\nfield of meromorphic functions on $X$.\n\nIf $X$ is a scheme, then $X$ has an associated sheaf ${\\mathcal{O}}_X$\nmaking it into a ringed space. If $X$ is arbitrary, then $\\mathcal{K}_X$\nwill simply be a sheaf of rings. If, however, $X$ is integral and\nquasicompact, then the situation is very similar to the situation of\ncomplex manifolds; the ring of regular functions on every Zariski open\nset is an integral domain, and all the restriction maps are injective.\nAs a result, the sheaf of meromorphic functions is again a constant\nsheaf that always yields the same value, and this value is called the\nfunction field of $X$. This function field is an essential object of\nstudy in birational geometry.\n\nIf $X$ is not reduced, its structure sheaf contains nilpotents. Thus\n$\\mathcal{K}$ is not a sheaf of fields, even locally. Such schemes arise\nwhen discussing infinitesimal deformations.\n\nIf $X$ is reduced but not irreducible, then each irreducible component\n(if it is quasicompact) has a function field, and $\\mathcal{K}_X(X)$ is\nin fact the direct sum of these function fields.\n\nIf $X$ is a differential manifold, the differentiable functions on it\nform a sheaf of rings making $X$ into a ringed space. Here the structure\nof $\\mathcal{K}_X$ is much more complicated; a function on $U$ has an\ninverse if and only if its support on $U$ has empty interior. So\nglobally, this amounts to allowing functions to have poles provided the\nsupport of these poles has empty interior. This complicated structure\nmakes the sheaf of meromorphic functions much less useful in the\ndifferentiable category than it is for schemes or complex manifolds.",
  "language": "INFORMAL",
  "phrase": "Sheaf Of Meromorphic Functions",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/SheafOfMeromorphicFunctions"
    }
  ],
  "indexable": true
}