{
  "alternatePhrases": [
    "sheaves"
  ],
  "definition": "Let $T$ be a category, and let $C$ be another category. Then a *presheaf\non $T$* is a contravariant functor $F:T\\to C$. If $U\\overset{i}{\\to} V$\nis a morphism in $T$, we call $F(i):F(V)\\to F(U)$ the *restriction map*\nobtained from $i$. A *morphism of presheaves* is a natural\ntransformation.\n\nTo understand this definition, and what it has to do with the more\nfamiliar definition of a , let $T$ be a site. Then a presheaf maps the\n“open sets” to objects in $C$ and provides restriction maps whenever the\nunderlying “open sets” have an “inclusion”. Of course, on a site, there\nmay be many non-isomorphic inclusions.\n\nIn practice, to avoid set-theoretic difficulties, one usually fixes a\nuniverse $\\mathcal{U}$ and then requires $T$ to be a category.\n\nIf $T$ is a small category and $C$ is a $\\mathcal{U}$-category, then\npresheaves on $T$ form a category.\n\nIf $T$ is not small, that is if the isomorphism classes of objects do\nnot form a $\\mathcal{U}$-set, then (normally) there are as many functors\nas subsets of $T$, which leads to the resulting category failing to be a\n$\\mathcal{U}$-category. If one removes the various qualifications in\nterms of universes, this means that there are too many functors:\nRussell’s paradox arises. If one uses universes, and qualifies\neverything in sight appropriately, a problem remains: there are too many\nfunctors from sets to sets to be allowed. While your answer is described\nin terms of sets, they are too big to be inside the universe of\ndiscourse. This problem underlies the set-theoretic problems with direct\nlimits.\n\nLet $T$ be a site, and suppose either $C$ is an abelian category or $C$\nis the category of sets.\n\nLet $F\\colon T\\to C$ be a presheaf. Then $F$ is a *sheaf* if for every\ncovering ${U_i\\to U}$ in $T$, the products $\\prod_{U_i} F(U_i)$ and\n$\\prod_{U_i \\times_U U_j} F(U_i \\times_U U_j)$ exist, and the sequence\n$$F(U)\\to \\prod_{U_i} F(U_i) \\rightrightarrows \\prod_{U_i \\times_U U_j} F(U_i \\times_U U_j)$$\nis exact.\n\nThis “exactness” really needs explaining. First of all, for every $i$,\nwe have a morphism $F(U)\\to F(U_i)$ obtained from the covering. The map\non the left (call it $f$) is the product of all these maps. Second, for\neach pair $i$ and $j$, we have a morphism\n$g_1\\colon F(U_i)\\to F(U_i\\times_U U_j)$ and a morphism\n$g_2\\colon F(U_j)\\to F(U_i\\times_U U_j)$ obtained from the two\nprojection maps of the fibred product. The two maps on the right-hand\nside are obtained as products of all the $g_1$ and $g_2$ respectively.\n\nIf $C$ is the category of sets, then the exactness condition requires\nthat the left-hand map is injective and that the two right-hand maps\nagree exactly on its image.\n\nIf $C$ is an abelian category, then the kernel of the left-hand map\nshould be zero, and the kernel of the difference of the two right-hand\nmaps should be its image. Perhaps this would be clearer if the diagram\nadded a “$0\\to$” on the left, but this usage is very standard.\n\nThis definition of a sheaf is the motivation for the definition of a\nsite: a site captures precisely those features of a topological space\nthat are required to form sheaves. The category of sheaves on a\ntopological space is an example of a topos; the original definition of a\ntopos was “a category equivalent to the category of sheaves on a site”,\nalthough the concept was generalized in later work. The motivation was\nthat while a site may be badly behaved and pose set-theoretic\ndifficulties, the topos associated to it is generally better behaved.\n\nThe category of sheaves on a site has a long list of nice properties;\namong them is “has enough injectives”, so that derived functors can be\nextracted and cohomology calculated. This is how, for example, étale\ncohomology is obtained.\n\n[9]{}",
  "language": "INFORMAL",
  "phrase": "Sheaf",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Sheaf1"
    }
  ],
  "indexable": true
}