{
  "alternatePhrases": [],
  "definition": "Suppose that $D_1$ and $D_2$ are connected open subsets of the complex\nplane and that $D_1 \\subset D_2$. Suppose that\n$f \\colon D_1 \\to \\mathbb{C}$ and $g \\colon D_2 \\to \\mathbb{C}$ are\nanalytic. If the restriction of $g$ to $D_1$ equals $f$, we say that $g$\nis a *direct analytic continuation* of $f$.\n\nThe reason that the notion of analytic continuation is interesting is\nthe rigidity theorem for complex functions, which implies that analytic\ncontinuation is unique. This is in marked contrast to what would happen\nif, instead of analyticity, we only required a weaker condition such as\ncontinuity. In that case, there would exist a great number of\ncontinuations of a given function to a larger domain. In fact there are\nso many possibilities that the choice of continuation is largely\narbitrary — one can find a continuation which agrees with any continuous\nfunction on a subset of $D_2$ which is separated from $D_1$.\n\nOne can generalize this notion to continuation along a chain of open\nsets. Suppose that one has a sequence of open sets $D_1,\\ldots,D_n$ such\nthat $D_k \\cap D_{k+1}$ is not empty for $k$ between $1$ and $n-1$ and\n$n$ functions $f_k \\colon D_k \\to \\mathbb{C}$ such that\n$f_k (z) = f_{k+1} (z)$ when $z \\in D_k \\cap D_{k+1}$ for all $k$\nbetween $1$ and $n-1$. Then we say that $f_n$ is the *indirect analytic\ncontinuation* of $f_1$ along the chain $D_1,\\ldots,D_n$.\n\nA related notion is that of analytic continuation along an arc. Given an\narc $C$ with endpoints $x$ and $y$, a function $f$ defined in open\nneighborhood of $x$, and a function $g$ defined in open neighborhood of\n$y$ we say that $g$ is the analytic continuation of $f$ along the arc\n$C$ if there exists an open set containing $C$ and and an analytic\nfunction $h$ defined on this open set such that $f$ agrees with $h$ at\nthose points of the complex plane where both $f$ and $h$ are defined and\n$g$ agrees with $h$ at those points of the complex plane where both $g$\nand $h$ are defined. By the rigidity theorem, the analytic continuation\nof a function along an arc is unique. This concerns especially extending\na real function to an analytic function of a complex variable.\n\nIt is worth noting that it is possible to obtain different analytic\ncontinuations of the same function along two arcs with the same\nendpoints. For instance, if we let $f$ be the square root function, let\n$x=1$ and $y=-1$, and let $C_1$ and $C_2$ be the two halves of the unit\ncircle joining $x$ to $y$, then the result of analytically continuing\n$f$ from $x$ to $y$ along $C_1$ differs from the result of analytically\ncontinuing $f$ from $x$ to $y$ along $C_2$.\n\nThis seems to contradict the uniqueness of analytic continuation. This\ncontradiction, however, is only apparent because there does not exist a\nsingle open set which contains both $C_1$ and $C_2$ to which $f$ can be\nanalytically continued. In fact, in order to accommodate both the\nanalytic continuation along $C_1$ and the analytic continuation along\n$C_2$, one needs to define $f$ on a Riemann surface. Then there exists\nan open subset of the Riemann surface which contains the lifts of both\n$C_1$ and $C_2$. Since the lift of the endpoint of the lift of $C_1$\nlies on a different sheet of the Riemann surface than the endpoint of\nthe lift of $C_2$, there is nothing contradictory about the fact that\nthe analytic continuation of $f$ assumes different values at these two\ndistinct points on the Riemann surface.\n\nThe notion of analytic continuation along an arc can be extended to\nanalytic continuation along a path. Any path can be written as the union\nof overlapping arcs. To continue a function along a path, one\nsuccessively continues it along the various arcs into which the path has\nbeen decomposed. It is a simple consequence of the rigidity theorem that\nthe result of analytically continuing a function along a path is\nindependent of the decomposition of the path into arcs.",
  "language": "INFORMAL",
  "phrase": "Analytic Continuation",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AnalyticContinuation"
    }
  ],
  "indexable": true
}