{
  "alternatePhrases": [],
  "definition": "It is not always possible to analytically continue a function given in a\ncertain region. It might turn out that, as one approaches the boundary\nof the region (or a portion of the boundary), the function always blows\nup, so there is no way of extending it past that portion of the boundary\nto a larger region. When this happens, we say that our function has a\n*natural boundary*. More formally, we may make a definition as follows:\n\nLet $\\mathbf{D}$ be an open subset of the complex plane and let\n$f \\colon \\mathbf{D} \\to \\mathbb{C}$ be analytic. Then the *natural\nboundary* of $f$ is that subset $B$ of $\\partial \\mathbf{D}$ such that,\nif $z\\in B$, then there exists no open neighborhood $\\mathbf{N}$ of $z$\nand no analytic function $g \\colon \\mathbf{N} \\to\n\\mathbb{C}$ such that $f(w) = g(w)$ for all $w \\in \\mathbf{D}\n\\cup \\mathbf{N}$.\n\nAs an example of this phenomenon, consider the power series\n$$\\sum_{k=0}^\\infty z^{k!}.$$ By comparison with the geometric series,\nit is seen that this series converges absolutely when $|z| < 1$:\n$$\\sum_{k=0}^\\infty |z|^{k!} <\n\\sum_{k=0}^\\infty |z|^k =\n{1 \\over 1 - |z|}$$ However, when we try to take the limit $|z| \\to 1$,\nwe find that the series diverges. Namely, let $p/q$ be a rational number\nand let $r$ be a positive real variable. Then, if we set\n$z = r \\exp (2 i \\pi p / q)$, then, when $k \\ge q$, we have that $q$\ndivides $k!$, so $z^{k!} = r^{k!}$. However,\n$$\\lim_{r \\to 1} \\sum_{k=q}^\\infty r^{k!}$$ diverges, so our powers\nseries diverges when we try to take the limit\n$z \\to \\exp (2 i \\pi p / q)$. Since numbers of the form\n$\\exp (2 i \\pi p / q)$ are dense amongst complex numbers with norm $1$,\nit follows that the limit $z \\to z_0$ diverges whenver $|z_0| = 1$.\nHence, the unit circle $|z| = 1$ forms a natural boundary for the\nfunction defined by our power series.\n\nNatural boundaries are not so familiar to beginners because the\nfunctions which one encounters in the more elementary part of the\nsubject, such as algebraic functions, exponential functions, and\nfunctions defined by linear differential equations, do not have natural\nboundaries. To be sure, one could technically call a singular point a\nnatural boundary, but this is usually not done, the term “natural\nboundary” being reserved for cases where the set on which the function\nmisbehaves consists of more than just isolated points, as in the example\nabove.\n\nHowever, when one gains some more experience and studies more advanced\nmaterial, then natural boundaries arise rather frequently. For instance,\ntheta functions, elliptic modular functions, and functions defined by\nnon-linear differential equations have natural boundaries. Natural\nboundaries also play an important role in applications — for instance,\nin statistical mechanics, phase transitions (such as freezing and\nboiling) are associated with natural boundaries of the partition\nfunction.",
  "language": "INFORMAL",
  "phrase": "Natural Boundary",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/NaturalBoundary"
    }
  ],
  "indexable": true
}