{
  "alternatePhrases": [],
  "definition": "The following describes SISO (single input single output) system\ndescriptions. More complex systems require a more sophisticated\nanalysis.\n\nFor a general transfer function, $H(s)$, in Laplace domain, we have\n\n$$\\begin{aligned}\n  \\label{eq:tf}\n   H(s) &= \\frac{\\prod_{i=0}^Z (s - z_i)}{\\prod_{i=0}^P (s - p_i)}\\end{aligned}$$\n\nThe conclusions below can all be derived and understood by expansion of\n$H(s)$ in terms of partial fractions, and then doing a inverse Laplace\ntransform fraction by fraction.\n\n$z_i$ denotes the zeros and $p_i$ denotes the poles of the linear time\ninvariant system (LTI). Stability of the system $H(s)$ is characterized\nby the location of the poles in the complex s-plane. There are many\ndefinitions of stability in the control system literature, the most\ncommon one used (for transfer functions) is the\nbounded-input-bounded-output stability (BIBO), which states that for a\nBIBO stable system, for any bounded input, or finite amplitude input,\nthe output of the system will also be bounded.\n\nFor example, a typical second order system such as the\nmass-spring-dashpot system has the following transfer function,\n\n$$\\begin{aligned}\n  \\label{eq:2ndOrderSys}\n  H(p) &= \\frac{\\omega^2}{p^2 + 2\\zeta \\omega p + \\omega^2}\\end{aligned}$$\n\nwith a pair of complex poles at $p = -\\zeta \\omega \\pm \\omega\n\\sqrt{\\zeta^2 -1}$. In common control system literature, $\\zeta$ is\nusually denoted as the *damping ratio* and $\\omega$ is denoted as the\n*natural frequency* of the system. In the case of the\nmass-spring-dashpot system, we can tell that the oscillation of the mass\nattached to a spring should be a function of the weight of the mass and\nthe stiffness of the spring, hence in the literature we have\n$\\omega = \\sqrt{\\frac{K}{M}}$, where $K$ is the spring constant and $M$\nis the weight of the mass. From the same logic, the amount time for the\nmass to stop oscillating should be a function of the spring stiffness\nand the characteristics of the dashpot, so we have $\\zeta =\n\\frac{D \\omega}{2 K}$, where $D$ is the dashpot constant.\n\nTo determine is the system $H(p)$ BIBO stable, the simplest solution is\nto scrutinize the time domain solution of  \\[eq:2ndOrderSys\\] via\ninverse Laplace transform, and such discussion can easily be found in\ncommon control system related text books and online lecture notes.\nHowever, such approach tells nothing about the *physical nature* of the\ndynamic system, so here I will try to establish relationship between the\nlocation of the poles and the stability of the system. Here I first\nstate that the system in  \\[eq:2ndOrderSys\\], specifically the\nmass-spring-dashpot system, is stable, since it is physically impossible\nfor the system to produce an output increasing in amplitude forever as\ntime goes to infinity.\n\nFirst let’s consider an ideal mass-spring system. If we push the mass\nonce (impulse response), the mass will oscillate forever with the same\namplitude and frequency, since there are no dashpot to dampen the\nmotion. In this case, $D=0 \\rightarrow \\zeta\n=0$, which the pair of complex poles of the system will be located on\nthe imaginary axis of the complex s-plane, and the stronger the spring\n($K$ is large) the further away the poles from the origin. So the\nimaginary part of the poles $img(p_i)$ dominates the oscillatory nature\nof the system. Now let’s assume that we have a relatively weak spring\ncompare to the dashpot that we are going to add to the system, so the\nreal part of the poles $real(p_i)$ will be dominating. If we push the\nmass the same way as before, now we can expect the mass to oscillate for\nsometime then come to a rest, depending on the strength of the dashpot.\nThe stronger the dashpot, the further away the poles from the origin\nalong the real axis on the s-plane. We have almost covered the whole\nleft-hand side of the s-plane, and so far we have the following\nobservations.\n\n-   The imaginary part of complex poles correspond to oscillatory energy\n    storage mechanisms. Note if the original differential equation has\n    real coefficients, the complex poles are always in complex conjugate\n    pairs . As a result these can always be represented by sine and cos\n    terms in the time domain.\n\n-   The real parts of poles govern the decay rate of responses to\n    stimulations; with negative values corresponding to decaying terms,\n    and positive parts to growth terms (which are not stable).\n\n-   The ratio between the real and imaginary parts of the poles govern\n    the shape of the response. In particular ratios less than one hide\n    the visible part of the oscillatory terms in the time domain.\n\n-   Poles that have neither real or imaginary parts, i.e. at the origin,\n    correspond to successive integrations in the time domain. One\n    integration for each pole. Since these have an unbounded output for\n    a step input, systems like these are not BIBO; but are common.\n\nFor a system consisted of poles with imaginary parts only, $p_i = \\pm\nj \\omega$, it is usually referred to as a *[marginally stable system]{}.\nNotice that the real part of the poles for system  \\[eq:2ndOrderSys\\]\nare always negative, since both $\\zeta$ and $\\omega$ are always\npositive. If a stable system has negative poles (real or complex),\nunstable system must has positives poles, in the right-hand side of the\ns-plane. This can easily be visualize if we place a amplifier (with\n$-\\zeta$) instead of a dashpot in the system.*",
  "language": "INFORMAL",
  "phrase": "Stability Of Transfer Functions In The Laplace Domain",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/StabilityOfTransferFunctionsInTheLaplaceDomain"
    }
  ],
  "indexable": true
}