{
  "alternatePhrases": [],
  "definition": "Basic definition {#basic-definition .unnumbered}\n================\n\nA *vector bundle* is a fiber bundle having a vector space as a fiber and\nthe general linear group of that vector space (or some subgroup) as\nstructure group. Common examples of a vector bundle include the tangent\nbundle of a differentiable manifold and the Möbius strip (of infinite\nwidth).\n\nVector bundles in various categories {#vector-bundles-in-various-categories .unnumbered}\n====================================\n\nAs with fiber bundles, the idea of a vector bundle exists in many\ncategories. We talk about topological vector bundles (in the category of\ntopological spaces), we talk about differentiable vector bundles, we\ntalk about complex analytic (or holomorphic) vector bundles, and we talk\nabout algebraic vector bundles. In each case, the fiber must have a\nstructure from the appropriate category, and the general linear group\nmust also be equipped with a structure from the appropriate category\n(generally this means it must be a group object and it must act through\nmorphisms in the category).\n\nSpecifically, if we want a topological vector bundle, we must supply a\ntopological space for the base space, a topological space for the whole\nspace, and the projection map must be continuous; this specifies a\ntopology on each fiber. The general linear group must also act\ncontinuously.\n\nIf we are in the category of schemes, each local trivialization must be\nan affine space over the affine ring of the neighborhood on the scheme,\nand the general linear group scheme must act on it through morphisms of\nschemes.\n\nSections of a vector bundle {#sections-of-a-vector-bundle .unnumbered}\n===========================\n\nAs with any fiber bundle, a vector bundle may have sections. If a vector\nbundle on $X$ is defined on an open cover $\\{U_\\alpha\\}$ with transition\nfunctions $\\phi_{\\alpha\\beta}$ taken from $\\mathop{GL}_n$, a section is\na collection of functions $f_\\alpha:U_\\alpha\\to U_\\alpha\\times V$ which\ngive the identity when projected down to $U_\\alpha$ and such that\n$$\\phi_{\\alpha\\beta}\\circ f_\\beta|_{U_\\alpha \\cap U_\\beta} = f_\\alpha|_{U_\\alpha \\cap U_\\beta}.$$\n\nSections may be added and scaled by field elements by simply applying\nthese operations to each fiber, so they form a vector space. A very\ncommon application of the Riemann-Roch theorem is to count the number of\nlinearly independent sections on a curve, surface, or higher-dimensional\nvariety.\n\nOne is often interested in families of sections that are linearly\nindependent in each fiber. If the vector bundle has dimension $n$ and\nthere are $n$ sections that are linearly independent on every fiber,\nthen the vector bundle is isomorphic to the Cartesian product of\n$X\\times V$, which is called the *trivial vector bundle*. Such a family\nof sections is therefore called a *trivialization*.\n\nOne is sometimes interested in sections of a related vector bundle\nobtained by restricting the base space to some open subset. In this way,\none can obtain a sheaf from a vector bundle, called the *sheaf of\nsections*.\n\nOperations on vector bundles {#operations-on-vector-bundles .unnumbered}\n============================\n\nSince the fiber of a vector bundle is a vector space, one can do many\noperations on vector bundles over a fixed space $X$; in fact, almost all\nthe usual operations on vector spaces can be applied. However, they are\noften not quite as simple as in the case of finite-dimensional vector\nspaces.\n\nOne can take direct sums and tensor products of vector bundles; the\ndimensions (if finite) behave as expected. Morphisms between vector\nbundles over $X$ are just linear maps on the fibers, with appropriate\ncontinuity conditions: since the space of linear maps between two vector\nspaces is again a vector space, a morphism between vector bundles must\nbe a vector bundle itself.\n\nIf one has a short exact sequence of vector bundles over $X$,\n$$0 \\to T \\to U \\to V \\to 0,$$ then the dimension of $U$ is the sum of\nthe dimensions of $T$ and $V$, as one might expect; but one often cannot\nwrite $U$ as the direct sum of $T$ and $V$. In this way, vector bundles\nresemble modules over a ring or abelian groups; in fact it is the\nbehaviour of finite-dimensional vector spaces that is “too good to be\ntrue”.\n\nRelation to other objects {#relation-to-other-objects .unnumbered}\n=========================\n\nIn the algebraic category, that is, vector bundles over schemes, there\nis a very nice correspondence between vector bundles and locally free\nsheaves; when the dimension is one and the scheme is nice enough, there\nis a further correspondence with Cartier divisors.",
  "language": "INFORMAL",
  "phrase": "Vector Bundle",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/VectorBundle"
    }
  ],
  "indexable": true
}