{
  "alternatePhrases": [
    "vector-valued function"
  ],
  "definition": "Vector fields in $\\mathbb{R}^n$ {#vector-fields-in-mathbbrn .unnumbered}\n===============================\n\nA *vector field* $v$ on some open set $U \\subset \\mathbb{R}^n$ is a\nfunction which associates a vector $v(x)$ to each point $x$ of $U$. That\nis, $v$ is a function from $\\mathbb{R}^n$ to $\\mathbb{R}^n$. However, we\ngive it a rather special interpretation. This distinction will become\nclear when we generalize. If $v$ is differentiable, then we say the\nvector field is *differentiable*.\n\nHere and throughout this entry we use “differentiable” to mean\n“infinitely differentiable”. Other smoothness criteria (continuity,\n$C^r$, real analytic) can of course be substituted in the obvious way.\n\nLet $v(x,y)=(-y,x)$. At the point $(x,y)$, we view this as an arrow\npointing counterclockwise around the origin, with a length proportional\nto (in fact equal to) the distance from the origin. So this might be the\nfield of velocity vectors of a fluid rotating en masse.\n\nVector fields on manifolds {#vector-fields-on-manifolds .unnumbered}\n==========================\n\nSuppose first that $M$ is a manifold of dimension $n$ embedded in\n$\\mathbb{R}^m$. Then we would like to define a vector field on $M$ to be\na function as before. But $M$ has a natural notion of tangent space at\neach point, so now we would like all the vectors to be tangent to $M$.\nIf we are to define a vector field as before, as simply a function from\nsome open set $U$ of $M$ to $\\mathbb{R}^n$, we must pick a basis for the\ntangent space at each point; the basis elements must, however, be\ndifferentiable. It is not obvious that we can always pick such a\ndifferentiable basis (think of the tangent spaces to the Möbius strip).\nThe problem is that the tangent spaces form a fiber bundle, and this may\nnot be trivial. We could get around this by shrinking $U$ until we could\nalways construct such a basis, but then we would have to describe how to\nconvert bases on the overlap. This can be done, and it is one way to\napproach the theory of differential manifolds; at this point one might\nas well do away with the ambient space $\\mathbb{R}^n$.\n\nInstead of doing this, we will take a coordinate-free approach. The\nfirst thing to notice is that given a tangent vector to a manifold, it\nmakes sense to take a differentiable function on the manifold and ask\nwhat the directional derivative along the vector is. If we have two\ndifferent tangent vectors, then we can find a function whose directional\nderivative along each vector is different. So we could identify tangent\nvectors with directional derivative operators. This is how we will\ndefine them in a general setting.\n\nLet $M$ be a differential manifold of dimension $n$, and let $x$ be a\npoint on $M$. Let $V$ be the space of differentiable functions defined\nin some neighborhood of $x$. Then a *tangent vector* $X$ at $x$ is a\nlinear operator on $V$ such that\n\n1.  $X(fg) = fX(g)+gX(f)$, and\n\n2.  if $f$ and $g$ agree on some neighborhood of $x$, then $X(f)=X(g)$.\n\nWe write the set of tangent vectors at $x$ as $T_xM$; it is a vector\nspace of dimension $n$.\n\nA *vector field* on an open set $U\\subset M$ is a family of tangent\nvectors $X_x$ at each $x$ such that for every differentiable function\n$f$ on an open set $V\\subset U$, the function $x\\mapsto X_x(f)$ is\ndifferentiable.\n\nWhat does this definition actually mean? Suppose we have a coordinate\nchart $\\phi\\colon V\\to \\mathbb{R}^n$ on some open set $V\\subset M$. Then\nwe can define a differentiable function $x_i$ on $V$ by applying $\\phi$\nfollowed by extracting the $i$th coordinate. So the function $x_i$\nreally extracts the $x_i$ coordinate in this coordinate system. Now, let\n$X$ be a vector field on $V$. With some thought, we see that\n$$X(f) = \\sum_{i=1}^n X(x_i)\\frac{\\partial}{\\partial x_i} f,$$ or, in\nsome sense $$X = \\sum_{i=1}^n X(x_i)\\frac{\\partial}{\\partial x_i}.$$\nEach $X(x_i)$ is by definition just a differentiable function on $V$.\n\nIf we had chosen a different coordinate chart $\\psi$ on an open set\n$W\\subset M$, we would obtain coordinate functions $y_i$ by analogy with\nthe $x_i$. Then in this coordinate system we would have\n$$X = \\sum_{i=1}^n X(y_i)\\frac{\\partial}{\\partial y_i}.$$\n\nIf $V$ and $W$ overlap, then on their overlap we can compare the\ncomponents of $X$ in these two coordinate systems. A calculation will\nreveal $$X = \\sum_{i=1}^n X(y_i)\\frac{\\partial}{\\partial y_i}\n  = \\sum_{i=1}^n \\sum_{j=1}^n X(x_j)\\frac{\\partial y_i}{\\partial x_j}\\frac{\\partial}{\\partial y_i}.$$\n\nAn alternative definition of vector fields defines tangent vectors\nlocally and then requires that they satisfy this transformation law.\n\nObserve that this transformation law means that we can’t compare vectors\nat different points in a coordinate-independent way, or at least, it\nwill require some significant cleverness to transport a vector from one\npoint to another. This is in fact possible with some extra information\nin the form of a connection on $M$, allowing parallel transport of\nvectors along curves. The result will continue to depend on the curve,\nas you can imagine if you imagine trying to parallel-transport a vector\nfrom the North Pole to Baghdad to Mexico City and then back to the North\nPole: it will have rotated. This is in fact a direct result of the\ncurvature of the Earth.\n\nLet $M$ be $\\mathbb{R}^2$, and let $$\\nu_t(x,y):=\\begin{pmatrix}\n\\cos t & -\\sin t \\\\\n\\sin t & \\cos t\n\\end{pmatrix}\\begin{pmatrix}\nx \\\\\ny\n\\end{pmatrix}.$$ Then define a vector field $X$ by\n$$f \\mapsto \\frac{\\partial}{\\partial t}(f\\circ\\nu_t).$$ We have a\nnatural coordinate patch defined by the identity function; in this\ncoordinate system, we can easily calculate that\n$$X = -y\\frac{\\partial}{\\partial x} + x\\frac{\\partial}{\\partial y};$$\nthis $X$ is precisely the vector field we had before, viewed in a new\nand more confusing light. Now, with a little imagination, we can see\nthat even for fixed $t$, the function $\\nu_t$ is a different kind of\nobject than $X$; while $\\nu_t$ represents a rotation, a smooth map from\n$M$ to itself, while $X$ is a piece of information attached in an\nessential way to each point, perhaps representing a velocity vector\nfield.\n\nThe Tangent Bundle {#the-tangent-bundle .unnumbered}\n==================\n\nLet $TM$ denote the vector bundle with base space $M$ having fiber over\n$x$ given by $T_xM$, and having local trivializations over coordinate\ncharts with change of coordinates given by the formulas in the previous\nsection. Then the bunlde $TM$ is called the *tangent bundle* of $M$.\n\nThe tangent bundle is extremely useful in its own right, and other\nbundles of interest are also constructed from it. For example, the\ncotangent bundle is obtained by taking the dual vector space at each\npoint. Sections of the cotangent bundle are one-forms, and since they\nare obtained by taking the dual, they transform according to the inverse\nmatrix at each point. Higher wedge and tensor products of these bundles\nare used to construct tensors and differential forms.\n\nVector fields on a smooth manifold support an operation called the Lie\nbracket, making them into a Lie algebra; this construction produces an\nintimate link between Lie algebras and Lie groups, which are of great\ninterest to physicists and mathematicians alike.\n\nThis viewpoint on vector fields emphasizes the machinery of modern\ngeometry, namely sheaves, local rings, and bundles; this machinery is\nuseful in differential geometry, important in complex analtyic geometry,\nand foundational in algebraic geometry — schemes cannot be described\nwithout it.\n\nReferences {#references .unnumbered}\n==========\n\nSee the bibliography for differential geometry.",
  "language": "INFORMAL",
  "phrase": "Vector Field",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/VectorField"
    }
  ],
  "indexable": true
}