{
  "alternatePhrases": [],
  "definition": "Given an algebraic category with enough free objects one can use the\ngeneral description of the free object to provide a precise description\nof all other objects in the category. The process is called a\n*presentation*.\n\nSuppose $A$ is an object generated by a subset $X$. Then if there exists\na free object on $X$, $F$, then there exists a unique morphism\n$f:F\\rightarrow A$ which matches the embedding of $X$ in $F$ to the\nembedding of $X$ in $A$.\n\nAs we are in an algebraic category we have a fundamental homomorphism\ntheorem (we take this as our definition of an algebraic category in this\ncontext). This means there is a notion of kernel $K$ of $f$ and quotient\n$F/K$ such that $F/K$ is isomorphic to $A$.\n\nNow $F$ is generted by $X$ so every element of $F$ is expressed as an\ninformal word over $X$. \\[By *informal word* we mean whatever process\nencodes general elements as generated by $X$. For example, in groups and\nsemigroups these are actual formal words, but in algebras these can be\nlinear combinations of words or polynomials with indeterminants in $X$,\netc.\\] Hence a set of generators for the kernel $K$ will be expressed as\nwords over $X$.\n\nA presentation of an object $A$ is a pair of sets $\\langle X|R\\rangle$\nwhere $X$ generates $A$ and $R$ is a set of informal words over $X$ such\nthat the free object $F$ on $X$ and the normal subobject $K$ of $F$\ngenerated by $R$ has the property $F/K\\cong A$.\n\nOnce again, normal refers to whatever property is required for subobject\nto allow quotients, so normal subgroup or ideals, etc.\n\nExistence of presentations is dependent on the category being\nconsidered. The common categories: groups, rings, and modules all have\npresentations.\n\nIt is generally not possible to insist that a presentation is unique.\nFirst we have the variable choice of generators. Secondly, we may choose\nvarious relations. Indeed, it is possible that the relations will\ngenerate different subobjects $K$ such that $F/K\\cong A$. In practice,\npresentations are a highly compactified description of an object which\ncan hide many essential features of the object. Indeed, in the extreem\ncase are the theorems of Boone which show that in the category of groups\nit is impossible to tell if an arbitrary presentation is a presentation\nof the trivial group. For a detailed account of these theorems refer to\n\n> Joseph Rotman, *An Introduction to the Theory of Groups*, Springer,\n> New York, Fourth edition, 1995.",
  "language": "INFORMAL",
  "phrase": "Presentations Of Algebraic Objects",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/PresentationsOfAlgebraicObjects"
    }
  ],
  "indexable": true
}