{
    "indexable": true,
    "title": "Planetmath home page",
    "abstractText": "Planetmath home page",
    "beliefset": "#B.default",
    "content": "[PlanetMath](https://planetmath.org) is a virtual community which aims to help make mathematical knowledge more accessible. PlanetMath's content is created collaboratively: the main feature is the mathematics encyclopedia with entries written and reviewed by members.\n\nAlthough PlanetMath is not seeing any new content now, it has accumulated a wealth of semi-structured knowledge with the help of its community of about 24,000 people with various maths interests. With an emphasis on rigor, openness, pedagogy, real-time and interlinked content, PlanetMath has accumulated over 9000 entries containing information on a wide range of Mathematics topics. \n\nWe, at Sophize, are bringing this high-quality knowledge store into our platform. Structured knowledge extracted from the entries is being used to create a network of information that spans across encyclopedias, research papers, formal systems are more. This network will aid our users in various situations such as a) looking-up Mathematical concepts while reading a research article b) finding existing and developing new proofs c) referencing a definition/theorem while engaging in a discussion.\n\nThe following is a small sample from over 4000 definitions that we have extracted from PlanetMath:\n> - #T_LevelSet\n> - #T_Groupoid\n> - #T_HodgeTheory\n> - #T_TangentOfCircle\n> - #T_SymmetricAlgebra\n> - #T_FermatNumbers\n\nWe have also extracted hundreds of theorems - many along with their proofs\n> - #P_HilbertBasisTheorem\n> - #P_BohrMollerupTheorem\n> - #P_WilsonsTheorem\n> - #P_PythagoreanTheorem\n> - #P_RiemannsRemovableSingularityTheorem\n> - #P_CatalansIdentity\n> - #P_AdosTheorem\n> - #P_HerbrandsTheoremfirstOrderLogic\n\nAlthough we have been able to incorporate over 70% PlanetMath entries so far, we are continuing to extract more data, fixing formatting issues, and generating interlinks between the entries."
}