{
  "alternatePhrases": [],
  "definition": "We consider the properties of commuting matrices and linear\ntransformations over a vector space $V$. Two linear transformations\n$\\varphi_i:V\\rightarrow V$, $i=1,2$ are said to commute if for every\n$v\\in V$, $$\\varphi_1(\\varphi_2(v))=\\varphi_2(\\varphi_1(v)).$$ If $V$\nhas finite dimension $n$ and we fix a basis of $V$ then we may represent\nthe linear transformations as $n\\times n$ matrices $A_i$ and here the\ncondition of commuting linear transformations is equivalent to testing\nif their corresponding matrices commute: $$A_1 A_2=A_2 A_1.$$\nSimultaneous triangularisation of commuting matrices over any field can\nbe achieved but may require an extension of the field. The reason begins\nto be apparent from the study of eigenvalues.\n\nBecause the implication of commuting matrices is best expressed through\neigenvectors, we prefer the treatment of linear transformations for the\n.\n\nRecall a linear transformation $f:V\\rightarrow V$ is said to leave a\nsubspace $E\\leq V$ *invariant* if $f(E)\\leq E$.\n\nIf $\\{\\varphi\\}_{i\\in I}$ are commuting linear transformations and $E$\nis an eigenspace of $\\varphi_{i_0}$ for some $i_0\\in I$, then for all\n$i\\in I$, $\\varphi_i(E)\\leq E$.\n\nLet $\\lambda$ be the eigenvalue of $\\varphi_{i_0}$ on $E$. Take any\n$i\\in I$ and $v\\in E$. Then\n$$\\varphi_{i_0}(\\varphi_i(v))=\\varphi_i(\\varphi_{i_0}(v))=\\varphi_i(\\lambda v)\n=\\lambda \\varphi_i(v).$$ Therefore $\\varphi_i(v)\\in E$ as $E$ is the\n$\\lambda$ eigenspace of $\\varphi_{i_0}$. In particular,\n$\\varphi_i(E)\\leq E$.\n\nWe have just shown that commuting linear transformations preserve each\nother’s eigenspaces. This property does not depend on a finite dimension\nfor $V$ or a finite set of commuting transformations. However, to\ncharacterize commuting linear transformations further will require that\n$V$ have finite dimension.\n\nLet $V$ be a finite dimensional vector space and let\n$\\{\\varphi\\}_{i\\in I}$ be a family of commuting diagonalizable linear\ntransformations from $V$ to $V$. Then $\\varphi_i$ can be simultaneously\ndiagonalized.\n\nIf a finite dimensional linear transformation is diagonalizable over its\nfield then it has all its eigenvalues in the field (under some basis the\nmatrix is diagonal and the eigenvalues are simply those elements on the\ndiagonal.)\n\nIf all the eigenvalues of a linear transformation are the same then the\nassociated diagonal matrix is scalar. If all $\\varphi_i$ are scalar then\nthey are simultaneously diagonalized.\n\nNow presume that each $\\varphi_i$ is not a scalar transformation. Hence\nthere are at least two distinct eigenspaces. It follows each eigenspace\nof $\\varphi_i$ has dimension less than that of $V$.\n\nNow we set up an induction on the dimension of $V$. When the dimension\nof $V$ is 1, all linear transformations are scalar. Now suppose that for\nall vector spaces of dimension $n$, any commuting diagonalizable linear\ntransformations can be simultaneously diagonalized. Then in the case\nwhere $\\dim V=n+1$, either all the linear transformations are scalar and\nso simultaneously diagonalized, or at least one is not scalar in which\ncase its eigenspaces are proper subspaces. Since the maps commute they\nrespect each others eigenspaces. So we restrict the maps to any\neigenspace and by induction simultaneously diagonalize on this subspace.\nAs the linear transformations are diagonalizable, the sum of the\neigenspaces of any $\\varphi_i$ is $V$ so this process simultaneously\ndiagonalizes each of the $\\varphi_i$.\n\nOf course it is possible to have commuting matrices which are not\ndiagonalizable. At the other extreme are unipotent matrices, that is,\nmatrices with all eigenvalues 1. Aside from the identity matrix,\nunipotent matrices are never diagonal. Yet they often commute. But here\nthe generalized eigenspaces substitute for the usual eigenspaces.\n\nIt is generally not true that two unipotent matrices commute, even if\nthey share the same eigenspace. For example, the set of unitriangular\nmatrices forms a nilpotent group which is abelian only for\n$2\\times 2$-matrices.\n\nHowever, if we consider unipotent matrices of the form\n$$\\begin{bmatrix} I_k & * \\\\ 0 & I_j\\end{bmatrix}$$ we find these to\ncorrespond to $k\\times j$ matrices under addition. Thus this large\nfamily of unipotent matrices do commute.",
  "language": "INFORMAL",
  "phrase": "Commuting Matrices",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/CommutingMatrices"
    }
  ],
  "indexable": true
}