{
  "alternatePhrases": [
    "Euclidean vector properties"
  ],
  "definition": "A Euclidean vector is a geometric entity that has the of magnitude and\ndirection. For example, a vector in $\\mathbb{R}^2$ can be represented by\nits components like this $(3,4)$ or like this\n$\\left[\\begin{array}{c}3\\\\4\\end{array}\\right]$. This particular vector\ncan be represented geometrically like this:\n\n![Geometrical representation of a Euclidean vector](vektor1)\n\nIn $\\mathbb{R}^n$, a vector can be easily constructed as the line\nsegment between points whose in each coordinate are the components of\nthe vector. A vector constructed at the origin (The vector $(3,4)$ drawn\nfrom the point $(0,0)$ to $(3,4)$) is called a position vector. Note\nthat a vector that is not a position vector is of position. It remains\nthe same vector unless one changes its magnitude or direction.\\\n**Magnitude:** The magnitude of a vector is the from one end of the line\nsegment to the other. The magnitude of the vector comes from the metric\nof the space it is embedded in. It’s magnitude is also referred to as\nthe vector norm. In Euclidean space, this can be gotten using\nPythagorean’s theorem in $\\mathbb{R}^n$ such that for a vector\n$\\vec{v}\\in\\mathbb{R}^n$, the length $|\\vec{v}|$ is such that:\n$$|\\vec{v}|=\\sqrt{\\sum_{i=0}^n x_n^2}$$ This can also be found by the\ndot product $\\sqrt{\\vec{a}\\cdot\\vec{a}}$.\\\n**Direction:** A vector basically *is* a direction. However you may want\nto know the angle it makes with another vector. In this case, one can\nuse the dot product for the simplest computation, since if you have two\nvectors $\\vec{a}\\; ,\\vec{b}$,\n$$\\vec{a}\\cdot\\vec{b} = |\\vec{a}||\\vec{b}|\\cos\\theta$$ Since $\\theta$ is\nthe angle between the vectors, you just solve for $\\theta$. Note that if\nyou want to find the angle the vector makes with one of the axes, you\ncan use trigonometry.\n\n![Angle between a vector and the axis](vector2)\n\nIn this case, the length of the vector is just the hypotenuse of a\nsingle right triangle, and the angle $\\theta$ is just\n$\\arctan \\frac{y}{x}$, the arctangent of it’s components.\\\n**, resolving a vector into its components:** Say all we had was the\nmagnitude and angle of the vector to the x-axis and we needed the\ncomponents.(Maybe we need to do a cross product or addition). Look at\nfigure a. again. The x component of the vector can be likened to a\n“plumb line” dropped from the arrowhead of the vector to the x-axis so\nthat it is *perpendicular to* the x-axis. Thus, to get the x-component,\nall we would have to do is multiply the magnitude of the vector by the\ncosine of $\\theta$. This is called resolving the vector into its\ncomponents.\\\nNow say we had another vector at an angle $\\theta_2$ to our vector. We\nconstruct a line between the of our vector and intercept the other\nvector in the same way, perpendicularly. The length from the tail of the\nvector to our interception is called the ** of our vector onto the\nother. Note that the equation remains the same. The is still\n$d\\cos\\theta_2$. This is valid in all higher dimensions as the angle\nbetween two vectors takes place on a plane.\n\n![Projection of one vector onto another](vector3)\n\n**Miscellaneous :**\\\n$\\cdot$ Two vectors that are parallel to each other are called\n“collinear”, as they can be drawn onto the same line. Collinear vectors\nare scalar multiples of each other.\\\n$\\cdot$ Two non-collinear vectors are coplanar.\\\n$\\cdot$ There are two main of products between vectors. The dot product\n(scalar product), and the cross product (vector product). There is also\na commonly used called the triple scalar product.",
  "language": "INFORMAL",
  "phrase": "Euclidean Vector",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/EuclideanVector"
    }
  ],
  "indexable": true
}