{
  "alternatePhrases": [],
  "definition": "#### Definition.\n\nLet ${\\mathcal{L}}$ be a collection of labels $\\alpha\\in{\\mathcal{L}}$.\nFor each ordered pair of labels\n$(\\alpha,\\beta)\\in{\\mathcal{L}}\\times{\\mathcal{L}}$ let\n${\\mathcal{M}}{^{\\beta}_{\\hphantom{\\beta}\\!\\alpha}}$ be a non-singular\n$n\\times n$ matrix, the collection of all such satisfying the following\nfunctor-like consistency conditions:\n\n-   For all $\\alpha\\in {\\mathcal{L}}$, the matrix\n    ${\\mathcal{M}}{^{\\alpha}_{\\hphantom{\\alpha}\\!\\alpha}}$ is the\n    identity matrix.\n\n-   For all $\\alpha,\\beta,\\gamma \\in {\\mathcal{L}}$ we have\n    $${\\mathcal{M}}{^{\\gamma}_{\\hphantom{\\gamma}\\!\\alpha}} = {\\mathcal{M}}{^{\\gamma}_{\\hphantom{\\gamma}\\!\\beta}}\\, {\\mathcal{M}}{^{\\beta}_{\\hphantom{\\beta}\\!\\alpha}},$$\n    where the product in the right-hand side is just ordinary matrix\n    multiplication.\n\nWe then impose an equivalence relation by stipulating that for all\n$\\alpha,\\beta\\in{\\mathcal{L}}$ and ${u}\\in{\\mathbb{R}}^n$, the pair\n$(\\alpha,{u})$ is equivalent to the pair\n$(\\beta,{\\mathcal{M}}{^{\\beta}_{\\hphantom{\\beta}\\!\\alpha}}{u})$.\nFinally, we define a physical vector to be an equivalence class of such\npairs relative to the just-defined relation.\n\nThe idea behind this definition is that the $\\alpha\\in {\\mathcal{L}}$\nare labels of various coordinate systems, and that the matrices\n${\\mathcal{M}}{^{\\beta}_{\\hphantom{\\beta}\\!\\alpha}}$ encode the\ncorresponding changes of coordinates. For label\n$\\alpha\\in {\\mathcal{L}}$ and list-vector ${u}\\in{\\mathbb{R}}^n$ we\nthink of the pair $(\\alpha,{u})$ as the representation of a physical\nvector relative to the coordinate system $\\alpha$.\n\n#### Discussion.\n\nAll scientific disciplines have a need for formalization. However, the\nextent to which rigour is pursued varies from one discipline to the\nnext. Physicists and engineers are more likely to regard mathematics as\na tool for modeling and prediction. As such they are likely to blur the\ndistinction between list vectors and physical vectors. Consider, for\nexample the following excerpt from R. Feynman’s “Lectures on physics”\n[@feynman]\n\n> All quantities that have a direction, like a step in space, are called\n> vectors. A vector is three numbers. In order to represent a step in\n> space, $\\ldots$, we really need three numbers, but we are going to\n> invent a single mathematical symbol, $\\mathbf{r}$, which is unlike any\n> other mathematical symbols we have so far used. It is [*not*]{} a\n> single number, it represents [*three*]{} numbers: $x$, $y$, and $z$.\n> It means three numbers, but not only [*those*]{} three numbers,\n> because if we were to use a different coordinate system, the three\n> numbers would be changed to $x'$, $y'$, and $z'$. However, we want to\n> keep our mathematics simple and so we are going to use the [*same\n> mark*]{} to represent the three numbers $(x,y,z)$ and the three\n> numbers $(x',y',z')$. That is, we use the same mark to represent the\n> first set of three numbers for one coordinate system, but the second\n> set of three numbers if we are using the other coordinate system. This\n> has the advantage that when we change the coordinate system, we do not\n> have to change the letters of our equations.\n\nSurely you are joking Mr. Feynman!? What are we supposed to make of this\ndefinition? We learn that a vector is both a physical quantity, and a\nlist of numbers. However we also learn that it is not really a specific\nlist of numbers, but rather any of a number of possible lists.\nFurthermore, the choice of which list is being used is dependent on the\ncontext (choice of coordinate system), but this is not really important\nbecause we just end up using the same symbol $\\mathbf{r}$ regardless.\n\nWhat a muddle! Even at the informal level one can do better than\nFeynman. The central weakness of his definition is that he is unwilling\nto distinguish between physical vectors (quantities) and their\nrepresentation (lists of numbers). Here is an alternative physical\ndefinition from a book by R. Aris on fluid mechanics [@aris].\n\n> There are many physical quantities with which only a single magnitude\n> can be associated. For example, when suitable units of mass and length\n> have been adopted the density of a fluid may be measured. $\\ldots$\n> There are other quantities associated with a point that have not only\n> a magnitude but also a direction. If a force of 1 lb weight is said to\n> act at a certain point, we can still ask in what direction the force\n> acts and it is not fully specified until this direction is given. Such\n> a physical quantity is a [ *vector*]{}. $\\ldots$ We distinguish\n> therefore between the vector as an entity and its components which\n> allow us to reconstruct it [*in a particular system of reference.*]{}\n> The set of components is meaningless unless the system of reference is\n> also prescribed, just as the magnitude 62.427 is meaningless as a\n> density until the units are also prescribed. $\\ldots$.\n>\n> [*Definition.*]{} A Cartesian vector, $\\mathbf{a}$, in three\n> dimensions is a quantity with three components $a_1, a_2, a_3$ in the\n> frame of reference $O123$, which, under rotation of the coordinate\n> frame to $O\\bar{1}\\bar{2}\\bar{3}$, become components\n> $\\bar{a}_1, \\bar{a}_2, \\bar{a}_3$, where $$\\bar{a}_j = l_{ij} a_i.$$\n> The vector $\\mathbf{a}$ is to be regarded as an entity, just as the\n> physical quantity it represents is an entity. It is sometimes\n> convenient to use the bold face $\\mathbf{a}$ to show this. In any\n> particular coordinate system it has components $a_1, a_2, a_3$, and it\n> is at other times convenient to use the typical component $a_i$.\n\nHere we see a carefully drawn distinction between physical quantities\nand the numerical measurements that represent them. A system of\nmeasurement, i.e. a choice of units and or coordinate axes, turns\nphysical quantities into numbers. However the correspondence is not\nfixed, but varies according to the choice of measurement system. This\npoint of view can be formalized by representing physical vectors as\nlabeled list vectors, the label specifying a choice of measurement\nsystems. The actual vector is then defined to be an equivalence class of\nsuch labeled list vectors.\n\n[99]{} R. Feynman, R. Leighton, and M. Sands, “Lectures on Physics”,\n11-4, Vol. I, Addison-Wesley. R. Aris, “Vectors, Tensors and the Basic\nEquations of Fluid Mechanics”, Dover.",
  "language": "INFORMAL",
  "phrase": "Physical Vector",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/PhysicalVector"
    }
  ],
  "indexable": true
}