{
  "alternatePhrases": [],
  "definition": "#### Introduction.\n\n, or tensors for short[^1] are multidimensional arrays with two types of\n(covariant and contravariant) indices. Tensors are widely used in\nscience and mathematics, because these data structures are the natural\nchoice of representation for a variety of important physical and\ngeometric quantities.\n\nIn this entry we give the definition of a tensor array and establish\nsome related terminology and notation. The theory of tensor arrays\nincorporates a number of other essential topics: basic tensors, tensor\ntransformations, outer multiplication, contraction, inner\nmultiplication, and generalized transposition. These are fully described\nin their separate entries.\n\n#### Valences and the space of tensors arrays.\n\nLet ${\\mathbb{K}}$ be a field[^2] and let $I$ be a finite list of\nindices[^3], such as $(1,2,\\ldots, n)$. A tensor array of type\n$$(p,q),\\quad p,q\\in{\\mathbb{N}}$$ is a mapping\n$$I^p\\times I^q\\rightarrow {\\mathbb{K}}.$$ The set of all such mappings\nwill be denoted by ${{\\mathrm{T}}^{p,q}}(I,{\\mathbb{K}})$, or when $I$\nand ${\\mathbb{K}}$ are clear from the context, simply as\n${{\\mathrm{T}}^{p,q}}$. The numbers $p$ and $q$ are called,\nrespectively, the contravariant and the covariant valence of the tensor\narray.\n\nPoint-wise addition and scaling give ${{\\mathrm{T}}^{p,q}}$ the\nstructure of a a vector space of dimension $n^{p+q}$, where $n$ is the\ncardinality of $I$. We will interpret $I^0$ as signifying a singleton\nset. Consequently ${{\\mathrm{T}}^{p,0}}$ and ${{\\mathrm{T}}^{0,q}}$ are\njust the maps from, respectively, $I^p$ and $I^q$ to ${\\mathbb{K}}$. It\nis also customary to identify ${{\\mathrm{T}}^{1,0}}$ with\n${\\mathbb{K}}^I$, the vector space of list vectors indexed by $I$, and\nto identify ${{\\mathrm{T}}^{0,1}}$ with dual space\n${\\left(}{\\mathbb{K}}^I{\\right)}^*$ of linear forms on ${\\mathbb{K}}^I$.\nFinally, ${{\\mathrm{T}}^{0,0}}$ can be identified with ${\\mathbb{K}}$\nitself. In other words, scalars are tensor arrays of zero valence.\n\nLet $X:I^p\\times I^q\\rightarrow {\\mathbb{K}}$ be a type $(p,q)$ tensor\narray. In writing the values of $X$, it is customary to write\ncontravariant indices using superscripts, and covariant indices using\nsubscripts. Thus, for indices $i_1,\\ldots, i_p, j_1,\\ldots,j_q\\in I$ we\nwrite $$X^{i_1\\ldots\n  i_p}_{j_1\\ldots j_q}$$ instead of [^4] $$X(i_1,\\ldots,i_p;j_1,\\ldots,\nj_p).$$\n\nWe also mention that it is customary to use columns to represent\ncontravariant index dimensions, and rows to represent the covariant\nindex dimensions. Thus column vectors are type $(1,0)$ tensor arrays,\nrow vectors are type $(0,1)$ tensor arrays, and matrices, in as much as\nthey can be regarded either as rows of columns or as columns of rows,\nare type $(1,1)$ tensor arrays.[^5]\n\n#### Notes.\n\nIt must be noted that our usage of the term [*tensor array*]{} is\nnon-standard. The traditionally inclined authors simply call these data\nstructures tensors. We bother to make the distinction because the\ntraditional nomenclature is ambiguous and doesn’t include the modern\nmathematical understanding of the tensor concept. (This is explained\nmore fully in the .) Precise and meaningful definitions can only be\ngiven by treating the concept of a tensor array as distinct from the\nconcept of a geometric/abstract tensor.\n\nWe also mention that the term [*tensor*]{} is often applied to objects\nthat should more appropriately be termed a [*tensor field*]{}. The\nlatter are tensor-valued functions, or more generally sections of a\ntensor bundle. A tensor is what one gets by evaluating a tensor field at\none point. Informally, one can also think of a tensor field as a tensor\nwhose values are functions, rather than constants.\n\n[^1]: The term [*tensor*]{} has other meanings, c.f. the .\n\n[^2]: In physics and differential geometry, ${\\mathbb{K}}$ is typically\n    ${\\mathbb{R}}$ or ${\\mathbb{C}}$.\n\n[^3]: It is advantageous to allow general indexing sets, because one can\n    indicate the use of multiple frames of reference by employing\n    multiple, disjoint sets of indices.\n\n[^4]: Curiously, the latter notation is preferred by some authors. See\n    H. Weyl’s books and papers, for example.\n\n[^5]: It is also customary to use matrices to also represent type\n    $(2,0)$ and type $(0,2)$ tensor arrays (The latter are used to\n    represent quadratic forms.) Speaking idealistically, such objects\n    should be typeset, respectively, as a column of column vectors and\n    as a row of row vectors. However typographical constraints and\n    notational convenience dictate that they be displayed as matrices.",
  "language": "INFORMAL",
  "phrase": "Tensor Array",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/TensorArray"
    }
  ],
  "indexable": true
}