{
  "alternatePhrases": [
    "abstract vector"
  ],
  "definition": "#### Overview.\n\nThe word *vector* has several distinct, but interrelated meanings. The\npresent entry is an overview and discussion of these concepts, with\nlinks at the end to more detailed definitions.\n\n-   A *list vector* (follow the link to the formal definition) is a\n    finite list of numbers[^1]. Most commonly, the vector is composed of\n    real numbers, in which case a list vector is just an element of\n    ${\\mathbb{R}}^n$. Complex numbers are also quite common, and then we\n    speak of a complex vector, an element of ${\\mathbb{C}}^n$. Lists of\n    ones and zeroes are also utilized, and are referred to as binary\n    vectors. More generally, one can use any field ${\\mathbb{K}}$, in\n    which case a list vector is just an element of ${\\mathbb{K}}^n$.\n\n-   A *physical vector* (follow the link to a formal definition and\n    in-depth discussion) is a geometric quantity that correspond to a\n    linear displacement. Indeed, it is customary to depict a physical\n    vector as an arrow. By choosing a system of coordinates a physical\n    vector ${\\mathbf{v}}$, can be represented by a list vector\n    $(v^1,\\ldots,v^n){^{\\scriptscriptstyle\\mathrm{T}}}$. Physically, no\n    single system of measurement cannot be preferred to any other, and\n    therefore such a representation is not canonical. A linear change of\n    coordinates induces a corresponding linear transformation of the\n    representing list vector.\n\n    In most physical applications vectors have a magnitude as well as a\n    direction, and then we speak of a Euclidean vector. When lengths and\n    angles can be measured, it is most convenient to utilize an\n    orthogonal system of coordinates. In this case, the magnitude of a\n    Euclidean vector ${\\mathbf{v}}$ is given by the usual Euclidean norm\n    of the corresponding list vector,\n    $$\\Vert {\\mathbf{v}}\\Vert = \\sqrt{{\\textstyle \\sum_i} (v^i)^2}\\;.$$\n    This definition is independent of the choice of orthogonal\n    coordinates.\n\n-   An *abstract vector* is an element of a vector space. An abstract\n    Euclidean vector is an element of an inner product space. The\n    connection between list vectors and the more general abstract\n    vectors is fully described in the entry on .\n\n    Essentially, given a finite dimensional abstract vector space, a\n    choice of a coordinate frame (which is really the same thing as a\n    basis) sets up a linear bijection between the abstract vectors and\n    list vectors, and makes it possible to represent the one in terms of\n    the other. The representation is not canonical, but depends on the\n    choice of frame. A change of frame changes the representing list\n    vectors by a matrix multiplication.\n\n    We also note that the axioms of a vector space make no mention of\n    lengths and angles. The vector space formalism can be enriched to\n    include these notions. The result is the axiom system for inner\n    products.\n\n    Why do we bother with the “bare-bones” formalism of length-less\n    vectors? The reason is that some applications involve velocity-like\n    quantities, but lack a meaningful notion of speed. As an example,\n    consider a multi-particle system. The state of the system is\n    represented as a point in some manifold, and the evolution of the\n    system is represented by velocity vectors that live in that\n    manifold’s tangent space. We can superimpose and scale these\n    velocities, but it is meaningless to speak of a speed of the\n    evolution.\n\n#### Discussion.\n\nWhat is a vector? This simple question is surprisingly difficult to\nanswer. Vectors are an essential scientific concept, indispensable for\nboth the physicist and the mathematicians. It is strange then, that\ndespite the obvious importance, there is no clear, universally accepted\ndefinition of this term.\n\nThe difficulty is one of semantics. The term [*vector*]{} is ambiguous,\nbut its various meanings are interrelated. The different usages of\n[*vector*]{} call for different formal definitions, which are similarly\ninterrelated. List vectors are the most elementary and familiar kind of\nvectors. They are easy to define, and are mathematically precise.\nHowever, saying that a vector is just a list of numbers leads to\nconceptual difficulties.\n\nA physicist needs to be able to say that velocities, forces, fluxes are\nvectors. A geometer, and for that matter a pilot, will think of a vector\nas a kind of spatial displacement. Everyone would agree that a choice of\na vector involves multiple degrees of freedom, and that vectors can\nlinearly superimposed. This description of “vector” evokes useful and\nintuitive understanding, but is difficult to formalize.\n\nThe synthesis of these conflicting viewpoints is the modern mathematical\nnotion of a vector space. The key innovation of modern, formal\nmathematics is the pursuit of generality by means of abstraction. To\nthat end, we do not give an answer to “What is a vector?”, but rather\ngive a list of properties enjoyed by all objects that one may reasonably\nterm a “vector”. These properties are just the axioms of an abstract\nvector space, or as Forrest Gump[@gump] might have put it, “A vector is\nas a vector does.”\n\nThe axiomatic approach afforded by vector space theory gives us maximum\nflexibility. We can carry out an analysis of various physical vector\nspaces by employing propositions based on vector space axioms, or we can\nchoose a basis and perform the same analysis using list vectors. This\nflexibility is obtained by means of abstraction. We are not obliged to\nsay what a vector [*is*]{}; all we have to do is say that these abstract\nvectors enjoy certain properties, and make the appropriate deductions.\nThis is similar to the idea of an abstract class in object-oriented\nprogramming.\n\nSurprisingly, the idea that a vector is an element of an abstract vector\nspace has not made great inroads in the physical sciences and\nengineering. The stumbling block seems to be a poor understanding of\nformal, deductive mathematics and the unstated, but implicit attitude\nthat\n\n> *formal manipulation of a physical quantity requires that it be\n> represented by one or more numbers.*\n\nGreat historical irony is at work here. The classical, Greek approach to\ngeometry was purely synthetic, based on idealized notions like point and\nline, and on various axioms. Analytic geometry, a la , arose much later,\nbut became the dominant mode of thought in scientific applications and\nlargely overshadowed the synthetic method. The pendulum began to swing\nback at the end of the nineteenth century as mathematics became more\nformal and important new axiomatic systems, such as vector spaces,\nfields, and topology, were developed. The cost of increased abstraction\nin modern mathematics was more than justified by the improvement in\nclarity and organization of mathematical knowledge.\n\nAlas, to a large extent physical science and engineering continue to\ndwell in the $19{^{\\text{th}}}$ century. The axioms and the formal\ntheory of vector spaces allow one to manipulate formal geometric\nentities, such as physical vectors, without first turning everything\ninto numbers. The increased level of abstraction, however, poses a\nformidable obstacle toward the acceptance of this approach. Indeed,\nmainstream physicists and engineers do not seem in any great hurry to\naccept the definition of [*vector*]{} as something that dwells in a\nvector space. Until this attitude changes, [*vector*]{} will retain the\nambiguous meaning of being both a list numbers, and a physical quantity\nthat transforms with respect to matrix multiplication.\n\n[99]{} R. Zemeckis, “Forrest Gump”, Paramount Pictures.\n\n[^1]: Infinite vectors arise in areas such as functional analysis and\n    quantum mechanics, but require a much more complicated and\n    sophisticated theory.",
  "language": "INFORMAL",
  "phrase": "Vector",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Vector"
    }
  ],
  "indexable": true
}