{
  "alternatePhrases": [],
  "definition": "Hypothesis testing is a statistical inferencial procedure in which a\nstatement based on some experimental or observational study is\nformulated, tested, then put through a decision process. The decision\nprocess either accepts or rejects the statement.\n\nMore precisely, the hypothesis testing procedure can be broken down into\nthree steps:\n\n1.  Formulation of a (hypothetical) statement.\n\n    The hypothetical statement formed is called the null hypothesis, or\n    $H_0$. For example, in testing whether a coin is “fair”, it is\n    tossed 100 times and the number of heads are counted. $H_0$ could be\n    $\\lbrace\\mbox{ The number of heads = }50 \\rbrace$. Accompanying the\n    null hypothesis $H_0$ is the alternative hypothesis $H_a$. The\n    statement in $H_a$ is the compliment of the statement in $H_0$ (the\n    universe is the sample space). For example, $H_a$ would be\n    $\\lbrace\\mbox{ The number of heads }\\neq 50 \\rbrace$.\n\n2.  Testing of the statement.\n\n    This is usually the most mathematical part of the procedure. To test\n    $H_0$, first assume $H_0$ is true. Then apply an appropriate test\n    statistic using values obtained from the study. There are many test\n    statistics, depending on $H_0$, $H_a$, and the nature of the study.\n\n    Based on the distributional forms of these test statistics, four\n    major types of tests are of interest. A *t test* is based on a test\n    statistic that has a t-distribution. An and a are so named for the\n    same reason. A *z-test* is one that is based on a test statistic\n    having a normal or Gaussian distribution.\n\n    Before calculating the test statistic, a value of the *significance\n    level* of the test needs to be specified. The significance level,\n    known as $\\alpha$, is the probability of rejecting $H_0$ (or\n    accepting $H_a$) when in fact, $H_0$ is true:\n    $\\alpha=P(H_a\\mid H_0)$.\n\n3.  Deciding whether to accept or reject the statement.\n\n    Once the value of the test statistic is obtained, it is used to find\n    a corresponding probability of obtaining such a statistic given that\n    $H_0$ is true. This probability is called the *p-value*. This\n    $p$-value is then compared $\\alpha$, the significance level of the\n    test. If $p$-value $<\\alpha$, then the usual next step is to reject\n    the null hypothesis $H_0$ (and $H_a$ accepted). Otherwise, $H_0$\n    will be accepted.\n\nWhen a statement (whether it is null hypothesis or the alternative\nhypothesis) is accepted, it merely says that, statistically, there is\nnot enough evidence to reject the statement. Acceptance of a\nhypothetical statement does not prove that the underlying statement is\ntrue.\n\nThe concept of statistical hypothesis testing can be found in any\nstandard introductory statistics textbooks, as well as numerous internet\nwebsites (for example, ). The purpose of this entry is to give a very\nbrief description of hypothesis testing and to serve as a link reference\nfor other entries.",
  "language": "INFORMAL",
  "phrase": "Hypothesis Testing",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/HypothesisTesting"
    }
  ],
  "indexable": true
}