{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "[**Theorem**]{}. All positive integers are polite numbers (that is, can\nbe expressed as the sum of consecutive nonnegative integers in at least\none way), with the exception of the even powers of two.\n\nPerhaps the most elegant way to prove this theorem is to assert that the\npowers of two do have “polite representations” and follow the logic\nuntil a contradiction is reached. But this might not answer any other\nquestions about what forms these representations take. Looking at a\ntable of representations, it is clear that some numbers have lots of\nrepresentation, and that there are patterns to these representations.\nProving this theorem, however, requires only showing that most numbers\nhave at least one representation and the powers of two have none. The\npatterns observed from a table of representations can actually be used\nto build up a proof.\n\nLemma 1. An odd number $n$ is always a polite number.\n\nIf nothing else, there is always $n = m + (m + 1)$, with\n$m = \\frac{n - 1}{2}$. Note that for $n = 1$, the only valid\nrepresentation is 0 + 1, which, while inelegant, is technically valid\nbecause the theorem calls for sums of nonnegative numbers, as opposed to\npositive numbers. This takes care of all the odd numbers.\n\nBut what of the even numbers? There is no ready way to generalize this\nto all even numbers, so perhaps we could try classifying the even\nnumbers as singly even (or odd times 2) and doubly even.\n\nLemma 2. Any singly even number $n \\equiv 2 \\mod 4$ is the sum of four\nconsecutive integers.\n\nWe rewrite $n$ as $4m + 2$. The relevant four consecutive integers are\n$(m - 1)$, $m$, $(m + 1)$ and $(m + 2)$. We verify that\n$(m - 1) + m + (m + 1) + (m + 2) = 4m - 1 + 1 + 2 = 4m + 2 = n$. Note\nthat for $n = 2$ the consecutive integers are $-1$, 0, 1 and 2, with the\nfirst of these being a negative number.\n\nSo all composite singly even numbers are taken care of by this lemma.\n\nLemma 3. All multiples of 3 are polite, represented by the sum of three\nconsecutive integers.\n\nGiven $n = 3m$, we rewrite $2m$ as $(m - 1) + (m + 1)$. Then $(m - 1)$,\n$m$ and $(m + 1)$ are the consecutive integers, verified with\n$(m - 1) + m + (m + 1) = 2m + m = 3m = n$.\n\nThe number 3 has a representation by Lemma 1, that is, 3 = 1 + 2, but\nLemma 3 also gives a valid representation: 3 = 0 + 1 + 2.\n\nLemma 4. All multiples of 5 are polite, represented by the sum of five\nconsecutive integers.\n\nGiven $n = 5m$, we rewrite $4m$ as\n$(m - 2) + (m - 1) + (m + 1) + (m + 2)$. Then $(m - 2)$, $(m - 1)$, $m$,\n$(m + 1)$ and $(m + 2)$ are the consecutive integers, verified with\n$(m - 2) + (m - 1) + m + (m + 1) + (m + 2) = 4m + m = 5m = n$.\n\nFor the number 5, we have to fall back on Lemma 1. But for 10 and all\nhigher multiples of 5, this lemma gives a valid representation.\n\nObviously these last two lemmas can be generalized.\n\nLemma 5. All composite multiples of an odd prime $p$ are the sum of $p$\nconsecutive integers.\n\nIf $n = (m + 1) + (m + 2) + \\ldots + (m + p)$ then clearly\n$n = mp + 1 + 2 + \\ldots + p$. Ignoring $mp$ and $p$ for a moment, we\ncan pair up each addend from 1 to $p - 1$ with another number in the\nrange so the two of them add up to $p$: $1 + (p - 1)$, $2 + (p - 2)$,\netc. Since $p - 1$ is even, no number is left out in this pairing up.\nThus we have $\\displaystyle \\left( \\frac{p - 1}{2} \\right)p$. Putting\nthe last $p$ back in we have\n$\\displaystyle \\left( \\frac{p - 1}{2} + 1 \\right)p = \\left( \\frac{p^2 - p}{2} + p \\right) = \\left( \\frac{p^2 + p}{2} \\right).$\nThis means that the $p$th triangular number $T_p$ is divisible by $p$.\nPutting $mp$ back in, it is now clear that since\n$\\displaystyle n = mp + \\left( \\frac{p^2 + p}{2} \\right)$, $n$ is is\ndivisible by $p$. The smallest multiple of $p$ thus representable with a\nrun of consecutive nonnegative integers is the $(p - 1)$th triangular\nnumber, which is the sum of the integers from 0 to $p - 1$.\n\nSince $p$ is an odd prime, it has a representation under Lemma 1. But\nwhat of $2p$ to $T_{p - 1} - p$? $2p$ is singly even, and is thus\ncovered by Lemma 2. Any other composite multiple of $p$ between $2p$ and\n$p^2$ must be divisible by some other odd prime and is thus covered by\nthis Lemma anyway. For example, the multiples of 11: the number 22 is\ncovered by Lemma 2, 33 is covered by this Lemma using $p = 3$, and 55 is\ncovered by this Lemma using $p = 5$. For 77, this Lemma applies with\neither $p = 7$ or $p = 11$.\n\nLemma 6. Any run of $mp$ consecutive integers, with $p$ an odd prime,\nwill add up to a multiple of $p$.\n\nBreaking up the single run of $mp$ consecutive integers into $m$ runs of\n$p$ consecutive integers, it is clear by the previous lemma that each of\nthose $m$ runs add up to a multiple of $p$. Adding up $m$ multiples of\n$p$ gives yet another multiple of $p$.\n\nLemma 7. A run of $2^a$ consecutive integers is divisible by $2^{a - 1}$\nbut not $2^a$.\n\nWith $n = (m + 1) + (m + 2) + \\ldots + (m + 2^a)$, the $m$s clearly add\nup to $2^a m$. What of the $2^a$th triangular number? We can pair up\nalmost all the numbers 1 to $2^a - 1$ so that they add up to $2^a$:\n$1 + 2^a - 1$, $2 + 2^a - 2$, etc. These add up to\n$(2^a - 2)2^a = 2^{2a} - 2^{a + 1}$. But since $2^a$ is even and\n$2^a - 1$ odd, there is a number left out, specifically\n$\\frac{2^a}{2} = 2^{a - 1}$. So we have\n$n = 2^a m + (2^{2a} - 2^{a + 1}) + 2^{a - 1}$. All three addends are\ndivisible by $2^{a - 1}$ but only the first two are divisible by $2^a$.\n\nTo prove the theorem now is simply a matter of putting the lemmas\ntogether.\n\nLemma 1 took care of proving that all odd numbers are polite. Lemma 2\ntook care of proving all singly even numbers are polite, with the\nimportant exception of 2, the first power of two. At this point it\nremains to prove whether or not all doubly even numbers are polite, but\nthere seems no simple way to kill all the birds with one stone. So from\nhere we’ll try to prove politeness for kinds of numbers that overlap\npartially with those covered by the first two lemmas. Lemma 3 proves the\npoliteness of multiples of 3 by giving the solution as a sum of three\nconsecutive integers. Then Lemma 4 proves the politeness of multiples of\n5 by giving the solution as a sum of five consecutive integers.\nObviously it is impractical to try to prove this for every single odd\nprime, so it is far more efficient to generalize this to all odd primes\nwithout any loss of comprehesion. Thus Lemma 5 makes this\ngeneralization, and from this follows Lemma 6, which shows that any run\nof $p$ consecutive integers adds up to a multiple of $p$.\n\nNow we have covered the politeness of: all odd numbers, all singly even\nnumbers except 2, and some of the doubly even numbers, namely those\ndivisible by odd primes. So now it remains to prove or disprove the\npoliteness of powers of two. The solution for a power of two must not be\na run of $mp$ consecutive integers with $p$ an odd prime, since\n$2^a \\nmid p$. By Lemma 7, a run of consecutive integers that add up to\na multiple of $2^a$ must be $2^{a + 1}$ long. To determine the smallest\nnumber such a run of nonnegative integers would add up to, we plug\n$m = 0$ into the second equation for $n$ given by Lemma 7, obtaining\n$n = (2^{2a} - 2^{a + 1}) + 2^{a - 1}$. This means that $n > 2^a$, even\nwhen $m = 0$. Furthermore, there is no way to reduce the expression we\nhave obtained for $n$ to a single power of two, meaning that $n$ must be\ndivisible by some odd prime. This proves that there is no run of\nconsecutive nonnegative integers that will add up to a power of two\nother than 1. It has already been proven that all other positive\nintegers do have such a representation.\n\nJust a few quick examples: The even number 30 can be represented as the\nsum of four consecutive integers (6 + 7 + 8 + 9), and since it is a\nmultiple of 3 and 5, it can be represented as the sum of three or four\nconsecutive integers: 9 + 10 + 11 = 4 + 5 + 6 + 7 + 8. The odd number 31\ncan be represented as 15 + 16. We can represent some multiples of 32 as\nthe sum of 64 consecutive positive integers; the smallest number\nrepresentable thus is 2080, which leaves a remainder of 32 when divided\nby 64, showing that it is divisible by 32, but also by the odd primes 5\nand 13.",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AllPositiveIntegersArePoliteNumbersExceptPowersOfTwo"
    }
  ],
  "indexable": true,
  "names": [
    "all positive integers are polite numbers except powers of two"
  ]
}