{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "Fermat’s Last Theorem\n=====================\n\nFermat’s last theorem was put forth by Pierre de Fermat around 1630. It\nstates that the Diophantine equation ($a, b, c, n \\in \\mathbb{N}$)\n\n$$a^n + b^n = c^n$$\n\nhas no non-zero solutions for $n>2$.\n\nHistory\n=======\n\nFermat’s last theorem was actually a conjecture and remained unproved\nfor over 300 years. It was finally proven in 1994 by Andrew Wiles, an\nEnglish mathematician working at Princeton. It was always called a\n“theorem”, due to Fermat’s uncanny ability to propose true conjectures.\nOriginally the statement was discovered by Fermat’s son Clement-Samuel\namong margin notes that Fermat had made in his copy of Diophantus’\n*Arithmetica*. Fermat followed the statement of the conjecture with the\ninfamous teaser:\n\n[*“I have discovered a truly remarkable proof which this margin is too\nsmall to contain”*]{}\n\nOver the years, Fermat’s last theorem was proven for various sub-cases\nwhich required specific values of $n$, but no direct progress was made\nalong these lines towards a general proof. These proofs were bittersweet\nvictories, as each one still left an infinite number of cases unproved.\nAmong the big names who took a crack at the theorem are Euler, Gauss,\nGermaine, Cauchy, Dirichlet, and Legendre.\n\nThe theorem finally began to yield to direct attack in the 20th century.\n\nThe Proof\n=========\n\nIn 1982 Gerhard Frey conjectured that if FLT has a solution\n($a$,$b$,$c$,$n$), then the elliptic curve defined by\n\n$$y^2 = x(x-a^n)(x+b^n)$$\n\nis semistable, but not modular. The above equation is known as Frey’s\nequation, or the Frey curve. Ribet proved this conjecture in 1986.\n\nThe Taniyama-Shimura conjecture, which appeared in an early form in\n1955, says that all elliptic curves are modular. If in fact this\nconjecture were to be proven in the semistable case, then it would\nfollow that the Frey equation would be semistable *and* modular, hence\nFLT could have no solutions.\n\nAfter a flawed attempt in 1993, Wiles along with Richard Taylor\nsuccessfully proved the semistable case of the Taniyama-Shimura\nconjecture in 1994, hence proving Fermat’s last theorem. The proof\nappears in the May 1995 [*Annals of Mathematics*]{}, Vol. 151, No. 3. It\nis 129 pages.\n\nSpeculation\n===========\n\nWiles’ proof rests upon the work of hundreds of mathematicians and the\nmathematics created up to and including the 20th century. We cannot\nimagine how Fermat’s last theorem could be proved without these advanced\nmathematical tools, which include group theory and Galois theory, the\ntheory of modular forms, Riemannian topology, and the theory of elliptic\nequations.\n\nCould Fermat, then, have possibly had a proof to his own conjecture, in\nthe year 1630? It doesn’t seem likely, given the requisite mathematics\nbehind the proof as we know it. Assuming Fermat’s teaser was truthful,\nand Fermat was not in error, this apparent paradox has led some to\njokingly attribute supernatural abilities to Fermat.\n\nA more interesting possibility is that there is yet another proof, which\nis elementary and utilizes no more knowledge than Fermat had available\nin his day.\n\nMost mathematicians, however, think that Fermat was just in error. It is\nalso possible that he realized later that he didn’t have a solution, but\nof course did not amend the margin notes where he wrote his tantalizing\nstatement.\n\nStill, we cannot rule out the existence of a simpler proof, so for some,\nthe search continues...\n\n[3]{}\n\n, by J J O’Connor and E F Robertson.\n\n, web site by David Shay.\n\n(offline book), by Simon Singh.",
  "citations": [
    {
      "textCitation": "https://planetmath.org/FermatsLastTheorem"
    }
  ],
  "indexable": true,
  "names": [
    "Fermat's last theorem",
    "FLT"
  ]
}