{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "[**Conjecture**]{}. (Zhi-Wei Sun) Any positive integer $n \\neq 216$ is\neither a prime number $p_i$, a triangular number $T_j$ or the sum of a\nprime number and a triangular number $p_i + T_j$.\n\nFor example, 47 = 37 + 10; 37 is a prime number and 10 is a triangular\nnumber. (There are other solutions).\n\nAlthough there are infinitely many triangular numbers, they are spaced\nfarther apart as their indexes get larger. But no matter how large $T_j$\nmight be, the next higher triangular number is always $j + 1$ away. To\nput it algebraically, $T_{j + 1} = T_j + (j + 1)$, with $T_1 = 1$ (or\n$T_0 = 0$ if one likes). It is also true that there are infinitely many\nprime numbers, but the distance between one prime and the next is not as\nneatly predictable as it is for the triangular numbers; there is no\nknown simple formula that takes $n$ as its sole argument and gives the\n$n$th prime as its output. There could very well be a record-setting\nprime gap that is immediately followed by a prime quadruplet, but that’s\nanother conjecture altogether. The point is that the larger $n$ is the\nless likely it is to be a prime or a triangular number. From this line\nof reasoning, it would be easy to jump to the conclusion that it is also\nless likely to be the sum of a prime and a triangular number.\n\nThat would be hasty. In contrast to the decreasing likelyhood of\nprimality or triangularity, for larger $n$ the value of $\\pi(n)$ (the\nprime counting function) increases, as does $\\tau(n)$ (the triangular\nnumber counting function, here represented by that much overloaded Greek\nletter). Thus there is a greater likelihood that one of the values of\n$n - p_i$ (for $0 < i < \\pi(n)$) will be a triangular number, or that\none of the values of $n - T_j$ (for $0 < j < \\tau(n)$) will be a prime\nnumber. For most numbers less than 512, there is more than one\nrepresentation as the sum of a prime and a triangular number.\n\nThere are many theorems and conjectures in additive number theory in the\nmold of “Every sufficiently large number is the sum of two or three\nnumbers of a specific kind,” with the word “sufficiently large”\nindicating a greater than inequality. For example, every even $n > 46$\nis the sum of two abundant numbers. So, besides involving numbers of two\ndifferent kinds rather than two or three of the same kind, this\nconjecture is also unusual in that it gives a negated equality rather\nthan a greater than inequality.\n\nSun has checked it for $n$ below 17000000. He admits 0 as a triangular\nnumber and almost tacitly 0 as a prime number. The conjecture has been\nstated the differently here so as to not identify 0 as a prime number.\nIn the range 1 to 512, only in the cases of 2 and 61 is it necessary to\naccept 0 as a triangular number. The differences $216 - T_j$ are: 6, 26,\n45, 63, 80, 96, 111, 125, 138, 150, 161, 171, 180, 188, 195, 201, 206,\n210, 213, 215; a list that includes some semiprimes.\n\n[1]{} Zhi-Wei Sun, “On Sums of Primes and Triangular Numbers” ArXiv\npreprint, 10 April (2008): 2, Conjecture 1.2",
  "citations": [
    {
      "textCitation": "https://planetmath.org/SunsConjectureOnSumsOfPrimesAndTriangularNumbers"
    }
  ],
  "indexable": true,
  "names": [
    "Sun's conjecture on sums of primes and triangular numbers"
  ]
}