{
  "alternatePhrases": [],
  "definition": "Digital System\n==============\n\nMost[^1] written number systems are built upon the concept of a *digital\nsystem* (or *positional system*) for their functioning and conveying of\nquantitative meaning. In these systems, meaning is derived from two\nthings: symbols and positions. A particular symbol in a specific place\nis called a *digit*.\n\nThe representation of a value in a digital system follows the schema:\n\n$$\\ldots s_2 s_1 s_0 . s_{-1} s_{-2} s_{-3} \\ldots$$\n\nWhere each $s_i$ is some symbol that has a quantitative value (a digit).\nPlaces to the left of the point ($.$) are worth whole units, and places\nto the right are worth fractional units. It is the *base* that tells us\nhow much of a fraction or how many whole units. Once a base $b$ is\nchosen, the value of a number $s_2 s_1 s_0 . s_{-1} s_{-2} s_{-3}$ would\nbe calculated like:\n\n$$s_2 s_1 s_0 . s_{-1} s_{-2} s_{-3} = s_2 \\cdot b^{2} + s_1 \\cdot b^{1} + s_0 \\cdot b^{0} + s_{-1} \\cdot b^{-1} + s_{-2} \\cdot b^{-2} + s_{-3} \\cdot b^{-3}$$\n\nIn our now-standard, Arabic-derived decimal system, the base $b$ is\nequal to 10. Other very common (and useful) systems are binary,\nhexadecimal, and octal, having $b=2$, $b=16$, and $b=8$ respectively\n[^2].\n\nEach $s_i$ is a member of an alphabet of symbols which must have $b$\nmembers. Intuitively this makes sense: when we try to represent the\nnumber which follows “9” in the decimal system, we know it must be “10”,\nsince there is no symbol after “9.” Hence, position as well as symbol\nconveys the meaning, and base tells us how much a unit in each position\nis worth.\n\nRemark\n======\n\nCuriously, though one would think that the choice of base leads to\nmerely a different way of rendering the same information, there are\ninstances where things are variously provable or proven in some bases,\nbut not others. For instance, there exists a non-recursive formula for\nthe $n$th **binary** digit of $\\pi$, but not for decimal– one still must\ncalculate all of the $n-1$ preceding decimal digits of $\\pi$ to get the\n$n$th (see ).\n\n[^1]: but not all– see Roman numerals for an example of a baseless\n    number system.\n\n[^2]: These are generic systems which are capable of representing any\n    number. By contrast, our system of written time is a curious hybrid\n    of bases (60, 60, and then 10 from there on) and has a fixed number\n    of whole places and a different number of symbols (24) in the\n    highest place, making it capable only of representing the same\n    discrete, finite set of values over and over again.",
  "language": "INFORMAL",
  "phrase": "Digital Number System",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/DigitalNumberSystem"
    }
  ],
  "indexable": true
}