{
  "alternatePhrases": [
    "factoradic"
  ],
  "definition": "A positional base in which each place value instead of being a power of\nthe base is a factorial. For example, the integer which is represented\nin base 10 as 47 (because $4 \\cdot 10^1 + 7 \\cdot 10^0$) is represented\nin factorial base as 1321, or\n$1 \\cdot 4! + 3 \\cdot 3! + 2 \\cdot 2! + 1 \\cdot 1!$.\n\nFactorial base representation has applications in combinatorics and\ncryptography.\n\nThe factorial base representations are unambiguous as long as the\nmaximum allowed digit for a given place value is not exceeded (e.g., the\nleast significant digit $d_1$ can only be 0 or 1, while the most\nsignificant digit in an 7-digit factorial base number $d_7$ has to be in\nthe range 0 to 7).\n\nWith this limitation placed in the definition, and the observation that\n$$n! - 1 = \\sum_{i = 1}^{n - 1} i!i$$ it is obvious that factorial base\nis unambiguous, though it has the potential to use an infinite amount of\ndistinct digits even as the less significant place values are limited in\nwhat values they can contain.\n\nThough this is true of fractions, though in the opposite direction (the\nmost significant fractional place values are more limited in the range\nof digits they can contain), factorial base has the advantage that the\nrepresentation of a rational number always terminates. This is not\nalways the case in a fixed base where the representation of a rational\nnumber could be repeating when the denominator is coprime to the base\n(see: factorial base representation of fractions).\n\nThe Lucas-Lehmer code maps unique factorial base representations of an\ninteger $n$ to the permutation of $n$ elements in lexicographical order.\n\nA007623 of Sloane’s OEIS lists the first few integers written in\nfactorial base, A046807 lists palindromic numbers in factorial base,\nA118363 lists factorial base Harshad numbers, etc.",
  "language": "INFORMAL",
  "phrase": "Factorial Base",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/FactorialBase"
    }
  ],
  "indexable": true
}