{
  "alternatePhrases": [
    "null",
    "nought"
  ],
  "definition": "*Zero* (or *null* or *nought*) is the integer between $-1$ and 1,\nusually represented as 0 (the glyph had a diagonal slash in early\ncomputer fonts). In the complex plane, zero is at the intersection of\nthe line of numbers with no imaginary part and the line of numbers with\nno real part, and as such can be represented as $0 + 0i$.\n\nZero is an identity element for addition, meaning that adding 0 to\nanother number just gives that other number: $x + 0 = x$. But under\nmultiplication, 0 is a fixed element: $0x = 0$. Also, $\\frac{0}{x} = 0$,\nbut division by zero is not allowed for most applications. Whether $x$\nis positive or negative, $x^0 = 1$. But $0^0$ is a whole other can of\nworms.\n\nAs a digit in a positional base, 0 indicates the absence of a particular\npower of the base in the partition representing a given number. For\nexample, in the base 10 self-descriptive number 6210001000, the 0s\nindicate the absence of ones, tens, hundreds, ten thousands, hundred\nthousands, and millions in this particular representation of this\nnumber. For computers and their binary representation of numbers, a bit\nset to 0 is a bit that is off, having no electrical current at the\nmoment.\n\nThough not as late as for the negative numbers, the concept of zero met\nwith some resistance at first. But by the 20th Century, 0 had become\nindispensable for all branches of mathematics. In elementary algebra\ntextbooks, 0 is often the goal of solving a problem, e.g., the quadratic\nequation $4x^2 + 3x + 1 = 0$, in which the student is asked to find the\nvalue of $x$ that makes the left-side of the equation equal to zero.\nEven Euler’s identity is sometimes stated in this way:\n$e^{i \\pi} + 1 = 0$.\n\nGiven a function $f$, the values $x$ such that $f(x) = 0$ are called the\n“zeroes” of that function and are often of special interest to\nmathematicians and amateurs alike; see: . (For example, the zeroes of\nthe Riemann zeta function).\n\nFor more on zero through the ages, see: history of zero.",
  "language": "INFORMAL",
  "phrase": "Zero",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Zero"
    }
  ],
  "indexable": true
}