{
  "alternatePhrases": [],
  "definition": "Note that this definition has come under new management and is still in\nthe process of being edited and rewritten.\n\n#### Intuitive geometric definition\n\nThe notions of connection, parallel transport, and covariant derivative\nare closely related so, to prevent confusion, we will begin by\nexplaining these notions intuitively before presenting formal\ndefinitions. Moreover, it helps to have a good grasp of the geometric\nnotions involved before studying the more formal definitions.\n\nIn elementary vector analysis, one takes it for granted that vectors can\nbe moved about freely. As long as one takes care not to change the\nmagnitude or the direction of a vector, one can move the basepoint of\nthe vector to any arbitrary location.\n\nWhen one graduates to the study of vectors on curved spaces, however, it\nbecomes apparent that one can no longer take this freedom of moving\nvectors about for granted. As defined, vectors are confined to their\nbasepoint and the basic operations with vectors are only defined for\nvectors based at the same point.\n\nTo move a vector from one point to another, one needs to specify how\nthis is to be done. A connection is a prescription for moving vectors\nbased at one point of a space to another point. Intuitively speaking, a\nconnection consists of a set of linear transformations which transform\nvectors based at a particular point into vectors based at\ninfinitesimally nearby points. Unlike in elementary vector analysis\nwhere there is only one right way of moving a vector from one point to\nanother, in differential geometry there are many ways of moving vectors\naround, so one needs to specify which connection one is using before one\ncan move vectors from point to point.\n\nThis act of moving a vector from point to point is called *parallel\ntransport* in analogy with the operation of elementary vector analysis\nwhich it generalizes. Not only can one speak of transporting a vector to\na nearby point using a connection, but one can parallel transport a\nvector along a curve. To see how that works, imagine a curve as a\nsequence of points. Using the connection, we can transport a vector\nbased at one point of a curve to the next point on the curve. Then we\ncan use the connection to transport it to the point after that, and so\non until we have transported it from one end of the curve to the other.\n\nAt this point, a striking difference between differential geometry and\nelementary vector analysis shows up. Typically, if we connect two points\n$P$ and $Q$ by two or more curves and parallel transport a vector based\nat $P$ to $Q$, we find that the result depends upon which curve we\ntransported the vector along. In fact, in differential geometry, the\ndefinition of a curved space is a space in which there exist two\ndistinct curves with the same endpoints such that parallel transport\nalong one curve is not the same as parallel transport along the other\ncurve.\n\nFinally, there is the notion of covariant derivative. Suppose that one\nis given not just a single vector based at a certain point, but a whole\nvector field, i.e. a vector for each point of the manifold. Then one can\ntry to compute the derivative of this vector field. To compute a\nderivative of a function, one subtracts the value of the function at a\npoint from the value at a nearby point. But this is not possible for the\nvector field because we are only allowed to subtract vectors stationed\nat the same base point. However, we can use our connection to parallel\ntransport the vector at a point to the nearby point, then subtract. This\ngeneralization of differentiation involving parallel transport is known\nas covariant differentiation.\n\nObviously, the above definitions leave much to be desired in the way of\nprecision. They are not specific what a space is, how vectors are to be\nassociated to the points of this space, and are based on vague notions\nof infinitesimally nearby points.\n\nFor the purpose of this article, we shall take our space to be a\nfinite-dimensional manifold. To be sure, some of the definitions to be\ngiven apply to more general contexts, such as infinite-dimensional\nmanifolds so one may speak of connections on these spaces as well.\nHowever, we shall not pursue this topic here since this exposition is\nintended to be accessible to newcomers to differential geometry who may\nnot have the necessary background in Hilbert space theory, point set\ntopology, and other subjects.\n\nThe definition of vector bundle makes precise the idea of “attaching\nvectors to points”. The reader who is not comfortable with general\nvector bundles may take this bundle to be the tangent bundle.\n\nThere are about as many ways of framing a rigorous definition of\nconnection as there are ways of formalizing differential geometry.\nHence, under the headings below, we shall list various equivalent\ndefinitions.\n\nBefore proceeding to these definitions, a few words of warning may be in\norder. Since the notions of connection, parallel transport, and\ncovariant derivative are so closely related, it is easy to translate\npropositions involving one of these terms into propositions involving a\ndifferent one of three terms. In particular, propositions about\nconnections are easily rewritten as propositions about covariant\nderivatives. In some formalisms, it is easier to define covariant\nderivative than to define connection. This leads to an abuse of\nterminology — some authors say things like “the connection $\\nabla$”\ninstead of the more precise statement “the covariant differentiation\noperator $\\nabla$”. This can be disconcerting to the uninitiated, but\nonce the principle involved has been grasped, this practise is harmless.\n\n#### Preliminaries.\n\nLet $M$ be a smooth, $d$-dimensional differential manifold. Let\n${\\mathcal{F}}(M)$ denote the ring of smooth, real-valued functions on\n$M$, and let ${\\mathcal{X}}(M)$ denote the real vector space of smooth\nvector fields. Let $B$ be a vector bundle over $M$ whose structure group\nis the finite-dimensional Lie group $G$ and whose fibers are isomorphic\nto the $n$-dimensional vector space $V$.Let ${\\mathcal{X}}(B)$ denote\nthe set of sections of $B$. Let $G^M$ denote the set of smooth maps from\n$M$ to $G$; it forms a group under pointwise multiplication. (If $f$ and\n$g$ are two functions from $M$ to $G$, then their product is $h$ which\nis defined as $h(x) = f(x) g(x)$.) Likewise, let $A^M$ denote the set of\nsmooth maps from $M$ to $A$.\n\nFor simplicity, we shall assume that $G = GL(V)$ for the time being.\nAfter stating the definitions of connection in this case, we shall\ndescribe how they can be modified to cover the case where\n$G \\subset GL(V)$.\n\nRecall that ${\\mathcal{F}}(M)$ both acts and is acted upon by\n${\\mathcal{X}}(M)$. Given a function $f\\in{\\mathcal{F}}(M)$ and a vector\nfield $X\\in{\\mathcal{X}}(M)$ we write $fX\\in{\\mathcal{X}}(M)$ for the\nvector field obtained by point-wise multiplying values of $X$ by values\nof $f$, and write $X(f)\\in {\\mathcal{F}}(M)$ for the function obtained\nby taking the directional derivative of $f$ with respect to $X$.\n\n#### Coordinate definition.\n\nLet $x^1, \\ldots ,x^d$ be a set of coordinates on some neighborhood of\n$M$. These may be extended to coordinates on a subset of the bundle by\naugmenting them with coordinates $x^{d+1}, \\ldots ,x^{d+n}$ on the\nfiber. Since the fiber is a vector space, we will demand that the fiber\ncoordinates be linear coordiantes. (This means that the coordinates of\nthe sum of two vectors are the sum of the coordinates of the two vectors\nand the coordiantes of the scalar multiple of a vector are gotten by\nmultiplying the coordinates of the original vecor by the scalar.) Adopt\nthe convention that Latin indices run from $1$ to $d$ and that Greek\nindices run from $d+1$ to $n$.\n\nIn these coordinates, a connection will be represented by a three-index\nfield $$C^\\mu_{\\nu i} (x^1, \\ldots ,x^d)$$ on the manifold and the\ncovariant derivative $\\nabla_i S^\\mu$ of a section\n$S^\\mu \\in {\\mathcal{X}}(B)$ will be an element of $T(M) \\otimes B$\ngiven by the formula\n$$\\nabla_i S^\\mu = \\partial_i S + C^\\mu_{\\nu i} S^\\nu$$ (Here\n$\\partial_i$ is short for $\\partial / \\partial x^i$ and the summation\nconvention is in force. It might also be worth mentioning that sometimes\nthe covariant derivative is defined with a minus sign instead of a plus\nsign (on rare occasions mostly occurring in high-energy physics theory,\none even sees it defined with an imaginary unit $i$) so one needs to\ncheck which sign convention is in use.)\n\nBefore proceeding further, it might be helpful to present a warning. The\nnotation $\\nabla_i T^\\mu$ can lead to some confusion, and this danger\nwarrants an extra comment. The symbol $\\nabla_i$ acting on a function,\nis customarily taken to mean the same thing as the corresponding partial\nderivative:\n$$\\nabla_i f = {\\partial_{x_{i}}}(f) = \\frac{\\partial f}{\\partial x^i}.$$\nThus, it easy to make the mistake that $\\nabla_i T^\\mu$ is the result of\napplying an operator $\\nabla_i$ to each component of $T^\\mu$. As can be\nseen from the definition, this is not the case. Rather, one should think\nof $\\nabla_i T^\\mu$ as if is were $(\\nabla T)_i^\\mu$, which is to say it\ndenotes the components of a new tensor which was derived from $T^\\mu$ by\nthe operation of covariant differentiation.\n\nThe relation of these formulas to the naive picture is as follows: A\nconnection is supposed to be a collection of linear maps from one\ntangent space to neighboring tangent space. Given a point $p \\in M$, any\nvector $w^\\mu$ in the fiber of $B$ above $p^i$ is transformed into the\nvector $w^\\mu + C^\\mu_{\\nu i} (p) w^\\nu dx^i$ in the fiber above the\nnearby point $p^i + dx^i$. (In this paragraph, I am using “$dx^\\mu$” in\nits naive sense of “infinitesimal displacement” rather than as a\ndifferential form.) Likewise, subtracting the value of\n$S^\\mu (p^i + dx^i)$ from the parallel-transported value of $S^\\mu (p)$\nand dividing by $dx$, one obtains the formula for covariant derivative.\n\nIn order for a geometrical quantity to be defined properly by a\ncoordinate expression, one must specify how the quantity transforms\nunder change of coordinates. Under a change of coordinates\n$$y^i = f^i (x^1, \\ldots, x^d)$$\n$$y^\\mu = \\Lambda^\\mu_\\nu (x^1, \\ldots, x^d) y^\\nu$$ the components of\nthe connection transform as follows:\n$$C^\\mu_{\\nu i} (y) = {\\partial f^j \\over \\partial f_i} \\Lambda^\\mu_\\sigma (\\Lambda^{-1})_\\nu^\\tau C^\\sigma_{\\tau j} + (\\Lambda^{-1})^\\mu_\\kappa {\\partial \\Lambda^\\kappa_\\nu \\over \\partial x^j}$$\nNote that these rules imply that the components of a connection do not\ntransform like the components of a tensor — the term involving the\nderivatives of $\\Lambda$ is not present in the transformation law of a\ntensor. However, if we have two connections on the same bundle, the\ndifference of these connections will be a tensor because the extra terms\ncancel.\n\nThe reason for defining the transformation law in this way is so that\nthe covariant derivative $\\nabla_i S^\\mu$ of a section of\n$S^\\mu \\in {\\mathcal{X}}(B)$ will transform as an element of\n$T(m) \\otimes B$ should. Furthermore, as one may check by transforming\nthe various quantites that appear in the equation defining the covariant\nderivative, this is the only possible transformation law which will make\n$\\nabla_i S^\\mu$ transform prperly. This property is the origin of the\nterm “covariant derivative” — the covariant derivative maps tensor\nfields into quantities which transform in the same manner.\n\n#### Alternative Notations\n\nThere are many different systems of notations in differential geometry.\n(Indeed one humorous definition of differential geometry is “The study\nof invariants under change of notation”!) This section will discuss\nseveral notations for connections and covariant derivatives.\n\nIt is traditional to represent the components of the covariant\nderivative like this $$Y^\\mu_{\\; ;j} = \\nabla_j Y^\\mu$$ using the\nsemi-colon to indicate that the extra index comes from covariant\ndifferentiation. Sometimes, as in the theory of embedded surfaces, there\nare two connections present so a semicolon is used to indicate covariant\nderivatives with repsect to one connection and a vertical bar or a colon\nis used to indicate covariant derivatives with respect to the other\nconnection. It might also be worth noting that commas are likewise used\nto indicate partial derivatives with respect to a given coordinate\nsystem. Using this notation, one might write the formula for covariant\nderivative as $$T^\\mu_{;i} = T^\\mu_{,i} + C^\\mu_{\\nu i} T^\\nu$$\n\nAlso, there are different ways of packaging the information contained in\nthe connection components. One may collect the connection components\ninto $d$ matrices $A_i$:\n$$A_i = \\begin{pmatrix} C^{d+1}_{d+1 \\, i} & \\cdots & C^{d+1}_{d+n \\, i} \\cr \\vdots & \\ddots & \\vdots \\cr C^{d+n}_{d+1 \\, i} & \\cdots & C^{d+n}_{d+n \\, i}\\end{pmatrix}$$\nAnother common notational device is to collect the connection\ncoefficients into the so-called “connection one-forms”\n$$A^\\mu_\\nu = C^\\mu_{\\nu i} dx^i$$ When using this notation, the\ncovariant derivative is written as a generalization $D$ of the exterior\nderivative $d$: $$D T^\\mu = d T^\\mu + A^\\mu_\\nu T^\\nu$$ By combining the\ntwo devices and collecting the connection one-forms into a matrix $A$,\none may do away with indices altogether. If one also collects the\ncomponents $T^\\mu$ into a column vector $T$, one may write\n$$DT = dT + AT$$ A quantity like $A$ is often referred to as a\nmatrix-valued one-form.\n\nOccasionally, one finds connection coefficients with only two indices\ninstead of three. The reason is that the two indices referring to the\nbundle have been replaced by a single index referring to the Lie\nalgebra. To relate this notation to the one discussed so far, we need to\nremember that the action of the structure group $G$ on $V$ defines a\nrepresentation of the Lie algebra $A$ on $V$, i.e. a map\n$$\\rho \\colon A \\to Hom (V,V)$$ If we choose linear coordinates\n$y_1, \\ldots ,y^m$ on the vector space $A$, this map may be expressed in\ncomponents as $$(y^1, \\ldots ,y^m) \\mapsto t^\\mu_{\\nu I} y^I$$ (Extend\nour conventions by agreeing that capital Latin indices run from $1$ to\n$m$, where $m$ is the dimension of the Lie algebra. In the case we are\nconsidering, where $G = GL(V)$, we will have $m = n^2$.) To the\ntwo-index object $A^I_i$, we will associate the three-index object\n$$C^\\mu_{\\nu i} = A^I_i t^\\mu_{\\nu I}$$ Therefore, one may also specify\na connection in a coordinate system by giving an array indexed by an\nindex referring to the Lie algebra and an index referring to the\ncotangent space of the manifold. This notation is useful in situations\nwhen one wants to emphasize the structure group rather than the manifold\nor when one is dealing with more than one bundle whose fibers are\ndifferent representations of the same group.\n\n#### Definition in terms of one-forms\n\nIt is worth noting that one can define the connection directly in terms\nof the curvature one-forms. A noteworthy feature of such definition is\nthat it does not make explicit reference to coordinate systems on the\nmanifold, although it does make use of local neighborhoods. After the\ndiscussion of the last section, the relation of this definition to the\npreceding definition should be clear.\n\nAs in the last section, let $\\rho \\colon G \\to Hom(V,V)$ denote the\naction of $G$ on $V$.\n\nLet $(U,\\phi)$ be a local trivialization of the bundle $B$. Recall that\n$U$ is an open set of $M$ and that $\\phi$ is a diffeomorphism between\n$\\pi^{-1} (U) \\in B$ and $U \\times V$. To every local trivialization,\nassociate an element $A$ of $v$. In order for these elements to define a\nconnection, they must transform properly under changes of local\ntrivialization. Two local trivializations over the same set $U$ are\nrelated by a transition function $g \\colon U \\to G$. The transformation\nlaw of an element $A \\in T^*(U) \\times Hom(V,V)$ is given by\n$$A' = \\rho (g)^{-1} A \\rho (g) +  \\rho (g)^{-1} d \\rho (g)$$\n\nFor this definition to be consistent, it must agree with the cocycle\ncondition. The reason for this is that, if it didn’t, one obtain\ndifferent answers by transforming from one local trivialization to\nanother in two different ways. That it is consistent is easily verified.\nUsing the notation of the entry on fibre bundles,\n$$\\rho (g_{ij} g_{jk})^{-1} A \\rho (g_{ij} g_{jk}) +  \\rho (g_{ij} g_{jk})^{-1} d \\rho (g_{ij} g_{jk}) =$$\n$$\\rho (g_{jk})^{-1} \\rho(g_{ij})^{-1} A \\rho (g_{ij}) \\rho(g_{jk}) +  \\rho (g_{jk})^{-1} \\rho(g_{ij})^{-1} d \\big( \\rho (g_{ij}) \\rho(g_{jk}) \\big) =$$\n$$\\rho (g_{jk})^{-1} \\big(\\rho(g_{ij})^{-1} A \\rho (g_{ij}) + \\rho(g_{ij})^{-1} d (\\rho (g_{ij}) \\big) \\rho(g_{jk}) + (g_{jk})^{-1} d \\rho(g_{jk})$$\n\n#### Axiomatic definition of covariant differentiation\n\nIn this definition, covariant differentiation is characterized\naxiomatically. As explained in the first section, it is not necessary to\naugment this with a separate definition of connection, since any\nstatement about connections can be rephrased as a statement about\ncovariant derivatives. An important feature of this definition which\nsets it apart from the previous two definitions is that it is global —\nthere is no need to chop up the manifold or the bundle into patches,\ndefine the connection on each patch, then sew the patches back together\nagain to make a complete manifold.\n\nA covariant derivative $\\nabla$ is a mapping $$\\begin{aligned}\n\\nabla:{\\mathcal{X}}(M)\\times{\\mathcal{X}}(B)&\\rightarrow {\\mathcal{X}}(B) \\\\\n(X,Y) &\\mapsto \\nabla_X Y,\\qquad X \\in{\\mathcal{X}}(M), Y \\in{\\mathcal{X}}(B)\\end{aligned}$$\nthat for all $X,Y\\in {\\mathcal{X}}(M)$, all $Z,W \\in {\\mathcal{X}}(B)$,\nall $f\\in{\\mathcal{F}}(M)$, and all $\\lambda \\in A^H$ satisfies\n\n1.  $\\nabla_{X+Y} Z = \\nabla_X Z + \\nabla_Y Z$\n\n2.  $\\nabla_X (Z+W) = \\nabla_X Z + \\nabla_X W$\n\n3.  $\\nabla_{fX} Z = f\\, \\nabla_X Z$\n\n4.  $\\nabla_X (fZ) = X(f) Z + f\\, \\nabla_X Z$\n\nNote that the lack of tensoriality in the second argument means that a\nconnection [*is not*]{} a tensor field.\n\nAlso not that we can regard the connection as a mapping from\n${\\mathcal{X}}(M)$ to the space of type (1,1) tensor fields, i.e. for\n$Y\\in{\\mathcal{X}}(M)$ the object $$\\begin{aligned}\n\\nabla Y: {\\mathcal{X}}(M)& \\rightarrow {\\mathcal{X}}(M)\\\\\nX &\\mapsto \\nabla_{\\!X} Y,\\quad X\\in {\\mathcal{X}}(M)  \\end{aligned}$$\nis a type (1,1) tensor field called the [*covariant derivative*]{} of\n$Y$. In this capacity $\\nabla$ is often called the [*covariant\nderivative*]{} operator.\n\nRecall that once a system of coordinates is chosen, a given vector field\n$Y\\in {\\mathcal{X}}(M)$ is represented by means of its components\n$Y^i\\in{\\mathcal{F}}(U)$ according to $$Y = Y^i {\\partial_{x_{i}}}.$$\nThe formula for the components follows directly from the defining\nproperties of a connection and the definition of the Christoffel\nsymbols. To wit: $$Y^i_{\\; ;j} = Y^i_{\\; ,j} +  \\Gamma_{jk}{}^i\\, Y^k$$\nwhere the symbol with the comma\n$$Y^i_{\\; ,j} = {\\partial_{x_{j}}}(Y^i) = \\frac{\\partial Y^i}{\\partial x^j}$$\ndenotes a derivate relative to the coordinate frame.\n\nA related and frequently encountered notation is $\\nabla_i$, which\nindicates a covariant derivatives in direction ${\\partial_{x_{i}}}$,\ni.e.\n$$\\nabla_i Y = \\nabla_{\\! {\\partial_{x_{i}}}} Y,\\quad Y\\in{\\mathcal{X}}(M).$$\nThis notation jibes with the point of view that the covariant derivative\nis a certain generalization of the ordinary directional derivative. The\npartials ${\\partial_{x_{i}}}$ are replaced by the covariant $\\nabla_i$,\nand the general directional derivative $V^i{\\partial_{x_{i}}}$ relative\nto a vector-field $V$, is replaced by the covariant derivative operator\n$V^i \\nabla_i.$\n\n#### Group compatibility\n\nSo far, we have been labouring under the assumption that $G = GL(V)$.\nThe time has now come to remove this restriction. To do so, we need to\ncome to grips with the issue of group compatibility. As usual, we shall\nbegin by discussing the problem in intuiutive terms, then formalize our\nintuition in various formalisms.\n\nThe structure group transforms vectors located at a point into each\nother whilst the connection transforms transforms vectors based at one\npoint into vectors based at another point. To understand the problem of\ncompatibility, let us focus attention on two nearby points $P$ and $Q$\nof the manifold and the fibres above these points.\n\nThere are two ways to transform a vector $v \\in V_P$. (Since it is\ncrucial to remember that the fibers over different points are distinct\nvector spaces if one is to order to understand this discussion, we have\nindexed the copies of $V$ which serve as fibers of the bundle over\nvarious points of the manifold with their basepoints. Likewise, we shall\nindex the symbol $\\rho$ with a point of the manifold to indicate the\naction of the group on vectors based at that point.) The simplest way is\nto pick an element $g \\in G$ and apply the transformation $\\rho_P (g)$\nto $v$. Alternatively, one could first parallel transport $v$ to\n$Tv \\in V_Q$, apply the transform $\\rho_Q (g)$ to the transported\nvector, then parallel transport the result back to $P$ to obtain\n$T^{-1} \\rho_Q (g) T v$.\n\nIf the transform $T^{-1} \\rho_Q (g) T$ does not equal $\\rho_P (g')$ for\nany $g' \\in G$, we are in trouble. By using the connection, we could\ngenerate a transformation of the fiber which is not described by the\nstructure group of the bundle. To avoid this difficulty, we need to\ndemand that the connection is compatible with the group. Group\ncompatibility is the condition that for every map $T : V_P \\to V_Q$\nwhich parallel transports a vector from a point $P$ to another point $Q$\nand for every $g \\in G$, there exists a $g' \\in G$ such that\n$\\rho_P (g) T = T \\rho_Q (g')$. In the language of representation\ntheory, we would say that $T$ intertwines the representations $\\rho_P$\nand $\\rho_Q$ of $G$.\n\nIt is worth noting that, if we transport the vector $v$ from $P$ to $Q$\nby first transporting it to an intermediate point $R$, it is enough to\ncheck that the transport from $P$ to $R$ and the transport from $R$ to\n$Q$ are group compatible since, if they are, it will automatically\nfollow that the transport from $P$ to $Q$ is group compatible. To verify\nthis assertion, let $T_1$ be the matrix which transports vectors from\n$V_P$ to $V_R$ and let $T_2$ be the matrix which transports vectors from\n$V_R$ to $V_Q$.\n\n$\\nabla_X (\\lambda Z) - \\lambda \\nabla_X Z = \\mu Z$ for some\n$\\mu \\in A^M$\n\n#### Related Definitions.\n\nThe torsion of a connection $\\nabla$ is a bilinear mapping\n$$T:{\\mathcal{X}}(M)\\times{\\mathcal{X}}(M)\\rightarrow {\\mathcal{X}}(M)$$\ndefined by $$T(X,Y) = \\nabla_X(Y) - \\nabla_Y(X) - [X,Y],$$ where the\nlast term denotes the Lie bracket of $X$ and $Y$.\n\nThe curvature of a connection is a tri-linear mapping\n$$R:{\\mathcal{X}}(M)\\times{\\mathcal{X}}(M)\\times{\\mathcal{X}}(M)\\rightarrow{\\mathcal{X}}(M)$$\ndefined by $$R(X,Y,Z) = \\nabla_X \\nabla_Y Z - \\nabla_Y \\nabla_X Z -\n\\nabla_{[X,Y]} Z,\n\\quad X,Y,Z\\in{\\mathcal{X}}(M).$$ We note the following facts:\n\n-   The torsion and curvature are tensorial (i.e.\n    ${\\mathcal{F}}(M)$-linear) with respect to their arguments, and\n    therefore define, respectively, a type (1,2) and a type (1,3) tensor\n    field on $M$. This follows from the defining properties of a\n    connection and the derivation property of the Lie bracket.\n\n-   Both the torsion and the curvature are, quite evidently,\n    anti-symmetric in their first two arguments.\n\nA connection is called [*torsionless*]{} if the corresponding torsion\ntensor vanishes. If the corresponding curvature tensor vanishes, then\nthe connection is called [*flat*]{}. A connection that is both\ntorsionless and flat is locally Euclidean, meaning that there exist\nlocal coordinates for which all of the Christoffel symbols vanish.\n\n#### Notes.\n\nThe notion of connection is intimately related to the notion of parallel\ntransport, and indeed one can regard the former as the infinitesimal\nversion of the latter. To put it another way, when we integrate a\nconnection we get parallel transport, and when we take the derivative of\nparallel transport we get a connection. Much more on this in the\nparallel transport entry.\n\nAs far as I know, we have Elie Cartan to thank for the word [\n*connection*]{}. With some trepidation at putting words into the\nmaster’s mouth, my guess is that Cartan would lodge a protest against\nthe definition of [*connection*]{} given above. To Cartan, a connection\nwas first and foremost a geometric notion that has to do with various\nways of [*connecting*]{} nearby tangent spaces of a manifold. Cartan\nmight have preferred to refer to $\\nabla$ as the covariant derivative\noperator, or at the very least to call $\\nabla$ an [*affine*]{}\nconnection, in deference to the fact that there exist other types of\nconnections (e.g. projective ones). This is no longer the mainstream\nview, and these days, when one wants to speak of such matters, one is\nobliged to use the term [*Cartan connection.*]{}\n\nIndeed, many authors call $\\nabla$ an affine connection although they\nnever explain the [*affine*]{} part. [^1] One can also define\nconnections and parallel transport in terms of principal fiber bundles.\nThis approach is due to Ehresmann. In this generalized setting an affine\nconnection is just the type of connection that arises when working with\na manifold’s frame bundle.\n\n#### Bibliography.\n\n\\[Exact references coming.\\]\n\nBishop ang Goldberg (1968)\n\n- Cartan’s book on projective connection.\n\n- Ehresmann’s seminal mid-century papers.\n\n- Kobayashi and Nomizu’s books\n\nSpivak (1965)\n\nSee also the bibliography for differential geometry.\n\n[^1]: The silence is puzzling, and I must confess to wondering about the\n    percentage of modern-day geometers who know exactly what is so\n    affine about an affine connection. Has blind tradition taken over?\n    Do we say “affine connection” because the previous person said\n    “affine connection”? The meaning of “affine” is quite clearly\n    explained by Cartan in his writings. There you go esteemed\n    “everybody”: one more reason to go and read Cartan.",
  "language": "INFORMAL",
  "phrase": "Connection",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Connection"
    }
  ],
  "indexable": true
}