{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "A spherical triangle is formed by connecting three points on the surface\nof a sphere with great arcs; these three points do not lie on a great\ncircle of the sphere. The measurement of an angle of a spherical\ntriangle is intuitively obvious, since on a small scale the surface of a\nsphere looks flat. More precisely, the angle at each vertex is measured\nas the angle between the tangents to the incident sides in the vertex\ntangent plane.\n\nTheorem. The area of a spherical triangle $ABC$ on a sphere of radius\n$R$ is $$\\label{sph-tri-area}\n  S_{ABC} = (\\angle A + \\angle B + \\angle C - \\pi) R^2.$$\n\nIncidentally, this formula shows that the sum of the angles of a\nspherical triangle must be greater than or equal to $\\pi$, with equality\nholding in case the triangle has zero area.\n\nSince the sphere is compact, there might be some ambiguity as to whether\nthe area of the triangle or its complement is being considered. For the\npurposes of the above formula, we only consider triangles with each\nangle smaller than $\\pi$.\n\nAn illustration of a spherical triangle formed by points $A$, $B$, and\n$C$ is shown below.\n\n![image](sph-tri.1)\n\nNote that by continuing the sides of the original triangle into full\ngreat circles, another spherical triangle is formed. The triangle\n$A'B'C'$ is antipodal to $ABC$ since it can be obtained by reflecting\nthe original one through the center of the sphere. By symmetry, both\ntriangles must have the same area.\n\nFor the proof of the above formula, the notion of a *spherical diangle*\nis helpful. As its name suggests, a diangle is formed by two great arcs\nthat intersect in two points, which must lie on a diameter. Two diangles\nwith vertices on the diameter $AA'$ are shown below.\n\n![image](sph-tri.2)\n\nAt each vertex, these diangles form an angle of $\\angle A$. Similarly,\nwe can form diangles with vertices on the diameters $BB'$ and $CC'$\nrespectively.\n\n![image](sph-tri.3) ![image](sph-tri.4)\n\nNote that these diangles cover the entire sphere while overlapping only\non the triangles $ABC$ and $A'B'C'$. Hence, the total area of the sphere\ncan be written as $$\\label{sph-cover}\n  S_{\\mathrm{sphere}} = 2S_{AA'} + 2S_{BB'} + 2S_{CC'} - 4S_{ABC}.$$\n\nClearly, a diangle occupies an area that is proportional to the angle it\nforms. Since the is $4\\pi R^2$, the area of a diangle of angle $\\alpha$\nmust be $2\\alpha R^2$.\n\nHence, we can rewrite equation as $$\\begin{gathered}\n  4\\pi R^2 = 2 R^2 (2\\angle A + 2\\angle B + 2\\angle C) - 4S_{ABC}, \\\\\n  \\therefore ~ S_{ABC} = (\\angle A + \\angle B + \\angle C - \\pi) R^2,\\end{gathered}$$\nwhich is the same as equation .",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AreaOfASphericalTriangle"
    }
  ],
  "indexable": true,
  "names": [
    "area of a spherical triangle"
  ]
}