{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "Every circle has exactly one center.\n\nBefore proving this, we state and prove a lemma.\n\nA center of a circle must lie in its interior.\n\nSuppose not. Let a circle have a center $O$ not lying in its interior.\nIf $O$ lies on the circle, then the circle is degenerate (just a point).\nSuppose that $O$ lies in its exterior. Choose a point $A$ on the circle\nsuch that a line that contains $A$ and $O$ passes through the interior\nof the circle (, the line is not to the circle). Such a line intersects\nthe circle at another point $B$. It cannot be the case that $O$ is in\nbetween $A$ and $B$, lest $O$ be in the interior of the circle. Without\nloss of generality, let $B$ be between $A$ and $O$.\n\n(-3,-3)(5,3) (0,3)[.]{} (0,-3)[.]{} (0,0)[3]{} (-3,0)(4,0)\n(-3,0)(3,0)(4,0) (-3.2,0)[$A$]{} (3.1,-0.3)[$B$]{} (4.2,0)[$O$]{}\n\nThen $BO<AO$, a contradiction, since $O$ is supposed to be the center of\nthe circle.\n\nNow to prove the theorem.\n\nBy definition, every circle has at least one center. Suppose that a\ncircle has more than one center. Let $O$ and $O'$ be two distinct\ncenters of this circle. By the previous lemma, $O$ and $O'$ must lie in\nthe interior of the circle. Draw a chord of the circle which contains\nboth $O$ and $O'$. Let $A$ and $B$ be the intersections of this chord\nwith the circle such that $O$ is $A$ and $O'$. Since $O$ and $O'$ are in\nthe interior of the circle, it must be the case that $O'$ is between $O$\nand $B$.\n\n(-4,-3)(4,3) (0,-3)[.]{} (0,3)[.]{} (0,0)[3]{} (-3,0)(3,0)\n(-3,0)(-0.7,0)(0.7,0)(3,0) (-3.2,0)[$A$]{} (-0.7,-0.3)[$O$]{}\n(0.7,-0.3)[$O'$]{} (3.2,0)[$B$]{}\n\nNote that we must have $A \\neq O$, $A \\neq O'$, $B \\neq O$, and\n$B \\neq O'$ as pictured. Otherwise, the circle is degenerate, yielding\nthat $O=O'$. Because of these four inequalities, we also have that\n$AO>0$, $AO'>0$, $BO>0$, and $BO'>0$.\n\nSince $O$ is a center of the circle, $AO=BO$. Since $O'$ is a center of\nthe circle, $AO'=BO'$. Thus, $AO<AO'=BO'<BO$, a contradiction. It\nfollows that a circle has exactly one center.\n\nGenerality\n==========\n\nLooking at the proof of the main theorem and the lemma, we see that they\nhold in any geometry in which any two points lie on a common line and in\nwhich the notion of betweenness is well-defined. Examples of such\ngeometries include Euclidean geometry, hyperbolic geometry, and neutral\ngeometry. In fact, the uniqueness of center of a circle holds in any\nordered geometry satisfying the congruence axioms (see for a proof). By\ncontrast, in spherical geometry, where the notion of betweenness is not\nwell-defined and a pair of antipodal points determines an infinity of\nlines, we also have that every circle has exactly two centers which are\nantipodal points. However, in projective geometry, it is again valid\nbecause we identify antipodal points to construct the projective plane\nfrom the sphere.\n\nMore generally, in Riemannian spaces (and generalizations such as\nFinsler spaces), this theorem will hold provided that geodesics\nemanating at a point do not focus at some other point, although they can\nfocus at the same point at which they started. This generalizes what we\nsaw in the case of the sphere and the the projective plane. In both\nthose cases, geodesics focussed but, in the former case, they focussed\nat the antipodal point but, in the latter case, they only focussed back\nat their starting point. While on spheres, circles have two centers, we\ncan have Riemannian spaces in which geodesics refocus any number of\ntimes, even infinitely often, in which cases a circle could have any\nnumber of centers, even infinitely many of them. Because, by geodesic\ndeviation, focussing requires positive curvature, we can assert that\ncircles in spaces of non-positive curvature will have unique centers;\nfor instance, this explains why the result holds in hyperbolic geometry\n(which has constant negative curvature).",
  "citations": [
    {
      "textCitation": "https://planetmath.org/CircleHasOneCenter"
    }
  ],
  "indexable": true,
  "names": [
    "circle has one center"
  ]
}