{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "Let $ABC$ and $XYZ$ be two triangles. They are said to be *perspective\nfrom a point* if $AX,BY$ and $CZ$ are either concurrent or parallel, and\nare said to be *perspective from a line* if either the points of\nintersections $AB \\cap XY, BC\\cap YZ$ and $CA \\cap ZX$ all exist and are\ncollinear, or do not exist at all (three pairs of parallel lines).\n\nGiven two triangles such that no vertex of one triangle is the vertex of\nanother:\n\n-   The *Desarguesian property* states: if they are perspective from a\n    point, they are perspective from a line.\n\n-   The *dual Desarguesian property* states: if they are perspective\n    from a line, they are perspective from a point.\n\nA related concept is that of a *Desarguesian configuration*, which\nconsists of two triangles which are both perspective from a point and\nperspective from a line. We say that the two triangles form a\nDesarguesian configuration. The point and the line are called the\n*vertex* and *axis* of the configuration. Note that the point may be a\npoint at infinity, and the line may be a line at infinity. Below is a\ndiagram of a Desarguesian configuration.\n\n![image](desargues)\n\n[(XEukleides for the drawing)]{}\n\nA geometry with points, lines and an incidence relation between them is\nsaid to be *Desarguesian* if, given any two triangles such that no\nvertex of one is the vertex of another, then both the Desarguesian\nproperty and its dual are true. Equivalently, a geometry is Desarguesian\nif whenever two triangles are in perspective from either a point or a\nline, then they form a Desarguesian configuration.\n\n**Desargues’ theorem**. The Euclidean space is Desarguesian.\n\n**Remarks**.\n\n-   In general, affine spaces and projective spaces are Desarguesian,\n    provided that the space in question is at least dimension 3. If the\n    dimension is 2, it can be shown that the space (affine or\n    projective) is Desarguesian iff it can be embedded in a 3\n    dimensional space (affine or projective).\n\n-   In order to show that a projective space is Desarguesian, one only\n    needs to show one of the two Desarguesian properties, since the\n    other one may be automatically deduced according to the principal of\n    duality. In addition, one may drop the case where two lines are\n    parallel, as they always intersect at a point. In proving Desargues’\n    theorem, one generally “complete” the affine space into a projective\n    one first, and use homogeneous coordinates to prove the theorem.\n\n-   A special type of Desarguesian configuration where its vertex lies\n    on its axis is called a *minor Desarguesian configuration*. The\n    *minor Desarguesian property* states that if two triangles are\n    perspective from a point, then they form a minor Desarguesian\n    configuration. Interchanging points and lines, we may form the dual\n    minor Desarguesian property.\n\n-   Another special type of Desarguesian configuration occurs when the\n    geometry is affine. A Desarguesian configuration is said to be\n    *affine* if its axis is a line at infinity. In other words, given\n    two triangles perspective from a point, they form a Desarguesian\n    configuration in which their corresponding sides are parallel. An\n    affine Desarguesian configuration is minor if its vertex is a point\n    at infinity. In other words, the two triangles are such that not\n    only are their corresponding sides parallel, the lines joining the\n    corresponding vertices are parallel as well. These statements may\n    also be dualized.",
  "citations": [
    {
      "textCitation": "https://planetmath.org/DesarguesTheorem"
    }
  ],
  "indexable": true,
  "names": [
    "Desargues' theorem"
  ]
}