{
  "alternatePhrases": [],
  "definition": "We consider only Euclidean geometry.\n\nA *triangular region* is a triangle together with its interior. The\nsides of the triangle are called the *edges* of the region and the\nvertices of the triangle are called the *vertices* of the region.\n\nA *polygonal region* is a plane figure that can be written as a union of\na finite number of triangular regions, subject to a constraint. The\nconstraint is that the triangular regions are nonoverlapping. That means\nthat if two triangular regions intersect, then their intersection is\neither a vertex or edge of each of the triangular regions.\n\nA given polygonal region can of course be written as such a union in\ninfinitely many ways.\n\nWe wish to assign a number to each polygonal region that corresponds to\nour intuitive idea of “area”. To do that we first write down a set of\npostulates that “area” should satisfy and then show that the postulates\ncan be satisfied. We let $\\mathscr{R}$ denote the set of polygonal\nregions.\n\n1.  There is a function $\\alpha: \\mathscr{R} \\to \\mathbb{R}$.\n\n2.  $\\alpha > 0$.\n\n3.  If two triangular regions are congruent, then they have the same\n    area.\n\n4.  If two polygonal regions $R_1$ and $R_2$ are nonoverlapping then\n    $\\alpha ( R_1 \\cup R_2) = \\alpha (R_1) + \\alpha (R_2)$.\n\n5.  If a square has edges of length 1, then its area is 1.\n\nThe fifth postulate is needed because if $\\alpha$ satisfies the first 4\npostulates, then so does $2\\alpha$. So, this postulate serves to make\n$\\alpha$ a unique function.\n\nIf a square has sides of length $s$ then its area is $s^2$.\n\n**Proof.** We first show that if a square has sides of length\n$\\frac{1}{q}$ then its area is $\\frac{1}{q^2}$. A unit square can be\ndecomposed into $q^2$ squares, each having side of length $\\frac{1}{q}$.\nEach of the smaller squares has the same area, $A$, by postulates 3 and\n4. Hence, $$1 = q^2 A,$$ so that $A = \\frac{1}{q^2}$. Next, if a square\nhas sides of length $\\frac{p}{q}$ then its area is $\\frac{p^2}{q^2}$.\nThis is because the square can be written as $p^2$ squares each having a\nside of length $\\frac{1}{q}$. If $A$ is the area then\n$$A = p^2 \\frac{1}{q^2} = \\frac{p^2}{q^2}.$$ Finally, let $T$ be a\nsquare of side $s$ and $T_{p/q}$ denote a square of side $\\frac{p}{q}$\nhaving one angle in common with $T$. In the following sequence of\nstatements, each statement is equivalent to the next one:\n\n1.  $\\frac{p}{q} < s.$\n\n2.  $T_{p/q} \\subset T.$\n\n3.  $\\alpha(T_{p/q}) < \\alpha(T).$\n\n4.  $\\frac{p^2}{q^2} < \\alpha(T).$\n\n5.  $\\frac{p}{q} < \\sqrt{\\alpha(T)}.$\n\nHence, statements 1 and 5 are equivalent so that\n$$s = \\sqrt{\\alpha(T)},$$ so that $s^2 = \\alpha(T)$. This proves the\ntheorem.\n\nOne can then proceed on the basis of the postulates to show the\nfollowing sequence of results.\n\nThe area of a rectangular region is the product of its base and its\naltitude.\n\nRather than speak of the area of a triangular region or the area of a\nrectangle region, we shall refer to the area of a triangle, or area of a\nrectangle, or other polygonal region, as is usually done.\n\nThe area of a right triangle is 1/2 product of the lengths of its legs.\n\nThe area of a triangle is 1/2 the product of any base and the\ncorresponding altitude.\n\nThe area of a parallelogram is the product of a base and the\ncorresponding altitude.\n\nThe area of a trapezoid is 1/2 the product of the altitude and the sum\nof the bases.\n\nIf two triangles are similar then the ratio of their areas is the square\nof the ratio of any two corresponding sides.\n\nWhat remains to do is to show that there is a function $\\alpha$ that\nsatisfies postulates 1 to 5. It might seem reasonable to just define the\narea of a rectangle, but rectangles are not useful for dissecting\npolygonal regions. The easier way to use triangles. So one *defines* the\narea of a triangle to be 1/2 the product of the base and its\ncorresponding altitude. For this to be well-defined one has to show\nfirst that the product of a base and altitude (for a given triangle)\ndoes not depend on which base is chosen. Next, one defines the *area of\na polygonal region* as the sum of the areas of the triangular regions in\nsome decomposition. Of course one has to show that this sum does not\ndepend on the particular decomposition that is used. Given this\ndefinition for $\\alpha$, it is then a simple matter to show that\npostulates 1 to 5 are satisfied.\n\nThe function $\\alpha$ can be defined on a larger domain, which includes\ncircular sectors and disks. But to do this rigorously ones needs the\nconcept of a limit. In the hyperbolic geometry case, one can show the\nfollowing theorem.\n\nIf $\\alpha$ is a function that satisfies postulates 1 to 4 then there is\na $k>0$ such that $$\\alpha(R) = k \\delta(R)$$ for every polygonal\nregion, where $\\delta(R)$ is the defect of $R$.\n\n[99]{} Edwin E. Moise, *Elementary Geometry from an Advanced Standpoint,\nThird edition*, Addison-Wesley, 1990",
  "language": "INFORMAL",
  "phrase": "Area Of A Polygonal Region",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AreaOfAPolygonalRegion"
    }
  ],
  "indexable": true
}