{
  "alternatePhrases": [
    "conic"
  ],
  "definition": "**Definitions**\n\nIn Euclidean 3-space, a conic section, or simply a conic, is the\nintersection of a plane with a right circular double cone.\n\nBut a conic can also defined, in several equivalent ways, without using\nan enveloping 3-space.\n\nIn the Euclidean plane, let $d$ be a line and $F$ a point not on $d$.\nLet $\\epsilon$ be a positive real number. For an arbitrary point $P$,\nwrite $|Pd|$ for the perpendicular (or shortest) distance from $P$ to\nthe line $d$. The set of all points $P$ such that $|PF|=\\epsilon|Pd|$ is\na conic with *eccentricity* $\\epsilon$, *focus* $F$, and *directrix*\n$d$.\n\nAn ellipse, parabola, or hyperbola has eccentricity $<1$, $=1$, or $>1$\nrespectively. For a parabola, the focus and directrix are unique. Any\nellipse other than a circle, or any hyperbola, may be defined by either\nof two focus-directrix pairs; the eccentricity is the same for both.\n\nThe definition in terms of a focus and a directrix leaves out the case\nof a circle; still, the circle can be thought of as a limiting case:\neccentricity zero, directrix at infinity, and two coincident foci.\n\nThe chord through the given focus, parallel to the directrix, is called\nthe *latus rectum*; its length is traditionally denoted by $2l$.\n\nGiven a conic $\\sigma$ which is the intersection of a circular cone $C$\nwith a plane $\\pi$, and given a focus $F$ of $\\sigma$, there is a unique\nsphere tangent to $\\pi$ at $F$ and tangent also to $C$ at all points of\na circle. That sphere is called the *Dandelin sphere* for $F$. (Consider\na spherical ball resting on a table. Suppose that a point source of\nlight, at some point above the table and outside the ball, shines on the\nball. The margin of the shadow of the ball is a conic, the ball is one\nof the Dandelin spheres of that conic, and the ball meets the table at\nthe focus corresponding to that sphere.)\n\n**Degenerate conics; coordinates in 2 or 3 dimensions**\n\nThe intersection of a plane with a cone may consist of a single point,\nor a line, or a pair of lines. Whether we should regard these sets as\nconics is a matter of convention, but in general they are not so\nregarded.\n\nIn the Euclidean plane with the usual Cartesian coordinates, a conic is\nthe set of solutions of an equation of the form $$P(x,y)=0$$ where $P$\nis a polynomial of the second degree over ${\\mathbbmss{R}}$. For a\ndegenerate conic, $P$ has discriminant zero.\n\nIn three dimensions, if a conic is defined as the intersection of the\ncone $$z^2=x^2+y^2$$ with a plane\n$$\\alpha x + \\beta y + \\gamma z = \\delta$$ then, assuming $\\gamma\\ne 0$,\nwe can eliminate $z$ to get a polynomial for the curve in terms of $x$\nand $y$ only; a linear change of variables will then give Cartesian\ncoordinates, within the plane, for the given conic. If $\\gamma=0$ we can\neliminate $x$ or $y$ instead, with the same result.\n\n**Conics and physics**\n\nKepler revolutionized astronomy by describing simple mathematical laws\nfor planetary motion, which Newton then derived from his laws of motion\nusing calculus, which he invented for the purpose (although several\nother people invented calculus at more or less the same time). One of\nKepler’s laws was that planets move on ellipses with the Sun at one\nfocus. More generally, objects under the influence of the Sun’s gravity\n(and no other forces) move in conic sections with the Sun at one focus.\nComets moving on parabolae or hyperbolae do not return; comets moving on\nelongated ellipses return.\n\nTo work with conic sections in such an astronomical context, it is very\nuseful to have a description in terms of polar coordinates centered at\none focus. Measuring the angle $\\theta$ from the closest approach to the\nfocus, an ellipse with semi-major axis $a$ can be described by\n$$r(\\theta) = \\frac{a(1-\\epsilon^2)}{1-\\epsilon\\cos\\theta}.$$ A parabola\nor hyperbola can also be described in an essentially similar way,\nalthough they do not have a semi-major axis. If we call the length of\nthe latus rectum $2l$, then any conic can be described as\n$$r(\\theta) = \\frac{l}{1-\\epsilon\\cos\\theta}.$$ Observe that as\n$\\epsilon$ goes to zero we approach a circle; as $\\epsilon$ goes to $1$\nwe approach a parabola; and for $\\epsilon>1$ we obtain a hyperbola.\n(Normally one does not consider the case $\\epsilon<0$, as this simply\namounts to choosing a different place to measure angle).\n\n**Conics in a projective plane**\n\nConic sections can be defined in a projective plane, even though, in\nsuch a plane, there is no notion of angle nor any notion of distance. In\nfact there are several equivalent ways to define it. The following\nelegant definition was discovered by von Staudt: A conic is the set of\nself-conjugate points of a hyperbolic polarity. In a little more detail,\nthe polarity is a pair of bijections $$f:P\\to L\\qquad g:L\\to P$$ where\n$P$ is the set of points of the plane, $L$ is the set of lines, $f$ maps\ncollinear points to concurrent lines, and $g$ maps concurrent lines to\ncollinear points. The set of fixed points of $g\\circ f$ is a conic, and\n$f(x)$ is the tangent to the given conic at the given point $x$.\n\nA projective conic has no focus, directrix, or eccentricity, for in a\nprojective plane there is no notion of distance (nor angle). Indeed all\nprojective conics are alike; there is no distinction between a parabola\nand a hyperbola, for example.\n\nIf we visualize the projective plane as the set of all lines in\nthree-space, then a conic is precisely a cone. An embedding of the plane\ninto the projective plane, in this context, is just the selection of a\nplane not passing through the origin. Then we identify a projective\n“point” (a line through the origin) with its intersection with this\nplane. Points whose line does not intersect this plane are considered\npoints at infinity. With this interpretation, it is clear why all conic\nsections are essentially the same in the projective plane: if we choose\na plane cutting the cone perpendicularly, we obtain a circle; if we tip\nthe plane, we get an ellipse; as we tip it further, at a certain point\nthere is exactly one point at infinity on the cone, giving a parabola;\nfinally we get two branches, connected by two points at infinity, that\nis, a hyperbola. The only difference is how we choose to embed the plane\nin the projective plane.",
  "language": "INFORMAL",
  "phrase": "Conic Section",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/ConicSection"
    }
  ],
  "indexable": true
}