{
  "alternatePhrases": [
    "isosceles trapezium"
  ],
  "definition": "An *isosceles trapezoid* is a trapezoid whose are congruent and that has\ntwo congruent angles such that their common is a base of the trapezoid.\nThus, in an isosceles trapezoid, *any* two angles whose common is a base\nof the trapezoid are congruent.\n\nIn Euclidean geometry, the convention is to state the definition of an\nisosceles trapezoid without the condition that the legs are congruent,\nas this fact can be proven in Euclidean geometry from the other\nrequirements. For other geometries, such as hyperbolic geometry and\nspherical geometry, the condition that the legs are congruent is for the\ndefinition of an isosceles trapezoid, as the other requirements do not\nimply that the legs are congruent.\n\nThe common perpendicular bisector to the bases of an isosceles trapezoid\nalways the quadrilateral into two congruent right trapezoids. In other ,\nevery isosceles trapezoid is symmetric about the common perpendicular to\nits bases.\n\nBelow is a picture of an isosceles trapezoid. The common perpendicular\nto its bases is drawn in cyan.\n\n(0,0)(4,2) (2,0)(2,2) (0,0)(1,2)(3,2)(4,0)\n\nIn some dialects of English ( British English), this figure is referred\nto as an *isosceles trapezium*. Because of the modifier “isosceles”, no\nconfusion should arise with this usage.\n\nAll rectangles are isosceles trapezoids (unless the definition of\ntrapezoid is used, see the entry on for more details). Note that, in\nEuclidean geometry, if a parallelogram is an isosceles trapezoid, then\nit must be a rectangle.\n\nIn Euclidean geometry, in a circle, the endpoints of two parallel chords\nare the vertices of an isosceles trapezoid. Conversely, one may use four\nsuitable points on a circle for obtaining parallel chords (and thus\nparallel lines).\n\n(-3,-3)(3,3) (0,0)[3]{}\n(-2.828427,-1)(-2,2.236068)(2,2.236068)(2.828427,-1)\n(-2.828427,-1)(-2,2.236068)(2,2.236068)(2.828427,-1)\n\nA is a trapezoid that is simultaneously a right trapezoid and an\nisosceles trapezoid. In Euclidean geometry, such trapezoids are\nautomatically rectangles. In hyperbolic geometry, such trapezoids are\nautomatically Saccheri quadrilaterals. Thus, the phrase “right isosceles\ntrapezoid” occurs rarely.\n\nA *3-sides-equal trapezoid* is an isosceles trapezoid having at least\nthree congruent sides. Below is a picture of a 3-sides-equal trapezoid.\n\n(0,0)(5.5,2) (0,0)(1.5,2)(4,2)(5.5,0)\n\nIn some dialects of English (e.g. British English), this figure is\nreferred to as a *3-sides-equal trapezium*. Because of the modifier\n“3-sides-equal”, no confusion should arise with this usage.\n\nA rare but convenient alternative name for a 3-sides-equal trapezoid is\na *trisosceles trapezoid*; the corresponding name *trisosceles\ntrapezium* does not seem to be in usage.",
  "language": "INFORMAL",
  "phrase": "Isosceles Trapezoid",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/IsoscelesTrapezoid"
    }
  ],
  "indexable": true
}