{
  "alternatePhrases": [],
  "definition": "A projective plane is called a *Moufang plane* if each of its lines is a\ntranslation line (it is a translation plane with respect to any line in\nthe plane). In other words, a Moufang plane is a projective plane such\nthat the minor Desarguesian property holds everywhere.\n\nIt can be shown that a projective plane is Moufang iff it can be\ncoordinatized by an alternative division ring, which is a\nnon-associative division ring satisfying the left and right alternative\nlaws: $$(aa)b=a(ab)\\qquad \\mbox{and} \\qquad a(bb)=(ab)b,$$ or,\nequivalently, a Veblen-Wedderburn system where the two alternative laws\nhold.\n\nFor example, any field plane (a projective plane coordinatized by a\nfield) is Moufang, and more generally any skew field plane (such as the\nquaternion plane $P(2,\\mathbb{H})$, as the quaternions form a division\nring). However, all of these examples are Desarguesian. An example of a\nnon-Desarguesian Moufang plane that is the octonion plane,\n$P(2,\\mathbb{O})$ (where the coordinates are octonions), for the\nmultiplication on the octonions are alternative and not associative. It\nis interesting to note that, while one can construct higher dimensional\nprojective spaces over any division ring, no such construction is\npossible if the division ring is non-associative, as any\ncoordinatization of a projective space of dimension greater than $2$ is\nalways a division ring. An example of a translation plane that is not\nMoufang is the Hall plane.\n\nAccording to the definition above, a Moufang plane is a translation\nplane in which every line is a translation line. So are there any planes\nintermediate between a translation plane and a Moufang plane, in the\nsense that a translation plane with exactly two, three, more more\ntranslation lines? It turns out that, if a translation plane has two\ndistinct translation lines, say $\\ell_1, \\ell_2$, then every line\npassing through $\\ell_1\\cap \\ell_2$ is also a translation line, and, as\na result, every line of the plane is a translation line, which means the\nplane itself is Moufang.\n\nAgain, by the definition, it is not hard to see that any ternary ring\ncoordinatizing a Moufang plane $\\pi$ is an alternative division ring. In\nfact, it can be shown that any two alternative division rings\ncoordinatizing $\\pi$ are isomorphic. This is the result of an\ninteresting algebraic fact by Bruck and Kleinfeld: any alternative\ndivision ring is either an associative division ring or a Cayley algebra\nover its center (which at the same time is a field).\n\nAnother algebraic result that has an interesting geometric consequence\nis the Artin-Zorn’s theorem, which asserts that a finite alternative\ndivision ring is a field. This implies that a finite Moufang plane is a\nfield plane!\n\n[7]{} M. Hall, Jr., [*The Theory of Groups*]{}, Macmillan (1959) R.\nArtzy, [*Linear Geometry*]{}, Addison-Wesley (1965) R. H. Bruck, E.\nKleinfeld, [*The Structure of Alternative Division Rings*]{}, Proc.\nAmer. Math. Soc. 78, pp.464-481 (1955)",
  "language": "INFORMAL",
  "phrase": "Moufang Plane",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/MoufangPlane"
    }
  ],
  "indexable": true
}