{
  "alternatePhrases": [],
  "definition": "Subspace geometries\n===================\n\nGiven a vector space $V$, $\\dim V>0$, the *projective geometry* of $V$\nis the set of all subspaces of $V$ ordered by set inclusion. It is\ntypically denoted $PG(V)$ or $P(V)$. The vector space may be over a\nfield or a division ring.\n\nThe partially ordered set (poset) of all subspaces of a vector space is\na geometric lattice. So next to a boolean lattice, it is one of the best\nlattices one could expect. However, an alternative to viewing projective\ngeometry $PG(V)$ as a lattice is one of viewing $PG(V)$ as a geometry.\nFor this we assign the to $PG(V)$.\n\nPoints\n\n:   Points in projective geometry are the 1-dimensional subspaces. These\n    are often denoted $PG(V)_0$ and are the atoms of the lattice.\n    $PG(V)_0$ is often referred to as the *projective space* of $V$ and\n    denoted $kP^n$ where $V=k^{n+1}$, especially in topological\n    settings. Common examples include $\\mathbb{R}P^n$, $\\mathbb{C}P^n$.\n    (.)\n\nLines\n\n:   As in the usual Euclidean geometry two distinct points should\n    determine a unique line in the geometry. As two linearly independent\n    vectors span a plane in $V$, in to make two points in the geometry\n    $PG(V)$ determine a line, we must define a line in projective space\n    to a 2-dimensional subspace.\n\n    There is a conflict of terminology at this stage. Often it is useful\n    to define a projective space as the set of all lines through the\n    origin in a vector space $V$. But if we elect to view a projective\n    space as a projective geometry then the lines in this definition\n    correspond to points in the geometry, and lines are now the planes\n    of the vector space containing the origin. Sometimes for clarity the\n    phrase “projective point” and “projective line” can be used to\n    resolve ambiguity.\n\nPlanes\n\n:   A *projective plane* for a vector space $V$ is a 3-dimensional\n    subspace. The study of projective planes extends beyond the\n    consideration of the poset of vector spaces however, and is the\n    beginning of many interesting combinatorial problems. See the\n    following section on non-Desarguesian planes for further details.\n\nHyperplanes\n\n:   Hyperplanes are subspaces of $V$, sometimes called codimension 1\n    subspaces. If $V$ is finite dimensional then points and hyperplanes\n    are in a 1-1 correspondence. This correspondence leads to many\n    situations where an exchange of a point with a hyperplane is\n    considered. The simplest of these exchanges occurs through the\n    notion of a perpendicular subspace, i.e.: one may say a point is\n    perpendicular to an entire hyperplane, and a hyperplane is\n    perpendicular to just one point.\n\n    When $\\dim V=2$ then every point is a hyperplane which leads to many\n    degenerate properties causing $\\dim V\\neq 2$ conditions in many\n    theorems of projective geometry.\n\nDual Geometries\n===============\n\nGiven a finite dimensional vector space $V$, the dual space $V^*$ of all\nlinear functionals is isomorphic as a vector space but it is also\npossible to $PG(V)$ to $PG(V^*)$ in a dual manner.\n\nFor every subspace $W$ of $V$ define $$W^\\bullet =\\{f\\in V^*:(W)f=0\\}.$$\nThat is, $W^\\bullet$ is the set of all functionals which contain $W$ in\ntheir kernel (nullspace). It follows $\\dim W^\\bullet=\\dim V-\\dim W$ and\nthe map from $PG(V)$ to $PG(V^*)$ determined by $$W\\mapsto W^\\bullet$$\nis order-reversing. It is also evident that under the natural\nisomorphism of $V\\cong V^{**}$ we can further take\n$W=W^{\\bullet\\bullet}$.\n\nMorphisms of Projective Geometry\n================================\n\nMorphisms from one projective geometry to another are defined as\norder-preserving maps, also called *projectivities*. In some context\norder-reversing maps may also be included which leads to the study of\ndualities and polarities.\n\nGiven an order-reversing map $PG(V)\\rightarrow PG(W)$, the map\n$PG(V)\\rightarrow PG(W^*)$ determines a canonical order-preserving map\nso that one can indeed consider simply the order-preserving maps between\nprojective geometries.\n\nA *collineation* is a function which maps any three collinear points\n(i.e.: three 1 dimensional subspaces which all lie in a single\n2-dimensional subspace) to three collinear points. These determine a\nunique order-preserving map between the two projective geometries. Thus\nthe morphisms of projective geometry are often identified with\ncollineations. This is preferable when authoring theorems in the of\ngeometry.\n\nSome authors prefer collineations to any projectivity\n$PG(V)\\rightarrow PG(V)$. Although there is no uniformity in these\ndefinitions, each takes collinear triples to collinear triples thus\npreserving the geometries under consideration.\n\nNotations for projective geometries\n===================================\n\nWhen the dimension $d$ of $V$ is finite we may write $PG(d-1,k)$ where\n$k$ is the field (or division ring) of the vector space. Notice that the\n$d-1$ indicates the dimension of the geometry, not the dimension of the\nvector space, though one can be attained from the other.\n\nWhen $k$ is real, or complex, $PG(1,k)$ is often denoted $\\mathbb{R}P^1$\nand $\\mathbb{C}P^1$ instead. Once again the $1$ denotes the dimensions\nof the geometry, and in this case also the manifold, not the vector\nspace from which it is derived.\n\nWhen $|k|=q$ we may further write $PG(d,q)$.\n\n$PG(1,k)$\n=========\n\nThe 1 dimensional vector spaces have points and hyperplanes, but every\npoint is a hyperplane. Every permutation of points is a collineation. So\nthe projective line is exceptional in many ways. Including in the\nfundamental theorem of projective geometry.\n\nAbstract Projective Geometry\n----------------------------\n\nProjective geometry in general can be axiomatized as achieved by\nHilbert. The axioms precisely characterize the subspace lattice of a\nfinite dimensional vector space, but the converse is not generally true.\nIndeed, already for 1-dimensional geometries, so called *projective\nlines*, i.e.: a set of points, it is clear that not all such geometries\ncan be captured as the subspaces of a vector space. For example, there\nis no vector space with exactly 2 one dimensional subspaces. Such\ngeometries however are of little interest as a geometry to themselves\n(though they are pivotal as sub-geometries) for they have no .\n\nWhen an abstract geometry is infinite dimensional or 2-dimensional, it\nis possible that it is not isomorphic to the geometry of subspaces of\nany vector space. These geometries are termed “non-Desarguesian” as they\ndo not carry with them a version of Desargues’ theorem. These geometries\nare a rich area of study, especially so called *projective planes* –\ngeometries of dimension 2. Despite not having the structure of a\nsubspace geometry, so far every non-Desarguesian projective plane has\nstill had order $p^k$ for some prime $p$. This has lead to the following\nunsolved problem:\n\n> Are their any projective planes of order not a power of a prime?\n\n[10]{}\n\nGruenberg, K. W. and Weir, A.J. *Linear Geometry 2nd Ed.* (English)\n\\[B\\] Graduate Texts in Mathematics. 49. New York - Heidelberg - Berlin:\nSpringer-Verlag. (1977), pp. x-198.\n\nKantor, W. M. *Lectures notes on Classical Groups*.\n\nTaylor, Donald E. *The geometry of the classical groups* Sigma Series in\nPure Mathematics. 9. Heldermann Verlag, Berlin, xii+229, (1992), ISBN\n3-88538-009-9.",
  "language": "INFORMAL",
  "phrase": "Projective Geometry",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/ProjectiveGeometry"
    }
  ],
  "indexable": true
}