{
  "alternatePhrases": [
    "regular n-gon",
    "regular"
  ],
  "definition": "A *regular polygon* is a polygon such that all of its sides are\ncongruent and all of its interior angles are congruent; that is, a\npolygon which is both equilateral and equiangular. Note that all regular\npolygons are convex.\n\nThere is a regular polygon with $n$ sides for every $n>2$. As $n$\nincreases, they resemble a circle ever more closely, and in fact were\nthe basis for some early attempts to approximate the value of $\\pi$. The\nexistence of many types of regular polygons is in contrast with the case\nfor regular polyhedra, of which only five distinct types in Euclidean\ngeometry.\n\nSome regular polygons have special names. For example, in many\ngeometries, a regular triangle is also known as an equilateral triangle\nand (less commonly) an equiangular triangle. Also, in Euclidean\ngeometry, a regular quadrilateral is also known as a square. For larger\nnumbers of sides, one uses a Greek number prefix, as in “regular\npentagon” and “regular hexagon”. For numbers of sides so large that this\nbecomes unwieldy, one uses a number, as in “regular $11$-gon” (as\nopposed to “hendecagon”), “regular $512$-gon” (as opposed to\n“pentacosiododecagon”) or “regular $n$-gon”. Below is a picture of some\nregular $n$-gons for $n$ from $3$ to $7$:\n\nIf $n$ is an integer with $n \\ge 3$, then the symmetry group of a\nregular $n$-gon is the $n^{\\text{th}}$ dihedral group (written $D_n$).\nUnfortunately, since it has $2n$ elements, it is also sometimes called\nthe dihedral group of $2n$ and written $D_{2n}$.\n\nIn spherical geometry, every biangle is regular. Its symmetry group is\nthe Klein 4-group.\n\nThe *center* of a regular polygon is the point that is equidistant from\neach of its vertices. (In spherical geometry, in to obtain uniqueness,\nwe use the convention that the center is inside the polygon. Similarly,\nfor biangles, we also use the convention that the center is equidistant\nfrom the midpoints of the sides.) An *apothem* of a regular polygon is a\nline segment such that all of the following occur:\n\n-   one of its endpoints is the center of the regular polygon;\n\n-   one of its endpoints is on one of the sides of the regular polygon;\n\n-   it is perpendicular to the side of the regular polygon that it\n    intersects.\n\nFor any regular polygon, all of its apothems are congruent, and the\npoint at which an apothem and a side of the regular polygon intersect is\nthe midpoint of that side.\n\nBelow is an example of a regular pentagon with all apothems drawn in\nblue.\n\n(-2,-2)(2,2) (0,0)(-0.951,1.309) (0,0)(-1.5385,-0.5) (0,0)(0,-1.618)\n(0,0)(1.5385,-0.5) (0,0)(0.951,1.309) (0,0)\n(0,2)(-1.902,0.618)(-1.175,-1.618)(1.175,-1.618)(1.902,0.618)\n\nFrom here on in the entry, only Euclidean geometry is considered.\n\nGiven a regular polygon with apothem of length $a$ and $P$, its area is\n$$A=\\frac{1}{2}aP.$$ A proof of this statement is supplied in the entry\narea of regular polygon.\n\nAny regular polygon can be inscribed into a circle and a circle can be\ninscribed within it. Note that both of these circles have the same as\nthe regular polygon. Below is a square with its inscribed circle drawn\nin green and its circumscribed circle drawn in cyan.\n\n(-3,-3)(3,3) (0,0)[2.13]{} (1.5,1.5)(-1.5,1.5)(-1.5,-1.5)(1.5,-1.5)\n(0,0)[1.5]{} (0,0)\n\nGiven a regular polygon with $n$ sides whose side has length $t$, the\nradius of the circumscribed circle is\n$$R=\\frac{t}{\\displaystyle 2\\sin\\left(\\frac{180^\\circ}{n}\\right)}$$ and\nthe radius of the inscribed circle is\n$$r=2t\\tan\\left(\\frac{180^\\circ}{n}\\right).$$\n\nThe area of the regular polygon can also be calculated using the formula\n$$A=\\frac{nt^2}{\\displaystyle 4\\tan\\left(\\frac{180^\\circ}{n}\\right)}.$$\n\nIn a more general setting, one might wish to allow figures which are not\nusually considered as polygons to be called “regular polygons”. In this\nsense, a regular $n$-gon is constructed from $n$ line segments of the\nsame length, each joined to the preceding one by the same angle on the\nsame side, and the last joined to the first in the same way. It is not\nobvious, but any such figure can be made by choosing $n$ points evenly\nspaced around a circle and joining them in some way. To get the ordinary\nconvex $n$-gon, join each point to the next point. To obtain a more\ncomplicated $n$-gon, fix an integer $m$ relatively prime to $n$ with\n$1<m<n-1$ and jump by $m$ points each time. For any valid $k$, this\nprocedure yields the same figure for $m=k$ and $m=n-k$. Thus, there are\n$\\displaystyle \\frac{\\varphi(n)}{2}$ of these generalized regular\npolygons (where $\\varphi$ denotes the Euler totient function) having $n$\nsides, including the ordinary convex $n$-gon. Since the line segments\nthat form more complicated $n$-gons cross each other, there is no\nobvious definition of “area” to apply.\n\nAn example of a more complicated $n$-gon is a pentagram, which is\nobtained from the above procedure by letting $n=5$ and either $m=2$ or\n$m=3$. In the picture below, a pentagram is drawn in blue.\n\n(-3,-3)(3,3) (0,0)[3]{}\n(0,3)(-1.763,-2.427)(2.853,0.927)(-2.853,0.927)(1.763,-2.427)\n(0,3)(-1.763,-2.427)(2.853,0.927)(-2.853,0.927)(1.763,-2.427)",
  "language": "INFORMAL",
  "phrase": "Regular Polygon",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/RegularPolygon"
    }
  ],
  "indexable": true
}