{
  "alternatePhrases": [],
  "definition": "Definitions {#definitions .unnumbered}\n===========\n\nLet $f\\colon [a,b] \\rightarrow \\mathbb{R}^k$ be a simple curve in\n$\\mathbb{R}^{k}$ and let $P = (s_{0}, ..., s_{n})$ with\n$a \\le s_0 < s_1 < \\cdots < s_n \\le b$ be a partition of the interval\n$[a, b]$; then the points in the set\n$$\\{ f(s_{0}), f(s_{1}), ..., f(s_{n}) \\}$$ are called the *vertices of\nthe inscribed polygonal path* $\\Pi(P)$ determined by $P$. The *length*\nof the inscribed polygonal path is defined to be\n$\\sum_{m=1}^n | f(s_{m}) - f(s_{m-1}) |$. The simple curve is said to be\n*rectifiable* if there exists a positive number $M$ such that the length\nof the inscribed polygonal path $\\Pi(P)$ is less than $M$ for all\npossible partitions $P$ of $[a, b]$. If the simple curve is rectifiable\nthen its *length* is defined as the least upper bound of the lengths of\ninscribed polygonal paths taken over all possible partitions.\n\nNotes {#notes .unnumbered}\n=====\n\nThe intuition underlying this definition is that, to measure the length\nof a curve, one could approximate the curve by an inscribed polygonal\npath. As one increases the number of vertices of the polygonal path, one\nexpects to obtain better approximations to the curve, and hence one\nwould expect the length of the curve to be the limit of the length of\nthese polygonal paths. Since the length of a polygonal path increases as\none adds vertices, this means we are dealing with the limit of an\nincreasing quantity, which will equal its supremum.\n\nIf one does not demand the curve to be simple (that is, that $f$ be\ninjective), then one may still proceed as above, taking the supremum of\nthe lengths of all possible inscribed polygonal paths. However, what one\nwill obtain is not necessarily the length of the curve, but the total\ndistance travelled along the curve. For instance, if a portion of the\ncurve is traced more than once, then the length of that portion of the\ncurve will be counted more than once.\n\nAlthough this definition mentions a parameterization of the (simple)\ncurve, what is being defined actually is independent of the choice of\nparameterization. In fact, all the information that is used is the\nordering of points along the curve, which is invariant under\nreparameterization. Also, because the length of a line segment does not\ndepend on how one might choose to orient the line segment, what is being\ndefined here is invariant under reversing the parameterization of the\ncurve. Hence, this is a geometrical property of the curve.",
  "language": "INFORMAL",
  "phrase": "Rectifiable Curve",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/RectifiableCurve"
    }
  ],
  "indexable": true
}