{
  "alternatePhrases": [],
  "definition": "Note that a *solid* is a three-dimensional figure.\n\nThe *volume* of a solid is the amount of space contained within the\nsolid. Volume is typically measured in (also called ); , if the volume\nof a solid is 5 $\\text{in}^3$, this means that, if five 1 inch by 1 inch\nby 1 inch cubes are cut appropriately, they can be arranged so that they\nexactly fill the solid without any overlapping. In formulas, volume is\nalmost always denoted using the letter $V$.\n\nAll examples provided within this entry are in Euclidean geometry.\n\nFor certain solids, volume is quite commonly found by multiplying the\nlengths of three (not necessarily distinct) line segments which are\nrelated to the solid. Some examples are:\n\n-   cylinders\n\n-   prisms\n\n-   cones\n\n-   pyramids\n\n-   spheres\n\nWith the exception of spheres, each of these solids has at least one\nface that serves as its base. Cylinders and prisms have two bases; for\nthese solids, the height is defined to be the line segment that is\nperpendicular to both bases and whose endpoints lie on the bases. If a\ncylinder or prism has a base of area $B$ and a height of length $h$,\nthen its volume is:\n\n$$V=Bh$$\n\nCones and pyramids have one base; for these solids, the height is\ndefined to be the line segment that is perpendicular to the base, has\none endpoint on the base, and has the apex of the figure as its other\nendpoint. If a cone or pyramid has a base of area $B$ and a height of\nlength $h$, then its volume is:\n\n$$V=\\frac{1}{3}Bh$$\n\nThe volume of a sphere is given by\n$\\displaystyle V=\\frac{4}{3} \\pi r^3$.\n\n**Remarks**\n\n-   Finding the volume of more complicated geometric figures requires\n    knowledge of calculus. In fact, the formulas given above can all be\n    derived using calculus.\n\n-   The concept of volume is a special case of a more general concept\n    called measure, or more appropriately, product measure.",
  "language": "INFORMAL",
  "phrase": "Volume",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Volume"
    }
  ],
  "indexable": true
}