{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "For a memory game with N pairs (2\\*N cards on the table) the “best case”\n(the best result for one session) is to have N lucky turns where every\nsecond card picked is the matching one.\n\n**Theorem:** For a perfect player, it takes $2N - 1$ turns to solve the\nworst case of a Memory Game.\n\n**Proof:**With out loss of generality lets assume that the player gets\nno lucky shots where two matching cards are flipped over by chance.\n\n**Definition:** a “hint” is the first time the player sees a card type.\nSeeing the matching card is not considered a “hint”.\n\nEvery turn the player gets either 0, 1 or 2 new hints: 0 hints - The\nplayer’s first pick was a card he’d already seen and knows how to match.\n1 hint - The player’s first pick is a card not yet seen and the second\npick was a card seen in a previous turn. 2 hints - Both cards picked did\nnot appear in a previous turn.\n\nFinding a card that the player had already seen isn’t considered a\n“hint” because it’s dead giveaway for a perfect player. Notice the\nmaximum number of “hints” is $N$.\n\nUsing this definition for “hints” a perfect player needs $N$ turns to\nfinish the game after collecting $N$ hints. This is because the player\ncan pick any card that he hasn’t flipped over yet and he’ll know where\nit’s matching card is 100 If the player flips over only unique cards (2\nhints per turn) until he reaches $N$ hints, the player will finish the\ngame in a total of $(3 / 2)N$ turns. $N / 2$ turns were used for\ngathering the hints and another $N$ turns for finishing the game.\n\nThe player always gets 2 hints the first turn (if he’s unlucky as is our\nassumption) then his next turn can possibly give him only 1 hint, too\nbad for the player. The next turns can also give the player only 1 hint\nuntil the hints are exhausted. See the following example.\n\nThe turns the perfect player in his worst case will be similar to: 1.\nFlipped over cards A and B - 2 hints for A and B 2. Flipped over cards C\nand A - 1 hint for C and a dead giveaway for A (there were 2 options for\na dead giveaway - A or B) 3. Flipped over cards D and C - 1 hint for D\nand a dead giveaway for C (there were 2 options for a dead giveaway - B\nor C) 4. Flipped over cards E and B - 1 hint for E and a dead giveaway\nfor B (there were 2 options for a dead giveaway - D or B) ... N - 1.\nFlipped over 2 cards - the last hint is given, a dead giveaway is given\nas well. Only 2 cards left unseen on the board, but the player already\nhas hints for both cards.\n\nThus, the game can continue until N hints are collected, one at a time,\nfor $N - 1$ turns, it’s (N - 1) because the worst case for the first\nturn is always 2 hints.\n\nThus the worst case for playing the Memory Game is $2*N - 1$. The amount\nof turns needed for gathering hints is (N - 1) and another N turns are\nused for finishing the game.\n\nQED\n\nClosing Note: A simple algorithm for solving the game always wins in\n$2N$ turns, simply flipping over everything and then matching. Seeing as\nhow the perfect player with the worst of luck is only 1 turn better than\na player with a constant algorithm, it might make one think that luck is\nmore important than brains.",
  "citations": [
    {
      "textCitation": "https://planetmath.org/TheBestScoreInTheWorstCaseOfAMemoryGameIs2N1"
    }
  ],
  "indexable": true,
  "names": [
    "The Best Score in the Worst Case of a Memory Game is 2N - 1"
  ]
}