{
  "alternatePhrases": [],
  "definition": "summability is a generalized convergence criterion for power series. It\nextends the usual definition of the sum of a series, and gives a way of\nsumming up certain divergent series. Let us start with a series\n$\\sum_{n=0}^\\infty a_n$, convergent or not, and use that series to\ndefine a power series $$f(r) = \\sum_{n=0}^\\infty a_n r^n.$$ Note that\nfor $|r|<1$ the summability of $f(r)$ is easier to achieve than the\nsummability of the original series. Starting with this observation we\nsay that the series $\\sum a_n$ is *Abel summable* if the defining series\nfor $f(r)$ is convergent for all $|r|<1$, and if $f(r)$ converges to\nsome limit $L$ as $r\\rightarrow 1^-$. If this is so, we shall say that\n$\\sum a_n$ Abel converges to $L$.\n\nOf course it is important to ask whether an ordinary convergent series\nis also Abel summable, and whether it converges to the same limit? This\nis true, and the result is known as Abel’s limit theorem, or simply as\nAbel’s theorem.\n\nLet $\\sum_{n=0}^\\infty a_n$ be a series; let\n$$s_N=a_0+\\cdots+a_N,\\quad N\\in{\\mathbb{N}},$$ denote the corresponding\npartial sums; and let $f(r)$ be the corresponding power series defined\nas above. If $\\sum a_n$ is convergent, in the usual sense that the $s_N$\nconverge to some limit $L$ as $N\\rightarrow\\infty$, then the series is\nalso Abel summable and $f(r)\\rightarrow L$ as $r\\rightarrow 1^-$.\n\nThe standard example of a divergent series that is nonetheless Abel\nsummable is the alternating series $$\\sum_{n=0}^\\infty (-1)^n.$$ The\ncorresponding power series is\n$$\\frac{1}{1+r}=\\sum_{n=0}^\\infty (-1)^n r^n.$$ Since\n$$\\frac{1}{1+r}\\rightarrow \\frac{1}{2}\\quad \\text{as}\\quad\nr\\rightarrow 1^-,$$ this otherwise divergent series Abel converges to\n$\\frac{1}{2}$.\n\nAbel’s theorem is the prototype for a number of other theorems about\nconvergence, which are collectively known in analysis as Abelian\ntheorems. An important class of associated results are the so-called\nTauberian theorems. These describe various convergence criteria, and\nsometimes provide partial converses for the various Abelian theorems.\n\nThe general converse to Abel’s theorem is false, as the example above\nillustrates[^1]. However, in the 1890’s proved the following partial\nconverse.\n\nSuppose that $\\sum a_n$ is an Abel summable series and that $n a_n\n\\rightarrow 0$ as $n\\rightarrow \\infty$. Then, $\\sum_n a_n$ is\nconvergent in the ordinary sense as well.\n\nThe proof of the above theorem is not hard, but the same cannot be said\nof the more general Tauberian theorems. The more famous of these are due\nto Hardy, Hardy-Littlewood, Weiner, and Ikehara. In all cases, the\nconclusion is that a certain series or a certain integral is convergent.\nHowever, the proofs are lengthy and require sophisticated techniques.\nIkehara’s theorem is especially noteworthy because it is used to prove\nthe prime number theorem.\n\n[^1]: We want the converse to be false; the whole idea is to describe a\n    method of summing certain divergent series!",
  "language": "INFORMAL",
  "phrase": "Abel Summability",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AbelSummability"
    }
  ],
  "indexable": true
}