{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "Dedekind domains can be defined as integrally closed domains in which\nevery nonzero prime ideal is maximal. However, there are several\nalternative characterizations which can be used, and are listed in the\nfollowing theorem.\n\nLet $R$ be an integral domain. Then, the following are equivalent.\n\n1.  $R$ is Noetherian, integrally closed, and every prime ideal is\n    maximal.\\[dedekind\\]\n\n2.  Every nonzero proper ideal is a product of maximal\n    ideals.\\[maximals\\]\n\n3.  Every nonzero proper ideal is product of prime ideals.\\[primes\\]\n\n4.  Every nonzero ideal is .\\[invertible\\]\n\n5.  Every ideal is as an $R$-module.\\[projective\\]\n\n6.  $R$ is Noetherian and every finitely generated torsion-free\n    $R$-module is projective.\\[projective mod\\]\n\n7.  $R$ is Noetherian and the localization $R_\\mathfrak{m}$ is a\n    principal ideal domain for each maximal ideal\n    $\\mathfrak{m}$.\\[local\\]\n\nFurthermore, if these properties are satisfied then the decomposition\ninto primes in (\\[maximals\\]) and (\\[primes\\]) is unique up to\nreordering of the factors.\n\nFor example, if $R$ is a principal ideal domain then ideals are clearly\ninvertible and, by condition \\[invertible\\] it is Dedekind, so is\nintegrally closed. In this case, factorization of ideals coincides with\nprime factorization in the ring. For the equivalence of \\[invertible\\]\nand \\[dedekind\\] see proof that a domain is Dedekind if its ideals are\ninvertible.\n\nOnce it is known that a ring is Dedekind then conditions \\[maximals\\]\nand \\[primes\\] show that we get unique factorization of ideals in terms\nof prime or, equivalently, maximal ideals and conversely, Dedekind\ndomains are are the only integral domains in which such decompositions\nexist (see proof that a domain is Dedekind if its ideals are products of\nmaximals and proof that a domain is Dedekind if its ideals are products\nof primes).\n\nThe equivalence of \\[invertible\\] and \\[projective\\] is immediate once\nit is known that invertible ideals are projective. For rings which are\nnot integral domains, the property that ideals are projective still\nmakes sense. Such rings are called , and give one possible\ngeneralization of the concept of Dedekind domains.\n\nAs ideals in a Noetherian domain are finitely generated torsion-free\nsubmodules of $R$, condition \\[projective mod\\] clearly implies\n\\[projective\\]. Domains which are not necessarily Noetherian, but for\nwhich every finitely generated torsion-free module is projective are\nknown as Prüfer domains. The equivalence of \\[projective mod\\] and\n\\[projective\\] then follows from the alternative characterization of\nPrüfer domains as integral domains in which every finitely generated\nideal is projective.\n\nCondition \\[local\\] (see proof that a Noetherian domain is Dedekind if\nit is locally a PID) shows that for Noetherian rings, being a Dedekind\ndomain is a and therefore the notion generalizes to apply to and .\n\n[9]{} P.M. Cohn, *Algebra. Vol 2*, Second edition. John Wiley & Sons\nLtd, 1989.",
  "citations": [
    {
      "textCitation": "https://planetmath.org/EquivalentCharacterizationsOfDedekindDomains"
    }
  ],
  "indexable": true,
  "names": [
    "equivalent characterizations of Dedekind domains"
  ]
}