{
  "alternatePhrases": [],
  "definition": "In a nutshell, the logico-deductive method is a system of inference\nwhere conclusions (new knowledge) follow from premises (old knowledge)\nthrough the application of sound arguments (syllogisms, rules of\ninference). Tautologies excluded, nothing can be deduced if nothing is\nassumed. Axioms and postulates are the basic assumptions underlying a\ngiven body of deductive knowledge. They are accepted without\ndemonstration. All other assertions (theorems, if we are talking about\nmathematics) must be proven with the aid of the basic assumptions.\n\nThe logico-deductive method was developed by the ancient Greeks, and has\nbecome the core principle of modern mathematics. However, the\ninterpretation of mathematical knowledge has changed from ancient times\nto the modern, and consequently the terms *axiom* and *postulate* hold a\nslightly different meaning for the present day mathematician, then they\ndid for Aristotle and Euclid.\n\nThe ancient Greeks considered geometry as just one of several sciences,\nand held the theorems of geometry on par with scientific facts. As such,\nthey developed and used the logico-deductive method as a means of\navoiding error, and for structuring and communicating knowledge.\nAristotle’s is a definitive exposition of the classical view.\n\n“Axiom”, in classical terminology, referred to a self-evident assumption\ncommon to many branches of science. A good example would be the\nassertion that\n\n> *When an equal amount is taken from equals, an equal amount results.*\n\nAt the foundation of the various sciences lay certain basic hypotheses\nthat had to be accepted without proof. Such a hypothesis was termed a\n*postulate*. The postulates of each science were different. Their\nvalidity had to be established by means of real-world experience.\nIndeed, Aristotle warns that the content of a science cannot be\nsuccessfully communicated, if the learner is in doubt about the truth of\nthe postulates.\n\nThe classical approach is well illustrated by Euclid’s elements, where\nwe see a list of axioms (very basic, self-evident assertions) and\npostulates (common-sensical geometric facts drawn from our experience).\n\n-   Things which are equal to the same thing are also equal to one\n    another.\n\n-   If equals be added to equals, the wholes are equal.\n\n-   If equals be subtracted from equals, the remainders are equal.\n\n-   Things which coincide with one another are equal to one another.\n\n-   The whole is greater than the part.\n\n-   It is possible to draw a straight line from any point to any other\n    point.\n\n-   It is possible to produce a finite straight line continuously in a\n    straight line.\n\n-   It is possible to describe a circle with any centre and distance.\n\n-   It is true that all right angles are equal to one another.\n\n-   It is true that, if a straight line falling on two straight lines\n    make the interior angles on the same side less than two right\n    angles, the two straight lines, if produced indefinitely, meet on\n    that side on which are the angles less than the two right angles.\n\nThe classical view point is explored in more detail .\n\nA great lesson learned by mathematics in the last 150 years is that it\nis useful to strip the meaning away from the mathematical assertions\n(axioms, postulates, propositions, theorems) and definitions. This\nabstraction, one might even say formalization, makes mathematical\nknowledge more general, capable of multiple different meanings, and\ntherefore useful in multiple contexts.\n\nIn structuralist mathematics we go even further, and develop theories\nand axioms (like field theory, group theory, topology, vector spaces)\nwithout *any* particular application in mind. The distinction between an\n“axiom” and a “postulate” disappears. The postulates of Euclid are\nprofitably motivated by saying that they lead to a great wealth of\ngeometric facts. The truth of these complicated facts rests on the\nacceptance of the basic hypotheses. However by throwing out postulate 5,\nwe get theories that have meaning in wider contexts, hyperbolic geometry\nfor example. We must simply be prepared to use labels like “line” and\n“parallel” with greater flexibility. The development of hyperbolic\ngeometry taught mathematicians that postulates should be regarded as\npurely formal statements, and not as facts based on experience.\n\nWhen mathematicians employ the axioms of a field, the intentions are\neven more abstract. The propositions of field theory do not concern any\none particular application; the mathematician now works in complete\nabstraction. There are many examples of fields; field theory gives\ncorrect knowledge in all contexts.\n\nIt is not correct to say that the axioms of field theory are\n“propositions that are regarded as true without proof.” Rather, the\nField Axioms are a set of constraints. If any given system of addition\nand multiplication tolerates these constraints, then one is in a\nposition to instantly know a great deal of extra information about this\nsystem. There is a lot of bang for the formalist buck.\n\nModern mathematics formalizes its foundations to such an extent that\nmathematical theories can be regarded as mathematical objects, and logic\nitself can be regarded as a branch of mathematics. Frege, Russell,\nPoincaré, Hilbert, and Gödel are some of the key figures in this\ndevelopment.\n\nIn the modern understanding, a set of axioms is any collection of\nformally stated assertions from which other formally stated assertions\nfollow by the application of certain well-defined rules. In this view,\nlogic becomes just another formal system. A set of axioms should be\nconsistent; it should be impossible to derive a contradiction from the\naxiom. A set of axioms should also be non-redundant; an assertion that\ncan be deduced from other axioms need not be regarded as an axiom.\n\nIt was the early hope of modern logicians that various branches of\nmathematics, perhaps all of mathematics, could be derived from a\nconsistent collection of basic axioms. An early success of the formalist\nprogram was Hilbert’s formalization of Euclidean geometry, and the\nrelated demonstration of the consistency of those axioms.\n\nIn a wider context, there was an attempt to base all of mathematics on\nCantor’s set theory. Here the emergence of Russell’s paradox, and\nsimilar antinomies of naive set theory raised the possibility that any\nsuch system could turn out to be inconsistent.\n\nThe formalist project suffered a decisive setback, when in 1931 Gödel\nshowed that it is possible, for any sufficiently large set of axioms\n(Peano’s axioms, for example) to construct a statement whose truth is\nindependent of that set of axioms. As a corollary, Gödel proved that the\nconsistency of a theory like Peano arithmetic is an unprovable assertion\nwithin the scope of that theory.\n\nIt is reasonable to believe in the consistency of Peano arithmetic\nbecause it is satisfied by the system of natural numbers, an infinite\nbut intuitively accessible formal system. However, at this date we have\nno way of demonstrating the consistency of modern set theory\n(Zermelo-Frankel axioms). The axiom of choice, a key hypothesis of this\ntheory, remains a very controversial assumption. Furthermore, using\ntechniques of forcing (Cohen) one can show that the continuum hypothesis\n(Cantor) is independent of the Zermelo-Frankel axioms. Thus, even this\nvery general set of axioms cannot be regarded as the definitive\nfoundation for mathematics.",
  "language": "INFORMAL",
  "phrase": "Axiom",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Axiom"
    }
  ],
  "indexable": true
}