{
  "alternatePhrases": [],
  "definition": "By a *class* in modern set theory we mean an arbitrary collection of\nelements of the universe. All sets are classes (as they are collections\nof elements of the universe — which are usually sets, but could also be\nurelements), but not all classes are sets — and indeed cannot be.\nClasses which are not sets are called *proper classes*. Given two\nclasses $A$ and $B$, we say that $A$ is a *subclass* of $B$ if every\nelement of $A$ is an element of $B$. Every subclass of a set is a set.\n\nThe need for the distinction between sets and classes arises from the\nparadoxes of the so-called naive set theory. In naive set theory one\nassumes that to each possible division of the universe into two disjoint\nand mutually comprehensive parts there corresponds an entity of the\nuniverse, a set. This is the content of *Frege’s fifth axiom*, which\nstates that to each second order predicate $P$ there corresponds a first\norder object $p$ called the extension of $P$, such that\n$\\forall x ( P(x) \\leftrightarrow x \\in p)$. (Every predicate $P$\ndivides the universe into two mutually comprehensive and disjoint parts;\nnamely the part which consists of objects for which $P$ holds and the\npart consisting of objects for which $P$ does not hold). It should be\nnoted that the view which ascribes the assumptions of the so called\n“naive set theory” to practitioners of set theory prior to its\naxiomatisation is incorrect; Frege is the only logician who has assumed\nthe unrestricted comprehension principle. Cantor and others had no such\nprinciple, and therefore it is not correct to say that Russell’s paradox\ndemonstrated their views inconsistent.\n\nSpeaking in modern terms we may view the situation as follows. Consider\na model of set theory $\\mathbf{M}$. The interpretation the model gives\nto $\\in$ defines implicitly a function\n$f\\colon P(\\mathbf{M}) \\to \\mathbf{M}$. Seen this way, the fact that not\nall classes can be sets simply means that we can’t injectively map the\npower set of any set into the set itself, which is a famous result by\nCantor. Functions like $f$ here are known as extensors and they have\nbeen used in the study of semantics of set theory.\n\nRussell’s paradox — which could be seen as a proof of Cantor’s theorem\nabout cardinalities of power sets — shows that Frege’s fifth axiom is\ncontradictory; not all classes can be sets. From here there are two\ntraditional ways to proceed: either through the theory of types or\nthrough some form of limitation of size principle.\n\nThe limitation of size principle in its vague form says that all small\nclasses (in the sense of cardinality) are sets, while all proper classes\nare very big; “too big” to be sets. The limitation of size principle can\nbe found in Cantor’s work where it is the basis for Cantor’s doctrine\nthat only transfinite collections can be thought as specific objects\n(sets), but some collections are “absolutely infinite”, and can’t be\nthought to be comprehended into an object. This can be given a precise\nformulation: all classes which are of the same cardinality as the\nuniversal class are too big, and all other classes are small. In fact,\nthis formulation can be used in von Neumann-Bernays-Gödel set theory to\nreplace the replacement axiom and almost all other set existence axioms\n(with the exception of the power set axiom).\n\nThe limitation of size principle can be seen to give rise to extensors\nof type $P^{<|A|}(A) \\rightarrow A$, where $P^{<|A|}(A)$ is the set of\nall subsets of $A$ of cardinality less than that of $A$. This is not the\nonly possible way to avoid Russell’s paradox. We could use an extensor\naccording to which all classes which are of cardinality less than that\nof the universe or for which the cardinality of their complement is less\nthan that of the universe are sets (i.e., map into elements of the\nmodel).\n\nIn many set theories there are formally no proper classes; ZFC is an\nexample of just such a set theory. In these theories one usually means\nby a proper class an open formula $\\Phi$, possibly with set parameters\n$a_1,...,a_n$. Notice, however, that these do not exhaust all possible\nproper classes that should “really” exist for the universe, as it only\nallows us to deal with proper classes that can be defined by means of an\nopen formula with parameters. The theory NBG formalises this usage: it’s\nconservative over ZFC (as clearly speaking about open formulae with\nparameters must be!).\n\nThere is a set theory known as Morse-Kelley set theory which allows us\nto speak about and to quantify over an extended class of impredicatively\ndefined proper classes that can’t be reduced to simply speaking about\nopen formulae.\n\nIn addition to the NBG and MK set theories which have proper classes,\nthere are more substantive theories involving proper classes. For\nexample, Ackermann set theory[@ackermann], which is based on set\ntheoretic reflection principles, allows proper classes to be members of\nother proper classes (although not of themselves) and adds $\\omega$\nlevels of proper classes on top of the cumulative hierarchy. Inductive\ntheories of truth such as Kripke’s and semi-inductive theories of truth\nsuch as Herzenberg’s and Gupta’s have also been used to model theories\nof proper classes in which the classes are allowed to be partial\n(membership in class need not be determined for every object, e.g. the\nclass itself) or otherwise differing from usual (the Church-scheme\n$a \\in \\{x|P(x)\\}\\leftrightarrow P(a)$ does not hold). Such theories are\nrather exotic, and are rarely if ever used in mathematical practice in\ncontrast to NBG and MK. The notable exception is the use of certain\ntheories (such as Ackermann’s) of proper classes based on reflection\nprinciples in the study of large cardinals.\n\n[9]{} Wilhelm Ackermann, [*Zur Axiomatik der Mengenlehre*]{},\nMathematische Annalen 131 (1956), 336–345. (This paper is .)",
  "language": "INFORMAL",
  "phrase": "Class",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Class"
    }
  ],
  "indexable": true
}