{
  "alternatePhrases": [
    "Independence Friendly logic"
  ],
  "definition": "*Independence Friendly logic* (IF-logic) is an interesting conservative\nextension of classical first-order logic based on very natural ideas\nfrom game theoretical semantics developed by Jaakko Hintikka and Gabriel\nSandu among others. Although IF-logic is a conservative extension of\nfirst order logic, it has a number of interesting properties, such as\nallowing truth-definitions and admitting a translation of all\n$\\Sigma^1_1$ sentences (second-order sentences with an initial\nsecond-order existential quantifier followed by a first-order sentence).\n\nIF-logic can be characterised as the natural extension of first-order\nlogic when one allows informational independence to occur in the\ngame-theoretical truth definition. To understand this idea we need first\nto introduce the game theoretical definition of truth for classical\nfirst-order logic.\n\nTo each first-order sentence $\\phi$ we assign a game $G(\\phi)$ with two\nplayers played on models of the appropriate language. The two players\nare called [*verifier*]{} and [*falsifier*]{} (or [*nature*]{}). The\nidea is that the [*verifier*]{} attempts to show that the sentence is\ntrue in the model, while the [*falsifier*]{} attempts to show that it is\nfalse in the model. The game $G(\\phi)$ is defined as follows. We will\nuse the convention that if $p$ is a symbol that names a function, a\npredicate or an object of the model $M$, then $p^M$ is that named\nentity.\n\n-   if $P$ is an $n$-ary predicate and $t_i$ are names of elements of\n    the model, then $G(P(t_1,...,t_n))$ is a game in which the verifier\n    immediately wins if $(t^M_1,...,t^M_n) \\in P^M$, otherwise the\n    falsifier immediately wins.\n\n-   the game $G(\\phi_1 \\vee \\phi_2)$ begins with the choice $\\phi_i$\n    from $\\phi_1$ and $\\phi_2$ ($i = 1$ or $i = 2$) by the verifier, and\n    then proceeds as the game $G(\\phi_i)$\n\n-   the game $G(\\phi_1 \\wedge \\phi_2)$ is the same as $G(\\phi_1 \\vee\n           \\phi_2)$, except that the choice is made by the falsifier\n\n-   the game $G(\\exists x \\phi(x))$ begins with the choice by verifier\n    of a member of $M$ which is given a name $\\mathbf{a}$, and then\n    proceeds as $G(\\phi(\\mathbf{a}))$\n\n-   the game $G(\\forall x \\phi(x))$ is the same as\n    $G(\\exists x \\phi(x))$, except that the choice of $\\mathbf{a}$ is\n    made by the falsifier\n\n-   the game $G(\\neg \\phi)$ is the same as $G(\\phi)$ with the roles of\n    the falsifier and verifier exchanged\n\nTruth of a sentence $\\phi$ is defined as the existence of a winning\nstrategy for verifier for the game $G(\\phi)$. Similarly, falsity of\n$\\phi$ is defined as the existence of a winning strategy for the\nfalsifier for the game $G(\\phi)$. (A strategy is a specification that\ndetermines for each move of the opponent what the player should do. A\nwinning strategy is a strategy which guarantees victory no matter what\nstrategy the opponent follows.)\n\nFor classical first-order logic, this definition is equivalent to the\nusual Tarskian definition of truth (i.e. the one based on satisfaction\nfound in most treatments of semantics of first-order logic). This means\nalso that since the law of excluded middle holds for first-order logic\nthat the games $G(\\phi)$ have a very strong property: either the\nfalsifier or the verifier has a winning strategy.\n\nNotice that all rules except those for negation and atomic sentences\nconcern choosing a sentence or finding an element. These can be codified\ninto functions, which tell us which sentence to pick or which element of\nthe model to choose, based on our previous choices and those of our\nopponent. For example, consider the sentence\n$\\forall x( P(x) \\vee Q(x))$. The corresponding game begins with the\nfalsifier picking an element $\\mathbf{a}$ from the model, so a strategy\nfor the verifier must specify for each element $\\mathbf{a}$ which of\n$Q(\\mathbf{a})$ and $P(\\mathbf{a})$ to pick. The truth of the sentence\nis equivalent to the existence of a winning strategy for the verifier,\ni.e. just such a function. But this means that\n$\\forall x( P(x) \\vee Q(x))$ is equivalent to\n$\\exists f \\forall x P(x) \\wedge f(x) = 0 \\vee Q(x) \\wedge f(x) = 1$.\nLet’s consider a more complicated example:\n$\\forall x \\exists y \\forall z \\exists s \\neg P(x,y,z,s)$. The truth of\nthis is equivalent to the existence of a functions $f$ and $g$, s.t.\n$\\forall x \\forall z P(x,f(x),z,g(z))$.\n\nThese sort of functions are known as Skolem functions, and they are in\nessence just winning strategies for the verifier. We won’t prove it\nhere, but all first-order sentences can be expressed in form\n$\\exists f_1 ... \\exists f_n \\forall x_1 ... \\forall x_k \\phi$, where\n$\\phi$ is a truth-functional combination of atomic sentences in which\nall terms are either constants or variables $x_i$ or formed by\napplication of the functions $f_i$ to such terms. Such sentences are\nsaid to be in $\\Sigma^1_1$ form.\n\nLet’s consider a $\\Sigma^1_1$ sentence\n$\\exists f \\exists g \\forall x \\forall z \\phi(x, f(x),y,g(z))$. Up\nfront, it seems to assert the existence of a winning strategy in a\nsimple semantical game like those described above. However, the game\ncan’t correspond to any (classical) first-order formula! Let’s see what\nsuch a strategy would look like. First, the falsifier chooses elements\n$\\mathbf{a}$ and $\\mathbf{b}$ to serve as $x$ and $y$. Then the verifier\nchooses an element $\\mathbf{c}$ knowing only $\\mathbf{a}$ and an element\n$\\mathbf{d}$ knowing only $\\mathbf{b}$. The verifier’s goal is that\n$\\phi(\\mathbf{a},\\mathbf{c},\\mathbf{b},\\mathbf{d})$ comes out as a true\natomic sentence. The game could actually be arranged so that the\nverifier is a team of two players (who aren’t allowed to communicate\nwith each other), one of which picks $\\mathbf{c}$, the other one picking\n$\\mathbf{d}$.\n\nFrom a game-theoretical point of view, games in which some moves must be\nmade without depending on some of the earlier moves are called\n“informationally incomplete” games, and they occur very commonly. Bridge\nis such a game, for example, and usually real examples of such games\nhave “players” being actually teams made up of several people.\n\nIF-logic comes out of the game-theoretical definition in a natural way\nif we allow informational independence in our semantical games. In\nIF-logic, every connective can be augmented with an independence marker\n$//$, so that $*//*'$ means that the game for the occurrence of $*'$\nwithin the scope of $*$ must be played without knowledge of the choices\nmade for $*$. For example $(\\forall x // \\exists y) \\exists y \\phi(x,y)$\nasserts that for any choice of value for $x$ by the falsifier, the\nverifier can find a value for $y$ that does not depend on the value of\n$x$, s.t. $\\phi(x,y)$ comes out true. This is not a very characteristic\nexample, as it can be written as an ordinary first-order formula\n$\\exists y \\forall x \\phi(x,y)$. The curious game we described above\ncorresponding to the second-order Skolem-function formulation\n$\\Sigma^1_1$ sentence\n$\\exists f \\exists g \\forall x \\forall z \\phi(x, f(x),y,g(z))$\ncorresponds to an IF-sentence\n$(\\forall x // \\exists y)(\\forall z // \\exists u)(\\exists y)(\\exists u)\\phi(x,y,z,u)$.\nIF-logic allows informational independence also for the usual logical\nconnectives, for example $(\\forall x // \\vee)(\\phi(x) \\vee \\psi(x))$ is\ntrue if and only if for all $x$, either $\\phi(x)$ or $\\psi(x)$ is true,\nbut which of these is picked by the verifier must be decided\nindependently of the choice for $x$ by the falsifier.\n\nOne of the striking characteristics of IF-logic is that every\n$\\Sigma^1_1$ formula $\\phi$ has an IF-translation $\\phi^IF$ which is\ntrue if and only if $\\phi$ is true (the equivalence does not in general\nhold if we replace ’true’ with ’false’). Since for example first-order\ntruth (in a model) is $\\Sigma^1_1$ definable (it’s just quantification\nover all possible valuations, which are second-order objects), there are\nIF-theories which correctly represent the truth predicate for their\nfirst-order part. What is even more striking is that sufficiently strong\nIF-theories can do this for the [*whole*]{} of the language they are\nexpressed in.\n\nThis seems to contradict Tarski’s famous result on the undefinability of\ntruth, but this is illusory. Tarski’s result depends on the assumption\nthat the logic is closed under contradictory negation. This is not the\ncase for IF-logic. In general for a given sentence $\\phi$ there is no\nsentence $\\phi*$ that is true just in case $\\phi$ is not true. Thus the\nlaw of excluded middle does not hold in general in IF-logic (although it\ndoes for the classical first-order portion). This is quite unsurprising\nsince games of imperfect information are very seldom determined in the\nsense that either the verifier or the falsifier has a winning strategy.\nFor example, a game in which I choose a 10-letter word and you have one\ngo at guessing it is not determined in this sense, since there is no\n10-letter word you couldn’t guess, and on the other hand you have no way\nof forcing me to choose any particular 10-letter word (which would\nguarantee your victory).\n\nIF-logic is stronger than first-order logic in the usual sense that\nthere are classes of structures which are IF-definable but not\nfirst-order definable. Some of these are even finite. Many interesting\nconcepts are expressible in IF-logic, such as equicardinality, infinity\n(which can be expressed by a logical formula in contradistinction to\nordinary first-order logic in which non-logical symbols are needed), and\nwell-ordering.\n\nBy Lindström’s theorem we thus know that either IF-logic is not complete\n(i.e. its set of validities is not r.e.) or the Löwenheim-Skolem theorem\ndoes not hold. In fact, the (downward) Löwenheim-Skolem theorem\n[*does*]{} hold for IF-logic, so it’s not complete. There is a complete\ndisproof procedure for IF-logic, but because IF-logic is not closed\nunder contradictory negation this does not yield a complete proof\nprocedure.\n\nIF-logic can be extended by allowing contradictory negations of closed\nsentences and truth functional combinations thereof. This extended\nIF-logic is extremely strong. For example, the second-order induction\naxiom for PA is\n$\\forall X( (X(0) \\wedge \\forall y( X(y) \\rightarrow X(y+1))) \\rightarrow \\forall y X(y))$.\nThe negation of this is a $\\Sigma^1_1$ sentence asserting the existence\nof a set that invalidates the induction axiom. Since $\\Sigma^1_1$\nsentences are expressible in IF-logic, we can translate the negation of\nthe induction axiom into IF-sentence $\\phi$. But now $\\neg\\phi$ is a\nformula of extended IF-logic, and is clearly equivalent to the usual\ninduction axiom! As all the rest of PA axioms are first order, this\nshows that extended IF-logic PA can correctly define the natural number\nsystem.\n\nThere exists also an interesting “translation” of $n$th-order logic into\nextended IF-logic. Consider an $n$-sorted first-order language and an\n$n$th-order theory $T$ translated into this language. Now, extend the\nlanguage to second order and add the axiom stating that the sort $k+1$\nactually comprises the whole of the powerset of the sort $k$. This is a\n$\\Pi^1_1$ sentence (i.e. of the form “for all predicates P there is a\nfirst order element of sort $k+1$ that comprises exactly the $k$\nextension of $P$”). It is easy to see that a formula is valid in this\nnew system if and only if it was valid in the original $n$th-order\nlogic. The negation of this axiom is again $\\Sigma^1_1$ and translatable\ninto IF-logic, and thus the axiom itself is expressible in extended\nIF-logic. Moreover, since most interesting second-order theories are\nfinitely axiomatisable, we can consider sentences of form\n$T*\\rightarrow\\phi$ (where $T*$ is the multisorted translation of $T$),\nwhich express logical implication of $\\phi$ by $T$ (correctly). This is\nequivalent to $\\neg (T*) \\vee \\phi$ (where $\\neg$ is contradictory), but\nsince $T*$ is a conjunction of a $\\Pi^1_1$-sentence-asserting\ncomprehension translated into extended IF-logic and first-order\ntranslation of the axioms of $T$, this is a $\\Sigma_1^1$ formula\ntranslatable to [*non*]{}-extended IF-logic and so is $\\phi$. Thus\nsentences of form $T \\rightarrow \\phi$ of $n$th-order logic are\ntranslatable into IF-sentences which are true just in case the originals\nwere.",
  "language": "INFORMAL",
  "phrase": "If-Logic",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/IFlogic"
    }
  ],
  "indexable": true
}