{
  "alternatePhrases": [
    "compatible propositions"
  ],
  "definition": "### Introduction {#introduction .unnumbered}\n\nIn classical physics, results regarding experiments performed on\nphysical propositions obey classical propositional logic. When a ball is\ntossed, one can, at any given time $t$, measure its position $x(t)$ and\nvelocity $v(t)$ with great precision almost “simultaneously”. If we know\nwhere the ball is, then we know, at that location $x(t)$, whether it is\nmoving at $v(t)$ or not.\n\nLet’s translate the above sentence into a logical statement. Suppose $p$\nis the statement that “the ball is at $x(t)$”, and $q$ is the statement\nthat “the ball is traveling at velocity $v(t)$”. Then last sentence in\nthe previous paragraph becomes\n\n> if $p$ is true, then either $p\\wedge q$ is true or $p\\wedge q'$ is\n> true.\n\nPut it more succinctly, we have the tautology\n$$p\\to (p\\wedge q)\\vee (p\\wedge q').$$ Converted to the language of\nBoolean algebra (via ), it says $$p\\le (p\\wedge q)\\vee (p\\wedge q')$$\nwhich is clearly true, since the right hand side is equal to $p$ (the\ndistributive property of a Boolean algebra).\n\nHowever, when we downsize the scale of the system (the ball) to\nsomething at the subatomic level, say, an electron, we enter the realm\nof non-classical physics (quantum mechanics), the story is much\ndifferent. Because of the uncertainty principle, the nature of being\nable to measure everything simultaneously is gone here. Even if we know\nthe location $x(t)$, we will not be able to know its velocity $v(t)$. In\nother words, the above inequality no longer holds. A new logic is needed\nfor reasoning in non-classical physics, in particular, quantum theory.\n\nIn the 1930’s, Birkhoff and von Neumann introduced a new kind of logic\nin dealing with quantum mechanics in their paper “The logic of quantum\nmechanics”. In that paper, physical constructs were converted into\nmathematical ones. For example, a physical observable is nothing more\nthan a Hermitian operator acting on an infinite dimensional Hilbert\nspace over the complex numbers. And it turns out that many of the\nconcepts quantum mechanics can be explained in terms of doing math on\noperators in a Hilbert space. Furthermore, the logic of quantum\nmechanics corresponds to that of the set of closed subspaces of an\ninfinite dimensional Hilbert space. This set is a lattice and it is not\na Boolean algebra, because its lack of distributivity, and therefore\ndoes not correspond to classical propositional logic. They tried to\naxiomatize this lattice as a complete complemented modular lattice (with\natoms). It was soon realized (by Piron) that this lattice is not even\nmodular.\n\n### Definition {#definition .unnumbered}\n\nToday, there are several inequivalent definitions of quantum logic, but\nall of which are in one form or another a generalization of a Boolean\nalgebra (the algebraic form of classical logic). Initially, a quantum\nlogic is none other than the lattice of projection operators over an\ninfinite-dimensional separable Hilbert space. Since its introduction,\nthe definition has been generalized, stripping away unnecessary details\n(atomicity for example) while keeping the essentials.\n\nOne of the more general definitions says that a *quantum logic* is an\nordered pair $(L,F)$, where $L$ is an orthomodular poset $L$, and $F$ is\na set of functions on $L$, called *states*, taking values in the unit\ninverval $[0,1]$, satisfying the following conditions:\n\n1.  $f(0)=0$ for each $f\\in F$,\n\n2.  $f(1)=1$ for each $f\\in F$,\n\n3.  if $a\\le b^{\\perp}$, then $f(a\\vee b)=f(a)+f(b)$ for each $f\\in F$\n\n4.  if $f(a)\\le f(b)$ for each $f\\in F$, then $a\\le b$. We say that $F$\n    is *full*.\n\nOne can think of $L$ as a physical system (an electron, for example),\nand elements of $L$ are *propositions* concerning the system. $F$ can be\nregarded as a set of probability measures on the propositions.\nConditions 1 and 2 say that $1$ and $0$ are propositions of $L$ that are\nalways true or always false, regardless of its states. Condition 3 is\nequivalent to the well-known law of finite additivity of a probability\nmeasure.\n\n**Remark**. One can define the notion of *compatibility* of a pair of\nelements (propositions) in a quantum logic: $a,b\\in L$ are *compatible*\nif they orthogonally commute, that is, there exist pairwise orthogonal\nelements $c,d,e\\in L$ such that $a=c\\vee e$ and $b=d\\vee e$. It turns\nout that compatible propositions exactly parallel those physical\npropositions which can be experimentally tested “simultaneously”. A\nquantum logic $L$ in which every two propositions are compatible is said\nto be a *classical logic*. It is not hard to show that a classical logic\nis a Boolean algebra.\n\n[8]{} L. Beran, [*Orthomodular Lattices, Algebraic Approach*]{},\nMathematics and Its Applications (East European Series), D. Reidel\nPublishing Company, Dordrecht, Holland (1985). G. Birkhoff, [*Lattice\nTheory*]{}, 3rd Edition, AMS Volume XXV, (1967). G. Birkhoff, J. von\nNeumann, [*The logic of quantum mechanics*]{}, Ann. of Math. 37, pp.\n823-843, (1936). D. W. Cohen, [*An Introduction to Hilbert Space and\nQuantum Logic*]{}, Springer, (1989). P. Mittelstaedt, [*Quantum\nLogic*]{}, D. Reidel Publishing Company, (1978).",
  "language": "INFORMAL",
  "phrase": "Quantum Logic",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/QuantumLogic"
    }
  ],
  "indexable": true
}