{
  "alternatePhrases": [],
  "definition": "After the discovery of the paradoxes of set theory (notably Russell’s\nparadox), it become apparent that naive set theory must be replaced by\nsomething in which the paradoxes can’t arise. Two solutions were\nproposed: type theory and axiomatic set theory based on a limitation of\nsize principle (see the entries class and von Neumann-Bernays-Gödel set\ntheory).\n\nType theory is based on the idea that impredicative definitions are the\nroot of all evil. Bertrand Russell and various other logicians in the\nbeginning of the 20th century proposed an analysis of the paradoxes that\nsingled out so called vicious circles as the culprits. A vicious circle\narises when one attempts to define a class by quantifying over a\ntotality of classes including the class being defined. For example,\nRussell’s class $R = \\{x \\mid x \\not\\in x\\}$ contains a variable $x$\nthat ranges over all classes.\n\nRussell’s type theory, which is found in its mature form in the\nmomentous [*Principia Mathematica*]{} avoids the paradoxes by two\ndevices. First, Frege’s fifth axiom is abandoned entirely: the\nextensions of predicates do not appear among the objects. Secondly, the\npredicates themselves are ordered into a ramified hierarchy so that the\npredicates at the lowest level can be defined by speaking of objects\nonly, the predicates at the next level by speaking of objects and of\npredicates at the previous level and so forth.\n\nThe first of these principles has drastic implications to mathematics.\nFor example, the predicate “has the same cardinality” seemingly can’t be\ndefined at all. For predicates apply only to objects, and not to other\npredicates. In Frege’s system this is easy to overcome: the\nequicardinality predicate is defined for [*extensions*]{} of predicates,\nwhich are objects. In order to overcome this, Russell introduced the\nnotion of types (which are today known as degrees). Predicates of degree\n1 apply only to objects, predicates of degree 2 apply to predicates of\ndegree 1, and so forth.\n\nType theoretic universe may seem quite odd to someone familiar with the\ncumulative hierarchy of set theory. For example, the empty set appears\nanew in all degrees, as do various other familiar structures, such as\nthe natural numbers. Because of this, it is common to indicate only the\nrelative differences in degrees when writing down a formula of type\ntheory, instead of the absolute degrees. Thus instead of writing\n\n$$\\exists P_1 \\forall x_0 (x_0 \\in P_1 \\leftrightarrow x_0 \\neq x_0)$$\n\none writes\n\n$$\\exists P_{i+1} \\forall x_i (x_i \\in P_{i+1} \\leftrightarrow x_i \\neq x_i)$$\n\nto indicate that the formula holds for any $i$. Another possibility is\nsimply to drop the subscripts indicating degree and let the degrees be\ndetermined implicitly (this can usually be done since we know that\n$x \\in y$ implies that if $y$ is of degree $n$, then $x$ is of degree\n$n+1$). A formula for which there is an assignment of types (degrees) to\nthe variables and constants so that it accords to the restrictions of\ntype theory is said to be stratified.\n\nThe second device implies another dimension in which the predicates are\nordered. In any given degree, there appears a hierarchy of levels. At\nfirst level of degree $n+1$ one has predicates that apply to elements of\ndegree $n$ and which can be defined with reference only to predicates of\ndegree $n$. At second level there appear all the predicates that can be\ndefined with reference to predicates of degree $n$ and to predicates of\ndegree $n+1$ of level 1, and so forth.\n\nThis second principle makes virtually all mathematics break down. For\nexample, when speaking of real number system and its completeness, one\nwishes to quantify over all predicates of real numbers (this is possible\nat degree $n+1$ if the predicates of real numbers appear at degree $n$),\nnot only of those of a given level. In order to overcome this, Russell\nand Whitehead introduced in PM the so-called axiom of reducibility,\nwhich states that if a predicate $P_n$ occurs at some level $k$ (i.e.\n$P_n$ = $P_n^k$), it occurs already on the first level.\n\nThe philosopher and logician Frank Plumpton Ramsey (1903-1930) was the\nfirst to notice that the axiom of reducibility in effect collapses the\nhierarchy of levels, so that the hierarchy is entirely superfluous in\npresence of the axiom. The original form of type theory is known as\nramified type theory, and the simpler alternative with no second\nhierarchy of levels is known as unramified type theory or simply as\nsimple type theory.\n\nOne descendant of type theory is W. v. Quine’s system of set theory\nknown as NF (New Foundations), which differs considerably from the more\nfamiliar set theories (ZFC, NBG, Morse-Kelley). In NF there is a class\ncomprehension axiom saying that to any stratified formula there\ncorresponds a set of elements satisfying the formula. The Russell class\nis not a set, since it contains the formula $x \\in x$, which can’t be\nstratified, but the universal class is a set: $x = x$ is perfectly legal\nin type theory, as we can assign to $x$ any degree and get a well-formed\nformula of type theory. It is not known if NF axiomatises any extensor\n(see the entry class) based on a limitation of size principle, like the\nmore familiar set theories do.\n\nIn the modern variants of type theory, one usually has a more general\nsupply of types. Beginning with some set $\\tau$ of types (presumably a\ndivision of the simple objects into some natural categories), one\ndefines the set of types $T$ by setting\n\n-   if $a,b \\in T$, then $(a \\rightarrow b) \\in T$\n\n-   for all $t \\in \\tau$, $t \\in T$\n\nOne way to proceed to get something familiar is to have $\\tau$ contain a\ntype $t$ for truth values. Then sentences are objects of type $t$, open\nformulae of one variable are of type $\\mathbf{Object}\\rightarrow t$ and\nso forth. This sort of type system is often found in the study of typed\nlambda calculus and also in intensional logics, which are often based on\nthe former.",
  "language": "INFORMAL",
  "phrase": "Russell'S Theory Of Types",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/RussellsTheoryOfTypes"
    }
  ],
  "indexable": true
}