{
  "alternatePhrases": [],
  "definition": "Bijections between different infinite sets can lead to paradoxes like\nthat of Tristram Shandy that Adolf Fraenkel tells us in order to explain\nthis fundamental feature of set theory (A.A. Fraenkel: “Einleitung in\ndie Mengenlehre” 3. Aufl., Springer, Berlin 1928, p. 24): “Well known is\nthe story of Tristram Shandy who is going to write his biography so\npedantically that he needs one year to complete a single day of his\nlife. Of course his biography will never get ready, when continuing in\nthis manner. But if he lived infinitely long (a countable infinity of\nyears, say) then his biography would get ’ready’, every day of his life,\nhow late ever, finally would get a description.” Tristram Shandy borrows\ntime in order to catch up with time already spent. (Similarities with\nmodern finance schemes are unmistakable.)\n\nBut we will show that this method leads to a contradiction. For that\nsake we use the less spectacular but better understandable ratio of 2 to\n1. We fill successively pairs of consecutively enumerated marbles into\nan urn. Between every two steps of filling we remove the marble with the\nlowest number from the urn. If the numbers contained in the urn are\nseparated by a point from those removed already, this yields the\nfollowing sequence\n\n21., 2.1, 432.1, 43.21, 6543.21, 654.321, ...\n\nwhich however gets confusing when multi-digit numbers are involved. The\npicture gets clearer, when the even numbers are denoted by 0 and the odd\nnumbers by 1.\n\n01., 0.1, 010.1, 01.01, 0101.01, 010.101, ...\n\nAfter infinitely many exchanges we have a contradiction between set\ntheory and mathematics: Set theory yields as the limit the empty urn\nbecause for every marble the step can be determined, when it is removed.\n\nBut this very sequence can also be understood as a sequence of real\nnumbers r. Mathematics shows that the (improper) limit is infinite,\nproved by the proper limit 0 of the sequence of the reciprocals 1/r.\n\nSince the logarithm is a strictly increasing function of its argument\nand gives the number of digits of x by \\[log x\\] + 1, we have a\ncontradiction in that, according to mathematics, there will be a set of\ninfinitely many indexed digits on the left hand side of the point in the\nlimit.\n\nAs one and the same sequence of sets of digits leads to different\nresults in set theory and in mathematics, set theory can no longer be\naccepted as the basis of mathematics. In particular the results of a\nscientific theory must not depend on the choice of symbols. But even\nthat occurs in set theory. If we let the above thought-experiment run\nmaterially exactly as before, but remove always the largest number\ninstead of the smallest, then the urn contains infinitely many marbles\nin the limit. The question what might happen when an accidental number\nis removed remains without answer.\n\nHow could such a contradiction appear? The true reason is the\nidentification of all and each that is based upon and suggested by the\nuse of the same symbol in logic. A bijection between natural numbers and\na countable set enumerates each element like a street number is fixed on\na house. But that means only for finite sets that all elements are\nenumerated. In infinite sets there is for each enumerated element an\ninfinity of not enumerated elements - and this relation does never\nchange. Unfortunately in set theory “never” is mistaken for a time that\ncan be arrived at. Just like every infinity can be completed, so can\neternity as an infinite set of seconds.\n\nThe basic error of set theory is that the correct meaning of potential\ninfinity has been reversed to actual infinity.\n\nPotential infinity: For every initial segment (1, 2, 3, ..., n) of\nnatural numbers, there is a larger initial segment (1, 2, 3, ..., n,\nn+1).\n\nActual infinity: There is an initial segment (1, 2, 3, ...), namely the\nsequence of all natural numbers, that is larger than every other initial\nsegment (1, 2, 3, ..., n).\n\nThat means, that a quantifier exchange has occured. The correct sentence\n“for every initial segment (1, 2, 3, ..., n) of the natural numbers\nthere is a larger one” has been inverted to “there is an initial segment\nof the natural numbers (namely the complete set of all natural numbers)\nthat is larger than every other initial segment”. Actually\nmathematicians, strictly committed to logic, should have refused to be\ntaken for a ride. Who would invert the sentence “every US citizen lives\nin America” to “every American lives in the US”?",
  "language": "INFORMAL",
  "phrase": "The Paradox Of Tristram Shandy",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/TheParadoxOfTristramShandy"
    }
  ],
  "indexable": true
}