{
  "alternatePhrases": [
    "NBG",
    "vNBG",
    "vNBG",
    "VNB"
  ],
  "definition": "von Neumann-Bernays-Gödel (commonly referred to as NBG or vNBG) set\ntheory is an axiomatisation of set theory closely related to the more\nfamiliar Zermelo-Fraenkel with choice (ZFC) axiomatisation. The primary\ndifference between ZFC and NBG is that NBG has proper classes among its\nobjects. NBG and ZFC are very closely related and are in fact\nequiconsistent, NBG being a conservative extension of ZFC.\n\nIn NBG, the proper classes are differentiated from sets by the fact that\nthey do not belong to other classes. Thus in NBG we have\n\n$$\\mathbf{Set}(x) \\leftrightarrow \\exists y ( x \\in y )$$\n\nAnother interesting fact about proper classes within NBG is the\nfollowing [*limitation of size principle*]{} of von Neumann:\n\n$$\\neg \\mathbf{Set}(x) \\leftrightarrow |x| = |V|$$\n\nwhere $V$ is the set theoretic universe. This principle can in fact\nreplace in NBG essentially all set existence axioms with the exception\nof the powerset axiom (and obviously the axiom of infinity). Thus the\nclasses that are proper in NBG are in a very clear sense big, while the\nsets are small.\n\nThe NBG set theory can be axiomatised in two different ways\n\n-   Using the Gödel class construction functions, resulting in a finite\n    axiomatisation\n\n-   Using a class comprehension axiom scheme, resulting in an infinite\n    axiomatisation\n\nIn the latter alternative we take ZFC and relativise all of its axioms\nto sets, i.e. we replace every expression of form $\\forall x \\phi$ with\n$\\forall x (Set(x) \\rightarrow \\phi)$ and $\\exists x \\phi$ with\n$\\exists x (Set(x) \\wedge \\phi)$ and add the class comprehension scheme\n\n> If $\\phi$ is a formula with a free variable $x$ with all its\n> quantifiers restricted to sets, then the following is an axiom:\n> $ \\exists A \\forall x (x \\in A \\leftrightarrow \\phi)$\n\nNotice the important restriction to formulae with quantifiers restricted\nto sets in the scheme. This requirement makes the NBG proper classes\npredicative; you can’t prove the existence of a class the definition of\nwhich quantifies over all classes. This restriction is essential; if we\nloosen it we get a theory that is not conservative over ZFC. If we allow\narbitrary formulae in the class comprehension axiom scheme we get what\nis called Morse-Kelley set theory. This theory is essentially stronger\nthan ZFC or NBG, as it can prove their consistency (in addition to\neverything they already prove). In addition to these axioms, NBG also\ncontains the global axiom of choice: there is a function which picks an\nelement from each non-empty set. The global axiom of choice follows from\nthe limitation of size principle. This is because we can prove, e.g. by\nmeans of the Burali-Forti paradox, that the class of all ordinals is not\na set, and hence there is a bijection between the class of ordinals and\nthe class of all sets. We can use this bijection to pick an element from\neach non-empty set simply by picking the element with the least ordinal\nassigned to it by the bijection.\n\nAnother way to axiomatise NBG is to use the eight Gödel class\nconstruction functions. These functions correspond to the various ways\nin which one can build up formulae (restricted to sets!) with set\nparameters. The functions are finite in number and so are the resulting\naxioms governing their behaviour. In particular, since there is a class\ncorresponding to any restricted formula, the intersection of any set and\nthis class exists too (and is a set). Thus the comprehension scheme of\nZFC can be replaced with a finite number of axioms, provided we allow\nfor proper classes.\n\nThe device for turning NBG into a finitely axiomatised theory can be\nused for other theories too. For example, the theory $ACA_0$ which is a\nformalisation of $PA$ using set variables and the so called arithmetical\ncomprehension scheme can be finitely axiomatised using this device.\n\nIt is easy to show that everything provable in ZF is also provable in\nNBG. It is also not too difficult to show that NBG without global choice\nis a conservative extension of ZFC. However, showing that NBG (including\nglobal choice) is a conservative extension of ZFC is considerably more\ndifficult. This is equivalent to showing that NBG with global choice is\nconservative over NBG with only local choice. In order to do this one\nneeds to use (class) forcing. This result is usually credited to Easton\nand Solovay.",
  "language": "INFORMAL",
  "phrase": "Von Neumann-Bernays-G\\\"Odel Set Theory",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/VonNeumannBernaysGodelSetTheory"
    }
  ],
  "indexable": true
}