{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "If a field is finite, then its algebraic closure is countably infinite.\n\nBecause a finite field cannot be algebraically closed, the algebraic\nclosure of a finite field must be infinite. Hence, it only remains to\nshow that the algebraic closure is countable. Every element of the\nalgebraic closure is the root of some polynomial. Furthermore, every\npolynomial has a finite number of roots (the number is bounded by its\ndegree) and there are a countable number of polynomials whose\ncoefficients belong to a given finite set. Since the union of a\ncountable family of finite sets is countable, the number of elements of\nthe algebraic closure is countable.\n\nIf a field is infinite, then its algebraic closure has the same\ncardinality as the original field.\n\nSince a field is isomorphic to a subset of its algebraic closure, it\nfollows that the cardinality of the closure is at least the cardinality\nof the original field. The number of polynomials of degree $n$ with\ncoefficients in a given set is the same as the number of $n$- tuplets of\nelements of $S$, which is the cardinality of the set raised to the\n$n$-th power. Since an infinite cardinal raised to an finite power\nequals itself, the number of polynomials of a given degree equals the\nthe cardinality the original field. Since the cardinality of the union\nof a countable number of sets each of which has the same infinite number\nof elements equals the common cardinality of the sets, the total number\nof polynomials with coefficients in the field equals the cardinality of\nthe field. Since every element of the algebraic closure of a field is\nthe root of some polynomial with elements of the field for coefficients\nand a polynomial has a finite number of roots, it follows that the\ncardinality of the algebraic closure is bounded by the cardinality of\nthe original field.\n\nFor every transfinite cardinal number $N$, there exists an algebrically\nclosed field with exactly $N$ elements.\n\nLet $F$ be the field of rational functions with integer coefficients in\nvariables $x_i$, where the index $i$ ranges over an index set $I$ whose\ncardinality is $N$. We claim that the cardinality of $F$ is $N$. The\ncardinality is at least $N$ becasue we have the $N$ rational functions\n$x_i$, so it only remains to show that the cardinality is not greater\nthan $N$. To do this, we first show that the number of polynomials in\nthe $x_i$ with integer coefficients equals $N$. A polynomial is\ndetermined by a finite set of coefficients and a finite set of\nmonomials. The number of possible sets of coefficients is the number of\nfinite tuplets of integers, which is $\\aleph_0$. Since a monomial may be\ndetermined by a mapping of a finite set into the set\n$\\{ x_i \\mid i \\in I \\}$, the number of possible monomials of degree $n$\nis bounded by $N^n$. Since $N$ is transfinite and $n$ is finite, we have\n$N^n = N$. Thus the number of possible monomials is bounded by\n$N \\aleph_0 = N$. So the number of polynomials is bounded by the product\nof $\\aleph_0$ and $N$, which is $N$ and the number of rational functions\nis bounded by $N^2$, which equals $N$.",
  "citations": [
    {
      "textCitation": "https://planetmath.org/CardinalityOfAlgebraicClosure"
    }
  ],
  "indexable": true,
  "names": [
    "cardinality of algebraic closure"
  ]
}