{
  "alternatePhrases": [],
  "definition": "The Boubaker polynomials($B_n (X)$) are a sequence with integer\ncoefficients. They were established in an applied physics study. The\nmonomial expression of the Boubaker polynomials is :\n\n$$B_n(X)=\\sum_{p = 0}^{\\xi(n)} (-1)^p \\frac{(n-4p)}{(n-p)}\\binom{n-p}{p}(X)^{n-2p}$$\n\nwhere :\n$$\\xi(n)=\\left \\lfloor \\frac{n}{2} \\right \\rfloor =\\frac{2n+((-1)^n - 1)}{4}$$\n(The symbol :$\\lfloor . \\rfloor$ designates the .)\n\nThe Boubaker Polynomials Expansion Scheme BPES has been used by several\napplied physics and engineering studies. Agida et al. used this protocol\nfor establishing an analytical method for solving Love integral equation\nin the case of a rational kernel.\n\nO. B. Awojoyogbe et al. took profit from the similarities between the\nhemodynamic flow system inside some organic tissues and the BPES\ndefinition system, in order to express the tissue response to magnetic\nfields excitation. Kumar combined the Boubaker Polynomials Expansion\nScheme (BPES) analyses and array analyses for determining the normalized\nfield created conjointly by two similar circular coaxial conducting\ndisks separated by a pre-fixed distance. On an other hand, J. Ghanouchi\net al. used the BPES to discuss the intriguing paradox of establishment\nof non-Gaussian isothermal generative lines beneath a plate surface\ntargeted by a Gaussian beam.\n\nThe works carried out by S. Slama et al. proposed solutions to the heat\ntransfer problem inside different welding and annealing systems. These\nworks used the BPES as a guide to solve heat discrete conservation\nequations during cooling phases, and yielded consistent cooling\nvelocities profile. T. Ghrib et al. used the BPES in order to establish\na first order correlation between the Vickers microhardness and the\nthermal diffusivity of treated steel alloys.\n\nIn the last years, S. Lazzez et al. and D. H. Zhang et al. investigated\nsemiconductor micro layers physical properties using the BPES. More\nrecently, A. Yildirim et al. proposed analytical solutions to the\nKleinÃƒÂ¢Gordon equation in a pulsed stationary regime using modified\nvariational iteration method (MVIM) and BPES. GengÃƒÂ¢s standard\nsecond-order boundary value problem (BVP) was also investigated by D.H.\nZang et al. using the BPES.\n\nIn a different filed like animal biology and medical sciences, Dubey et\nal. proposed, in a study commented and corrected by Milgram, an\nanalytical method for the identification of predatorÃƒÂ¢prey populations\ntime-dependent evolution in a Lotka-Volterra predatorÃƒÂ¢prey model\nwhich took into account the concept of accelerated-predator-satiety, O.\nB. Awojoyogbe et al. proposed also a mathematical formulation for the\nNMR diffusion equation derived from the Bloch NMR flow in lower heart\ncoronary artery. This formulation was totally based on the properties of\nthe Boubaker polynomials expansion scheme BPES.\n\nReferences\n\nBelhadj, A., Onyango O., Rozibaeva, N., Boubaker Polynomials Expansion\nScheme-Related Heat Transfer Investigation Inside Keyhole Model , J.\nThermophys. Heat Transf. 23, 639-640 (2009a)\n\nBelhadj, A., Bessrour, J., Bouhafs, M., Barrallier, L., Experimental and\ntheoretical cooling velocity profile inside laser welded metals using\nkeyhole approximation and Boubaker polynomials expansion, J. of Thermal\nAnalysis and\n\nDubey B., Zhao T.G., Jonsson M., Rahmanov H., A solution to the\naccelerated-predator-satiety Lotka-Volterra predator-prey problem using\nBoubaker polynomial expansion scheme, J. of Theoretical Biol. 264,\n(1),1542010-14 (2010) Fridjine, S., Amlouk, M., A new parameter: An\nABACUS for optimizig functional materials using the Boubaker polynomials\nexpansion scheme, Modern Phys. Lett. B 23, 2179-2182 (2009)\n\nOyodum, O.D., Awojoyogbe, O.B., Dada, M., Magnuson, J., On the earliest\ndefinition of the Boubaker polynomials, Eur. Phys. J.-App. Phys. 46,\n21201-21203 (2009)\n\nTabatabaei, S., Zhao, T., Awojoyogbe, O., Moses, F., Cut-off cooling\nvelocity profiling inside a keyhole model using the Boubaker polynomials\nexpansion scheme, Heat Mass Transf. 45, 1247-1251 (2009)\n\nZhang D. H., On the earliest definition of the Boubaker polynomials\",\nThe Eur. Phys. J. Appl. Physics 50, (1), 11201-03 (2010)\n\nZhao T. G., Naing L., Yue W. X., Some new features of the Boubaker\npolynomials expansion scheme BPES, Mat. Zametki 87(2), 175-178 (2010)\n\nZhang D. H., Li F. W. Boubaker Polynomials Expansion Scheme(BPES)\noptimisation of copper tin sulfide, Materials Letters 64, (6), 778-780\n(2010)\n\nZhang D. H., Li F. W. A Boubaker Polynomials Expansion Scheme\nBPES-related analytical solution to Williams-Brinkmann stagnation point\nflow equation at a blunt body, Ir. Journal of App. Phys. Lett. IJAPLett.\n2,25-28 (2009)\n\nLuzon A. and M. A.Moron, 2010. Recurrence relations for polynomial\nsequences via Riordan matrices, Linear Algebra and its Applications\n433(7):1422-1446\n\nBarry, P. and A. Hennessy, 2010. Meixner-Type results for Riordan arrays\nand associated integer sequences, section 6: The Boubaker polynomials,\nJournal of Integer Sequences, 13:1-34\n\nAgida M. and A. S. Kumar, 2010. A Boubaker Polynomials Expansion Scheme\nsolution to random Love equation in the case of a rational kernel, El.\nJournal of Theoretical Physics 7 (24):319-326\n\nKumar, A. S., 2010, An analytical solution to applied\nmathematics-related Love’s equation using the Boubaker Polynomials\nExpansion Scheme, Journal of the Franklin Institute. 347:1755-1761\n\nA. Yildirim, S. T. Mohyud-Din, D. H. Zhang, Analytical solutions to the\npulsed Klein-Gordon equation using Modified Variational Iteration Method\n(MVIM) and Boubaker Polynomials Expansion Scheme (BPES), Computers and\nMathematics with Applications (2010); DOI:10.1016/j.camwa.2009.12.026 .\n\nMilgram, A., 2011. The stability of the Boubaker polynomials expansion\nscheme (BPES)-based solution to Lotka-Volterra problem, J. of\nTheoretical Biology, 271( 1, 21): 157-158\n\nMore to come…",
  "language": "INFORMAL",
  "phrase": "Boubaker Polynomials",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/BoubakerPolynomials"
    }
  ],
  "indexable": true
}