{
  "alternatePhrases": [],
  "definition": "A *nonogram*, also known as a *paint by numbers puzzle* or a *griddler*,\nis a puzzle in which the solver must reconstruct a picture drawn in a\ngrid using clues which give the distribution of pixels in each row and\ncolumn.\n\nThe simplest nonograms use two colors, white (usually the background)\nand black (usually the foreground). Here is a sample black and white\nnonogram:\n\n![A nonogram in its unsolved state.](initial.epsi)\n\nThe numbers to the left of a row indicate how many runs of black squares\nthere are in that row and how long each such run is. The numbers above a\ncolumn serve the same purpose for that column.\n\nFor instance, the clue for the first row is $(1,1)$. Since there are six\ndifferent ways of selecting two nonadjacent squares in a row of length\nfive, we cannot yet conclude anything from this clue. The next clue,\n$(5)$, indicates that the second row is completely filled in with black\nsquares. Such clues are rare on real puzzles. Slightly more common are\nclues such as the fourth row clue $(3)$. Although we cannot yet know\nprecisely where the run of three black squares is positioned, by the\npigeonhole principle the middle square of that row must be black.\nFinally, since two runs of black must be separated by at least one\nsquare of another color, the clue $(2,2)$ tells us that the fifth row\nhas two black squares followed by a white square and then two more black\nsquares.\n\nApplying the information we have so far yields the following picture.\n\n![The nonogram after some clues have been applied.](stage1.epsi)\n\nWith some of the squares filled in, the remaining clues give us more\nuseful information. For instance, the first vertical clue says that the\nfirst column has exactly two black squares, and we have already drawn\ntwo squares in that column, so the other three squares must all be\nwhite. By using the positions of the squares in the second and fourth\ncolumns we can finish those columns as well. By using only vertical\nclues, we can finish every column but the last.\n\n![The nonogram in a nearly complete state.](stage2.epsi)\n\nTo complete the puzzle, we appeal to the fact that the first row must\nhave two black squares while the third row only has one. In the fifth\nrow we therefore place a black square in the first position and a white\nsquare in the third position.\n\n![A solved nonogram.](stage3.epsi)\n\nWe are done.\n\nGiven a picture, it is straightforward to generate the clues for that\npicture: simply determine for each row and column the lengths of the\nruns of the non-background colors. However, it is not always\nstraightforward to recover the picture from the clues, and a designer\ncan exploit this fact to make puzzles of varying levels of difficulty. A\nchallenge facing the designer is the fact that not every puzzle has a\nunique solution. In particular, if we view solutions as rectangular\nmatrices with entries $0$ and $1$, where $0$ represents the background\ncolor and $1$ the foreground color, then any 5-by-5 permutation matrix\nis a solution to the following puzzle.\n\n![An ambiguous nonogram.](ambiguous.epsi)\n\nLogic puzzles with multiple solutions can be interesting for\nmathematical reasons, but they are unacceptable as puzzles. The problem\nof determining whether a puzzle has a unique solution is sometimes\ncalled the *Another Solution Problem*, or *ASP*, and is known to be\nNP-complete for many puzzles, including nonograms.\n\nNonograms as we have described them can be generalized by allowing more\ncolors to be used in the picture. The clues then must indicate both\nwhich non-background colors appear in which order in a row or column and\nhow long each run is. Another generalization is to use a non-square\ngrid. For example, there are *triddlers*, which are nonograms on a grid\ntiled by equilateral triangles and which therefore require clues for\nthree directions. One could also imagine generalizations to higher\ndimensions, leading to building-block sculpture puzzles and the like.\n\n[99]{} N. Ueda and T. Nagao. *NP-completeness results for NONOGRAM via\nparsimonious reductions.* Technical Report TR96-0008, Department of\nComputer Science, Tokyo Institute of Technology, 1996.\n\nT. Yato. *Complexity and completeness of finding another solution and\nits application to puzzles*. Thesis in information science, the\nUniversity of Tokyo, 2003",
  "language": "INFORMAL",
  "phrase": "Nonogram",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Nonogram"
    }
  ],
  "indexable": true
}