{
  "alternatePhrases": [],
  "definition": "A Lie group is a group endowed with a compatible . To be more precise,\nLie group structure consists of two kinds of data\n\n-   a finite-dimensional, real-analytic manifold $G$, and\n\n-   two analytic maps, one for multiplication $G\\times\n      G\\rightarrow G$ and one for inversion $G\\rightarrow G$, which obey\n    the appropriate group axioms.\n\nThus, a homomorphism in the category of Lie groups is a group\nhomomorphism that is simultaneously an analytic mapping between two\nreal-analytic manifolds.\n\nOne can equivalently define a Lie group $G$ using the following easy\ncharacterization\n\nA finite-dimensional real analytic manifold $G$ is a Lie algebra iff the\nmap\n$$G\\times G \\rightarrow G \\qquad (x,y)\\mapsto x^{-1}y \\quad \\forall x,y\\in G$$\nis analytic.\n\nNext, we describe a natural construction that associates a certain Lie\nalgebra ${\\mathfrak{g}}$ to every Lie group $G$. Let $e\\in G$ denote the\nidentity element of $G$. For $g\\in G$ let ${\\lambda}_g \\colon G \\to G$\ndenote the diffeomorphisms corresponding to left multiplication by $g$.\n\nA vector field $V$ on $G$ is called left-invariant if $V$ is invariant\nwith respect to all left multiplications. To be more precise, $V$ is\nleft-invariant if and only if $$({\\lambda}_g)_*(V) = V$$ (see\npush-forward of a vector-field) for all $g\\in G$.\n\nThe Lie bracket of two left-invariant vector fields is again, a\nleft-invariant vector field.\n\n[*Proof.*]{} Let $V_1, V_2$ be left-invariant vector fields, and let\n$g\\in G$. The bracket operation is covariant with respect to\ndiffeomorphism, and in particular\n$$({\\lambda}_g)_*[V_1,V_2] = [({\\lambda}_g)_*V_1,({\\lambda}_g)_*V_2] =\n[V_1,V_2].$$ Q.E.D.\n\nThe Lie algebra of $G$, denoted hereafter by ${\\mathfrak{g}}$, is the\nvector space of all left-invariant vector fields equipped with the\nvector-field bracket.\n\nNow a right multiplication is invariant with respect to all left\nmultiplications, and it turns out that we can characterize a\nleft-invariant vector field as being an infinitesimal right\nmultiplication.\n\nLet $a\\in T_eG$ and let $V$ be a left-invariant vector-field such that\n$V_e = a$. Then for all $g\\in G$ we have $$V_g = ({\\lambda}_g)_*(a).$$\n\nThe intuition here is that $a$ gives an infinitesimal displacement from\nthe identity element and that $V_g$ gives a corresponding infinitesimal\nright displacement away from $g$. Indeed consider a curve\n$$\\gamma \\colon (-\\epsilon,\\epsilon) \\to G$$ passing through the\nidentity element with velocity $a$; i.e.\n$$\\gamma(0) = e,\\quad \\gamma'(0) = a.$$ The above proposition is then\nsaying that the curve\n$$t\\mapsto g\\gamma(t),\\quad t\\in(-\\epsilon,\\epsilon)$$ passes through\n$g$ at $t=0$ with velocity $V_g$.\n\nThus we see that a left-invariant vector field is completely determined\nby the value it takes at $e$, and that therefore ${\\mathfrak{g}}$ is\nisomorphic, as a vector space to $T_eG$.\n\nOf course, we can also consider the Lie algebra of right-invariant\nvector fields. The resulting Lie-algebra is anti-isomorphic (the order\nin the bracket is reversed) to the Lie algebra of left-invariant vector\nfields. Now it is a general principle that the group inverse operation\ngives an anti-isomorphism between left and right group actions. So, as\none may well expect, the anti-isomorphism between the Lie algebras of\nleft and right-invariant vector fields can be realized by considering\nthe linear action of the inverse operation on $T_e G$.\n\nFinally, let us remark that one can induce the Lie algebra structure\ndirectly on $T_e G$ by considering adjoint action of $G$ on $T_eG$.\n\n#### History and motivation.\n\n#### Examples.\n\n#### Notes.\n\n1.  No generality is lost in assuming that a Lie group has analytic,\n    rather than $C^\\infty$ or even $C^k,\\; k=1,2,\\ldots$ structure.\n    Indeed, given a $C^1$ differential manifold with a $C^1$\n    multiplication rule, one can show that the exponential mapping\n    endows this manifold with a compatible real-analytic structure.\n\n    Indeed, one can go even further and show that even $C^0$ suffices.\n    In other words, a topological group that is also a\n    finite-dimensional topological manifold possesses a compatible\n    analytic structure. This result was formulated by Hilbert as his ,\n    and proved in the 50’s by Montgomery and Zippin.\n\n2.  One can also speak of a complex Lie group, in which case $G$ and the\n    multiplication mapping are both complex-analytic. The theory of\n    complex Lie groups requires the notion of a holomorphic\n    vector-field. Not withstanding this complication, most of the\n    essential features of the real theory carry over to the complex\n    case.\n\n3.  The name “Lie group” honours the Norwegian mathematician Sophus Lie\n    who pioneered and developed the theory of continuous transformation\n    groups and the corresponding theory of Lie algebras of vector fields\n    (the group’s infinitesimal generators, as Lie termed them). Lie’s\n    original impetus was the study of continuous symmetry of geometric\n    objects and differential equations.\n\n    The scope of the theory has grown enormously in the 100+ years of\n    its existence. The contributions of Elie Cartan and Claude Chevalley\n    figure prominently in this evolution. Cartan is responsible for the\n    celebrated ADE classification of simple Lie algebras, as well as for\n    charting the essential role played by Lie groups in differential\n    geometry and mathematical physics. Chevalley made key foundational\n    contributions to the analytic theory, and did much to pioneer the\n    related theory of algebraic groups. Armand Borel’s book “Essays in\n    the History of Lie groups and algebraic groups” is the definitive\n    source on the evolution of the Lie group concept. Sophus Lie’s\n    contributions are the subject of a number of excellent articles\n    by T. Hawkins.",
  "language": "INFORMAL",
  "phrase": "Lie Group",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/LieGroup"
    }
  ],
  "indexable": true
}