{
  "alternatePhrases": [],
  "definition": "Definitions {#definitions .unnumbered}\n===========\n\nA *topological group* is a group $G$ endowed with a topology such that\nthe multiplication and inverse operations of $G$ are . That is, the map\n$G\\times G\\to G$ defined by $(x,y)\\mapsto xy$ is continuous, where the\ntopology on $G\\times G$ is the product topology, and the map $G\\to G$\ndefined by $x\\mapsto x^{-1}$ is also continuous.\n\nMany authors require the topology on $G$ to be Hausdorff, which is\nequivalent to requiring that the trivial subgroup be a closed set.\n\nA topology on a group $G$ that makes $G$ into a topology group is called\na *group topology* for $G$.\n\nExamples {#examples .unnumbered}\n========\n\nAny group becomes a topological group if it is given the discrete\ntopology.\n\nAny group becomes a topological group if it is given the indiscrete\ntopology.\n\nThe real numbers with the standard topology form a topological group.\nMore generally, an ordered group with its is a topological group.\n\nLie groups are topological groups with additional structure.\n\nProfinite groups are another important class of topological groups; they\narise, for example, in infinite Galois theory.\n\nSubgroups, quotients and products {#subgroups-quotients-and-products .unnumbered}\n=================================\n\nEvery of a topological group either has empty interior or is clopen. In\nparticular, all proper subgroups of a connected topological group have\nempty interior. The closure of any subgroup is also a subgroup, and the\nclosure of a normal subgroup is normal (for proofs, see the entry “”). A\nsubgroup of a topological group is itself a topological group, with the\nsubspace topology.\n\nIf $G$ is a topological group and $N$ is a normal subgroup of $G$, then\nthe quotient group $G/N$ is also a topological group, with the quotient\ntopology. This quotient $G/N$ is Hausdorff if and only if $N$ is a\nclosed subset of $G$.\n\nIf $(G_i)_{i\\in I}$ is a family of topological groups, then the\nunrestricted direct product $\\prod_{i\\in I}G_i$ is also a topological\ngroup, with the product topology.\n\nMorphisms {#morphisms .unnumbered}\n=========\n\nLet $G$ and $H$ be topological groups, and let $f\\colon G\\to H$ be a\nfunction.\n\nThe function $f$ is said to be a *homomorphism of topological groups* if\nit is a group homomorphism and is also continuous. It is said to be an\n*isomorphism of topological groups* if it is both a group isomorphism\nand a homeomorphism.\n\nNote that it is possible for $f$ to be a continuous group isomorphism\n(that is, a bijective homomorphism of topological groups) and yet not be\nan isomorphism of topological groups. This occurs, for example, if $G$\nis $\\R$ with the discrete topology, and $H$ is $\\R$ with its usual\ntopology, and $f$ is the identity map on $\\R$.\n\nTopological properties {#topological-properties .unnumbered}\n======================\n\nWhile every group can be made into a topological group, the same cannot\nbe said of every topological space. In this section we mention some of\nthe properties that the underlying topological space must have.\n\nEvery topological group is bihomogeneous and . Note that our earlier\nclaim that a topological group is Hausdorff if and only if its trivial\nsubgroup is closed follows from this: if the trivial subgroup is closed,\nthen homogeneity ensures that all singletons are closed, and so the\nspace is , and being completely regular is therefore Hausdorff. A\ntopological group is not necessarily , however, a counterexample being\nthe unrestricted direct product of uncountably many copies of the\ndiscrete group $\\Z$.\n\nEvery topological group is obviously an H-space. Consequently, the\nfundamental group of a topological group is abelian. Note that because\ntopological groups are homogeneous, the fundamental group does not\ndepend (up to isomorphism) on the choice of basepoint.\n\nEvery locally compact topological group is and strongly paracompact.\n\nEvery connected locally compact topological group is $\\sigma$-compact.\n\nOther notes {#other-notes .unnumbered}\n===========\n\nEvery topological group possesses a natural uniformity, which induces\nthe topology. See the entry about the .\n\nA locally compact topological group possesses a natural measure, called\nthe Haar measure.",
  "language": "INFORMAL",
  "phrase": "Topological Group",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/TopologicalGroup"
    }
  ],
  "indexable": true
}