{
  "alternatePhrases": [
    "symmetry"
  ],
  "definition": "Quantum Symmetry\n================\n\nOften quantum symmetry is understood in terms of properties of symmetry\ngroups, their representations and related algebras. Quantum groups also\npossess quantum symmetries which are distinct from those exhibited by\nclassical Lie groups, groups of rotations and Poisson or Lorentz\ntransformation groups. Extended quantum symmetries are also encountered\nfor quantum groupoids, quantum categories, Hamilton algebroids, graded\nLie super-algebras, Lie algebroids and quantum systems with topological\norder.\n\nParacrystal Theory and Convolution Algebra\n------------------------------------------\n\nAs reported in a recent publication [@BGB1], the general theory of\nscattering by partially ordered, atomic or molecular, structures in\nterms of *paracrystals* and *lattice convolutions* was formulated by\nHosemann and Bagchi in [@Hosemann-Bagchi62] using basic techniques of\nFourier analysis and convolution products. A natural generalization of\nsuch molecular, partial symmetries and their corresponding analytical\nversions involves convolution algebras – a functional/distribution\n[@Schwartz45; @Schwartz52] based theory that we will discuss in the\ncontext of a more general and original concept of a\n*convolution-algebroid of an extended symmetry groupoid of a\nparacrystal*, of any molecular or nuclear system, or indeed, any quantum\nsystem in general; such applications also include quantum fields\ntheories, and local quantum net configurations that are endowed with\neither partially disordered or ‘completely’ ordered structures, as well\nas in the graded, or super–algelbroid extension of these concepts for\nvery massive structures such as stars and black holes treated by quantum\ngravity theories.\n\nA statistical analysis linked to structural symmetry and scattering\ntheory considerations shows that a real paracrystal can be defined by a\nthree dimensional convolution polynomial with a semi-empirically derived\ncomposition law, $*$, [@Hosemann-etal81]. As was shown in\n[@Baianu74; @Baianu78] – supported with computed specific examples –\nseveral systems of convolution can be expressed analytically, thus\nallowing the numerical computation of $X$-ray, or neutron, scattering by\npartially disordered layer lattices via complex Fourier transforms of\none-dimensional structural models using fast digital computers. The\nrange of paracrystal theory applications is however much wider than the\none-dimensional lattices with disorder, thus spanning very diverse\nnon-crystalline systems, from metallic glasses and spin glasses to\nsuperfluids, high-temperature superconductors, and extremely hot\nanisotropic plasmas such as those encountered in controlled nuclear\nfusion (for example, JET) experiments. Other applications – as\npreviously suggested in [@Baianu71] – may also include novel designs of\n‘fuzzy’ quantum machines and quantum computers with extended symmetries\nof quantum state spaces.\n\nConvolution product of groupoids and the convolution algebra of functions\n-------------------------------------------------------------------------\n\nFrom a purely mathematical perspective, Alain Connes introduced the\nconcept of a $C^{\\ast}$-algebra of a (discrete) group (see,\ne.g., [@Connes94]). The underlying vector space is that of complex\nvalued functions with finite support, and the multiplication of the\nalgebra is the fundamental *convolution product* which it is convenient\nfor our purposes to write slightly differently from the common formula\nas:\n\n$$\\begin{gathered}\n(f \\ast g )(z) = \\sum_{xy=z} f(x)g(y),  Eq. 1.1. \\end{gathered}$$\n\nand $\\ast$-operation\n\nEq. 1.2. $$\\begin{gathered}\nf^{\\ast}(x)= \\overline{f(x^{-1})}\\end{gathered}$$\n\nThe more usual expression of these formulas has a sum over the elements\nof a selected group. For topological groups, where the underlying vector\nspace consists of continuous complex valued functions, this product\nrequires the availability of some structure of measure and of measurable\nfunctions, with the sum replaced by an integral. Notice also that this\nalgebra has an identity, the distribution function $\\delta_1$, which has\nvalue 1 on the identity 1 of the group, and has zero value elsewhere.\nCurrently, however, there are several important aspects of quantum\ndynamics left out of the invariant, simplified picture provided by group\nsymmetries and their corresponding representations of quantum operator\nalgebras [@Gilmore2k5]. An alternative approach proposed in\n[@Harrison2k5] employs differential forms to find symmetries. Physicists\ndeal often with such problems in terms of either spontaneous symmetry\nbreaking or approximate symmetries that require underlying assumptions\nor ad-hoc dynamic restrictions that have a phenomenological basisl. A\nwell-studied example of this kind is that of the dynamic Jahn–Teller\neffect and the corresponding ‘theorem’ (Chapter 21 on pp. 807–831, as\nwell as p. 735 of [@Abragam-Bleaney70]) which in its simplest form\nstipulates that [*a quantum state with electronic non-Kramers degeneracy\nmay be unstable against small distortions of the surroundings, that\nwould lower the symmetry of the crystal field and thus lift the\ndegeneracy*]{} (i.e., cause an observable splitting of the corresponding\nenergy levels). This effect occurs in certain paramagnetic ion systems\n[*via*]{} dynamic distortions of the crystal field symmetries around\nparamagnetic or high-spin centers by moving ligands that are\ndiamagnetic. The established physical explanation is that the\nJahn–Teller coupling replaces a purely electronic degeneracy by a\nvibronic degeneracy (of [*exactly the same*]{} symmetry!). The dynamic,\nor spontaneous breaking of crystal field symmetry (for example,\ndistortions of the octahedral or cubic symmetry) results in certain\nsystems in the appearance of doublets of symmetry $\\gamma_3$ or singlets\nof symmetry $\\gamma_1$ or $\\gamma_2$. Such dynamic systems could be\nlocally expressed in terms of symmetry representations of a Lie\nalgebroid, or globally in terms of a special Lie (or Lie–Weinstein)\nsymmetry groupoid representations that can also take into account the\nspin exchange interactions between the Jahn–Teller centers exhibiting\nsuch quantum dynamic effects. Unlike the simple symmetries expressed by\ngroup representations, the latter can accommodate a much wider range of\npossible or approximate symmetries that are indeed characteristic of\nreal, molecular systems with varying crystal field symmetry, as for\nexample around certain transition ions dynamically bound to ligands in\nliquids where motional narrowing becomes very important. This well known\nexample illustrates the importance of the interplay between symmetry and\ndynamics in quantum processes which is undoubtedly involved in many\nother instances including: *quantum chromodynamics (QCD), superfluidity,\nspontaneous symmetry breaking (SSB), quantum gravity and Universe\ndynamics* (i.e., the inflationary Universe), some of which will be\ndiscussed in further detail in Section 5. Physicists deal often with\nsuch problems in terms of either spontaneous symmetry breaking or\napproximate symmetries that require underlying assumptions or ad-hoc\ndynamic restrictions that have a phenomenological basisl. A well-studied\nexample of this kind is that of the dynamic Jahn–Teller effect and the\ncorresponding ‘theorem’ (Chapter 21 on pp. 807–831, as well as p. 735 of\n[@Abragam-Bleaney70]) which in its simplest form stipulates that [*a\nquantum state with electronic non-Kramers degeneracy may be unstable\nagainst small distortions of the surroundings, that would lower the\nsymmetry of the crystal field and thus lift the degeneracy*]{} (i.e.,\ncause an observable splitting of the corresponding energy levels). This\neffect occurs in certain paramagnetic ion systems [*via*]{} dynamic\ndistortions of the crystal field symmetries around paramagnetic or\nhigh-spin centers by moving ligands that are diamagnetic. The\nestablished physical explanation is that the Jahn–Teller coupling\nreplaces a purely electronic degeneracy by a vibronic degeneracy (of\n[*exactly the same*]{} symmetry).\n\nTherefore, the various interactions and interplay between the symmetries\nof quantum operator state space geometry and quantum dynamics at various\nlevels leads to both algebraic and topological structures that are\nvariable and complex, well beyond symmetry groups and well-studied group\nalgebras (such as Lie algebras, see for example [@Gilmore2k5]). A\nunified treatment of quantum phenomena/dynamics and structures may thus\nbecome possible with the help of algebraic topology, non-Abelian\ntreatments; such powerful mathematical tools are capable of revealing\nnovel, fundamental aspects related to extended symmetries and quantum\ndynamics through a detailed analysis of the variable geometry of\n(quantum) operator algebra state spaces. At the center stage of\nnon-Abelian algebraic topology are groupoid and algebroid structures\nwith their internal and external symmetries [@Weinstein96] that allow\none to treat physical spacetime structures and dynamics within an\nunified categorical, higher dimensional algebra\nframework [@Brown-etal2k7]. As already suggested in our recent report\n[@BGB1], the interplay between extended symmetries and dynamics\ngenerates higher dimensional structures of quantized spacetimes that\nexhibit novel properties not found in lower dimensional representations\nof groups, group algebras or Abelian groupoids.\n\nIt is also our intention here to explore new links between several\nimportant but seemingly distinct mathematical approaches to extended\nquantum symmetries that were not considered in previous reports. An\nimportant example example is the general theory of scattering by\npartially ordered, atomic or molecular, structures in terms of\n*paracrystals* and *lattice convolutions* that was formulated in\n[@Hosemann-Bagchi62] using basic techniques of Fourier analysis and\nconvolution products. Further specific applications of the paracrystal\ntheory to $X$-ray scattering, based on computer algorithms, programs and\nexplicit numerical computations, were subsequently developed by the\nfirst author [@Baianu74] for one-dimensional paracrystals, partially\nordered membrane lattices [@Baianu78] and other biological structures\nwith partial structural disorder [@Baianu80]. Such biological\nstructures, ‘quasi-crystals’, and the paracrystals, in general, provide\nrather interesting physical examples of extended symmetries\n(cf. [@Hindeleh-Hosemann88]). Moreover, the quantum inverse scattering\nproblem and the treatment of nonlinear dynamics in ultra-hot plasmas of\nwhite stars and nuclear fusion reactors requires the consideration of\nquantum doubles, or respectively, quantum double groupoids and graded\ndouble algebroid representations [@BGB1].\n\nGroup and Groupoid Representations\n----------------------------------\n\nWhereas group representations of quantum unitary operators are\nextensively employed in standard quantum mechanics, the quantum\napplications of *groupoid representations* are still under development.\nFor example, a description of stochastic quantum mechanics in curved\nspacetime [@Drechsler-Tuckey96] involving a Hilbert bundle is possible\nin terms of groupoid representations which can indeed be defined on such\na Hilbert bundle $(X*H,\\pi)$, but cannot be expressed as the simpler\ngroup representations on a Hilbert space $H$. On the other hand, as in\nthe case of group representations, unitary groupoid representations\ninduce associated $C^*$-algebra representations. In the next subsection\nwe recall some of the basic results concerning groupoid representations\nand their associated groupoid \\*-algebra representations. For further\ndetails and recent results in the mathematical theory of groupoid\nrepresentations one has also available a succint monograph [@BRM2k3]\n(and references cited therein).\n\nLet us consider first the relationships between these mainly algebraic\nconcepts and their extended quantum symmetries. Then we introducer\nseveral extensions of symmetry and algebraic topology in the context of\nlocal quantum physics, ETQFT, spontaneous symmetry breaking, QCD and the\ndevelopment of novel supersymmetry theories of quantum gravity. In this\nrespect one can also take spacetime ‘inhomogeneity’ as a criterion for\nthe comparisons between physical, partial or local, symmetries: on the\none hand, the example of paracrystals reveals thermodynamic disorder\n(entropy) within its own spacetime framework, whereas in spacetime\nitself, whatever the selected model, the inhomogeneity arises through\n(super) gravitational effects. More specifically, in the former case one\nhas the technique of the generalized Fourier–Stieltjes transform (along\nwith convolution and Haar measure), and in view of the latter, we may\ncompare the resulting ‘broken’/paracrystal–type symmetry with that of\nthe supersymmetry predictions for weak gravitational fields, as well as\nwith the spontaneously broken global supersymmetry in the presence of\nintense gravitational fields.\n\nAnother significant extension of quantum symmetries may result from the\nsuperoperator algebra and/or algebroids of Prigogine’s quantum\n*superoperators* which are defined only for irreversible,\ninfinite-dimensional systems [@Prigogine80]. The latter extension is\nalso incompatible with a commutative logic algebra such as the Heyting\nalgebraic logic currently utilized to define topoi [@Goldblatt84].\n\nhttp://planetphysics.us/encyclopedia/QuantumSymmetryBibliography.html\n\n[99]{}\n\nAbragam, A.; Bleaney, B. *Electron paramagnetic resonance of transition\nions.*; Clarendon Press: Oxford, 1970.\n\nAguiar, M.; Andruskiewitsch, N. Representations of matched pairs of\ngroupoids and applications to weak Hopf algebras. [*Contemp. Math.*]{}\n[**2005**]{}, [*376*]{}, 127–173.\n\nAguiar, M.C.O.; Dobrosavljevic, V.; Abrahams, E.; Kotliar G. Critical\nbehavior at Mott–Anderson transition: a TMT-DMFT perspective. *Phys.\nRev. Lett.* [**2009**]{}, [*102*]{}, 156402, 4 pages.\n\nAguiar, M.C.O.; Dobrosavljevic, V.; Abrahams, E.; Kotliar G. Scaling\nbehavior of an Anderson impurity close to the Mott-Anderson transition.\n*Phys. Rev. B* [**2006**]{}, [*73*]{}, 115117, 7 pages.\n\nAlfsen, E.M.; Schultz, F.W. [*Geometry of state spaces of operator\nalgebras.*]{}; Birkhäuser: Boston – Basel – Berlin, 2003.\n\nAltintash, A.A.; Arika, M. The inhomogeneous invariance quantum\nsupergroup of supersymmetry algebra. *Phys. Lett. A* [**2008**]{},\n[*372*]{}, 5955–5958.\n\nAnderson, P.W. Absence of diffusion in certain random lattices. *Phys.\nRev.* [**1958**]{}, [*109*]{}, 1492–1505.\n\nAnderson, P.W. Topology of Glasses and Mictomagnets. [*Lecture presented\nat The Cavendish Laboratory*]{}: Cambridge, UK, 1977.\n\nBaez, J. and Huerta, J. [*An Invitation to Higher Gauge Theory*]{}.\n[**2010**]{}, [*Preprint, March 23, 2010*]{}: Riverside, CA;pp. 60.\nhttp://www.math.ucr.edu/home/baez/invitation.pdf ;\n\nBaez, J. and Schreiber, U. [*Higher Gauge Theory II: 2-Connections*]{}\n(JHEP Preprint), 2008;pp.75.\\\nhttp://math.ucr.edu/home/baez/2conn.pdf.\n\nBaianu, I.C.; Editor. [*Quantum Algebra and Symmetry: Quantum Algebraic\nTopology, Quantum Field Theories and Higher Dimensional Algebra*]{};\nPediaPress GmbH: Mainz, Second Edition, Vol.\\\n[*1*]{}: [*Quantum Algebra, Group Representations and Symmetry*]{};\nVol.[*2*]{}: [*Quantum Algebraic Topology:\\\nQFTs, SUSY, HDA*]{};Vol.[*3*]{}: [*Quantum Logics and Quantum\nBiographies*]{}, December 20, 2010;pp. 1,068.\n\nBaianu, I.C. Categories, functors and automata theory: a novel approach\nto quantum automata through algebraic-topological quantum computation.\nIn [*Proceedings of the 4th Intl. Congress of Logic, Methodology and\nPhilosophy of Science, Bucharest, August – September, 1971*]{};\nUniversity of Bucharest: Bucharest, 1971;pp. 256–257.\n\nBaianu, I.C. *Structural studies of erythrocyte and bacterial\ncytoplasmic membranes by X-ray diffraction and electron microscopy.* PhD\nThesis; Queen Elizabeth College: University of London, 1974.\n\nBaianu, I.C. X-ray scattering by partially disordered membrane systems.\n*Acta Cryst. A*, 1978, [**34**]{}: 751–753.\n\nBaianu, I.C.; Boden, N.; Levine, Y.K.;Lightowlers, D. Dipolar coupling\nbetween groups of three spin-1/2 undergoing hindered reorientation in\nsolids. [*Solid State Comm.*]{} 1978, [**27**]{}, 474–478.\n\nBaianu, I.C. Structural order and partial disorder in biological\nsystems. [*Bull. Math. Biology*]{} [**1980**]{}, [*42*]{}, 464–468.\n\nBaianu, I.C.; Boden N.; Levine Y.K.; Ross S.M. Quasi-quadrupolar NMR\nspin-Echoes in solids containing dipolar coupled methyl groups. [*J.\nPhys. C: Solid State Phys.*]{} [**1978**]{}, [*11*]{}, L37–L41.\n\nBaianu, I.C.; Boden, N.;Lightowlers, D. NMR spin-echo responses of\ndipolar-coupled spin-1/2 triads in solids. [*J. Magnetic Resonance*]{}\n[**1981**]{},[*43*]{}, 101–111.\n\nBaianu, I.C.; Boden, N.; Mortimer, M.; Lightowlers, D. A new approach to\nthe structure of concentrated aqueous electrolyte solutions by pulsed\nN.M.R. [*Chem. Phys. Lett.*]{} [**1978**]{}, [*54*]{}, 169–175.\n\nBaianu, I.C.; Glazebrook J.F.; Brown, R. A non-Abelian, Categorical\nOntology of Spacetimes and Quantum Gravity. [*Axiomathes*]{}\n[**2007**]{}, [*17*]{}, 353–408.\n\nBaianu, I. C.; Glazebrook, J. F.; Brown, R. Algebraic Topology\nFoundations of Supersymmetry and Symmetry Breaking in Quantum Field\nTheory and Quantum Gravity: A Review. [*Sigma*]{} [**2009**]{}, [*5*]{},\n70 pages.\n\nBaianu, I.C.; Rubinson, K.A.; Patterson, J. The observation of\nstructural relaxation in a FeNiPB glass by $X$-ray scattering and\nferromagnetic resonance. [*Phys. Status Solidi A*]{} [**1979**]{},\n[*53*]{}, K133–K135.\n\nBaianu, I.C.; Rubinson, K.A.; Patterson, J. Ferromagnetic resonance and\nspin–wave excitations in metallic glasses. *J. Phys. Chem. Solids*\n[**1979**]{}, [*40*]{}, 940–951.\n\nBais, F. A.; Schroers, B. J.; and Slingerland, J. K. Broken quantum\nsymmetry and confinement phases in planar physics. *Phys. Rev. Lett.*\n**2002**, [*89*]{}, No. 18 (1–4), 181–201.\n\nBall, R.C. Fermions without fermion fields. [*Phys. Rev. Lett.*]{}\n**95** (2005), 176407, 4 pages.\n\nBanica, T. Theorie des representations du groupe quantique compact libre\n$O (n)$. [*C. R. Acad. Sci. Paris.*]{}, [**1996**]{}, [*322*]{}, Serie\nI, 241–244.\n\nBanica, T. Compact Kac algebras and commuting squares. [*J. Funct.\nAnal.*]{} [**2000**]{} ,[*176*]{}, no. 1, 80–99.\n\nBarrett, J.W. Geometrical measurements in three-dimensional quantum\ngravity. In [*Proceedings of the Tenth Oporto Meeting on Geometry,\nTopology and Physics (2001)*]{}, *Internat. J. Modern Phys. A*\n[**2003**]{}, [*18*]{}, October, suppl., 97–113.\n\nBarrett, J.W.; Mackaay, M. Categorical representation of categorical\ngroups. *Theory Appl. Categ.* [**2006**]{},[*16*]{}, 529–557.\n\nBaues, H.J. ; Conduch[é]{}, D. On the tensor algebra of a nonabelian\ngroup and applications. *$K$-Theory* [**1991/92**]{}, [*5*]{} ),\n531–554.\n\nBellissard, J. K-theory of C\\*-algebras in solid state physics.\n*Statistical Mechanics and Field Theory: Mathematical Aspects* ;Dorlas,\nT. C. et al., Editors; Springer Verlag. *Lect. Notes in Physics*,\n[**1986**]{}, [*257*]{}, 99–156.\n\nBichon, J. Algebraic quantum permutation groups. [*Asian-Eur. J.\nMath.*]{} [**2008**]{}, [*1*]{}, no. 1, 1–13. arXiv:0710.1521\n\nBichon, J.; De Rijdt, A.; Vaes, S. Ergodic coactions with large\nmultiplicity and monoidal equivalence of quantum groups. [*Comm. Math.\nPhys.*]{} [**2006**]{}, [*262*]{}, 703–728.\n\nBlaom, A.D. Lie algebroids and Cartan’s method of equivalence. Blok, B.;\nWen X.-G. Many-body systems with non-Abelian statistics. [*Nuclear Phys.\nB*]{} [**1992**]{}, [*374*]{}, Bellissard, J. K-theory of C\\*-algebras\nin solid state physics. *Statistical Mechanics and Field Theory:\nMathematical Aspects* ;Dorlas, T. C. et al., Editors; Springer Verlag.\n*Lect. Notes in Physics*, [**1986**]{}, [*257*]{}, 99–156.\n\nBichon, J. Algebraic quantum permutation groups. [*Asian-Eur. J.\nMath.*]{} [**2008**]{}, [*1*]{}, no. 1, 1–13. arXiv:0710.1521\n\nBichon, J.; De Rijdt, A.; Vaes, S. Ergodic coactions with large\nmultiplicity and monoidal equivalence of quantum groups. [*Comm. Math.\nPhys.*]{} [**2006**]{}, [*262*]{}, 703–728.\n\nBlaom, A.D. Lie algebroids and Cartan’s method of equivalence. Blok, B.;\nWen X.-G. Many-body systems with non-Abelian statistics. [*Nuclear Phys.\nB*]{} [**1992**]{}, [*374*]{}, 615–619.\n\nHindeleh, A.M. and Hosemann, R. Paracrystals representing the physical\nstate of matter. Solid State Phys. 1988, 21, 4155–4170.\n\nHosemann, R.; Vogel W.; Weick, D.; Balta-Calleja, F.J. Novel aspects of\nthe real paracrystal. *Acta Cryst. A* [**1981**]{}, [**376**]{}, 85–91.\n\nIonescu, Th.V.; Parvan, R.; and Baianu, I. Les oscillations ioniques\ndans les cathodes creuses dans un champ magnetique.\n*C.R.Acad.Sci.Paris*. [**1969**]{}, [**270**]{}, 1321–1324; (*paper\ncommunicated by Nobel laureate Louis Neél*).\n\nIsham, C.J.; Butterfield, J. Some possible roles for topos theory in\nquantum theory and quantum gravity. [*Found. Phys.*]{}\n[**2000**]{},[*30*]{}, 1707–1735. Janelidze, G. Precategories and Galois\ntheory. In *Category theory*; Como, 1990. [*Springer Lecture Notes in\nMath.*]{}, Vol. *1488*; Springer: Berlin, 1991;pp. 157–173.\n\nJanelidze, G. Pure Galois theory in categories. *J. Algebra*(1990),\n[**132**]{}, 270–286.\n\nJimbo, M. A $q$-difference analogue of $U_g$ and the Yang–Baxter\nequations. *Lett. Math. Phys.* (1985), [**10**]{},63–69.\n\nJones, V. F. R. Index for Subfactors. *Invetiones Math.* [**1989**]{}\n[**72**]{},1–25. Reprinted in: *New Developments in the Theory of\nKnots.*; World Scientific Publishing: Singapore,1989.\n\nJoyal, A.; Street R. Braided tensor categories. *Adv. Math.* (1995),\n*102*, 20–78.\n\nKac, V. Lie superalgebras. *Adv. Math.* [**1977**]{}, [**26**]{}, 8–96.\n\nKamps, K. H.; Porter, T. A homotopy 2–groupoid from a fibration.\n*Homotopy, Homology and Applications.* (1999), [**1**]{}, 79–93.\n\nKapitsa, P. L. Plasma and the controlled thermonuclear reaction. *The\nNobel Prize lecture in Physics 1978*, in *Nobel Lectures, Physics\n1971–1980*; Editor S. Lundqvist; World Scientific Publishing Co.:\nSingapore, 1992.\n\nKauffman, L. Spin Networks and the Jones Polynomial. *Twistor\nNewsletter, No.29*; Mathematics Institute: Oxford, November 8th, 1989.\n\nKauffman, L. $SL(2)_q$–Spin Networks. *Twistor Newsletter, No.32* ;\nMathematics Institute: Oxford, March 12th, 1989.\n\nKhoroshkin, S.M.; Tolstoy, V.N. Universal $R$-matrix for quantum\nsupergroups. In [*Group Theoretical Methods in Physics*]{}; Moscow,\n1990; [*Lecture Notes in Phys.*]{}, Vol. 382; Springer: Berlin, 1991;pp.\n229–232.\n\nKirilov, A.N.; and Reshetikhin, N. Yu. Representations of the Algebra\n$U_q(sl(2))$, $q$-Orthogonal Polynomials and Invariants of Links.\nReprinted in: [*New Developments in the Theory of Knots.*]{}; Kohno,\nEditor; World Scientific Publishing, 1989.\n\nKlimyk, A. U.; and SchmÃƒÂƒÃ‚Â¼dgen, K. [*Quantum Groups and Their\nRepresentations.*]{}; Springer–Verlag: Berlin, 1997.\n\nKorepin, V. E. Completely integrable models in quasicrystals. [*Commun.\nMath. Phys.*]{} [**1987**]{}, [*110*]{}, 157–171.\n\nKustermans, J.; Vaes, S. The operator algebra approach to quantum\ngroups. [*Proc. Natl. Acad. Sci. USA*]{} [**2000**]{}, [*97*]{},\n547–552.\n\nLambe, L.A.; Radford, D.E. Introduction to the quantum Yang–Baxter\nequation and quantum groups: an algebraic approach. *Mathematics and its\nApplications*, Vol. [*423*]{}; Kluwer Academic Publishers: Dordrecht,\n1997.\n\nLance, E.C. Hilbert $C^*$-modules. A toolkit for operator algebraists.\n[*London Mathematical Society Lecture Note Series*]{}, Vol. [*210*]{};\nCambridge University Press: Cambridge, 1995.\n\nLandsman, N.P. Mathematical topics between classical and quantum\nmechanics. [*Springer Monographs in Mathematics*]{}; Springer-Verlag:\nNew York, 1998.\n\nLandsman, N.P. Compact quantum groupoids, in Quantum Theory and\nSymmetries (Goslar, July 18–22, 1999), Editors H.-D. Doebner et al.,\nWorld Sci. Publ., River Edge, NJ, 2000, 421–431, Landsman, N.P.;\nRamazan, B. Quantization of Poisson algebras associated to Lie\nalgebroids, in [*Proc. Conf. on Groupoids in Physics, Analysis and\nGeometry: Boulder CO, 1999*]{}; Editors: J. Kaminker et al., *Contemp.\nMath.*[**2001**]{},[*282*]{}, 159–192. Lawrence, R.L. Algebra and\nTriangle Relations. In: [*Topological and Geometric Methods in Field\nTheory*]{}; Editors: J. Michelsson and O.Pekonen; World Scientific\nPublishing,1992;pp.429-447. [*J.Pure Appl. Alg.*]{} [**1995**]{},\n[*100*]{}, 245-251.\n\nLee, P.A.; Nagaosa, N.; Wen, X.-G. Doping a Mott insulator: physics of\nhigh temperature superconductivity.[**2004**]{}. Levin, A.; Olshanetsky,\nM. Hamiltonian Algebroids and deformations of complex structures on\nRiemann curves. [**2008**]{}, hep–th/0301078v1.\n\nLevin, M.; Wen, X.-G. Fermions, strings, and gauge fields in lattice\nspin models. [*Phys. Rev. B*]{} [**2003**]{}, [*67*]{}, 245316, 4 pages.\nLevin, M.; Wen, X.-G. Detecting topological order in a ground state wave\nfunction. [*Phys. Rev. Lett.*]{} [**2006**]{}, [*96*]{}, 110405,\n4 pages. Levin M.; Wen, X.-G. Colloquium: photons and electrons as\nemergent phenomena. [*Rev. Modern Phys.*]{} [**2005**]{}, [*77*]{},\n871–879. Levin, M.; Wen, X.-G. Quantum ether: photons and electrons from\na rotor model. [*Phys. Rev. B*]{} [**2006**]{}, [*73*]{}, 035122,\n10 pages. Tsui, D.C.; Allen, S.J. Jr. Mott–Anderson localization in the\ntwo-dimensional band tail of Si inversion layers. [*Phys. Rev. Lett.*]{}\n[**1974**]{}, [*32*]{}, 1200–1203.\n\nTuraev, V.G.; Viro, O.Ya. State sum invariants of 3-manifolds and\nquantum $6j$-symbols. *Topology* (1992), [**31**]{}, 865–902.\n\nvan Kampen, E.H. On the connection between the fundamental groups of\nsome related spaces. *Amer. J. Math.* (1933), [**55**]{}, 261–267.\n\nVárilly, J.C. An introduction to noncommutative geometry. [*EMS Series\nof Lectures in Mathematics*]{}; European Mathematical Society (EMS):\nZürich, 2006.\n\nWeinberg, S. [*The quantum theory of fields., Vol. I. Foundations and\nVol. II. Modern applications.*]{}; Cambridge University Press:\nCambridge, 1996-1997.\n\nWeinberg, S. [*The quantum theory of fields. Vol. III.\nSupersymmetry*]{}; Cambridge University Press: Cambridge, 2005.\n\nWeinstein, A. Groupoids: unifying internal and external symmetry. A tour\nthrough some examples.[*Notices Amer. Math. Soc.*]{} [**1996**]{},\n[*43*]{}, 744–752. Wen, X.-G. Non-Abelian statistics in the fractional\nquantum Hall states. [*Phys. Rev. Lett.*]{} [**1991**]{}, [*66*]{},\n802–805.\n\nWen, X.-G. Projective construction of non-Abelian quantum Hall liquids.\n[*Phys. Rev. B*]{} [**1999**]{}, [*60*]{}, 8827, 4 pages. Wen, X.-G.\nQuantum order from string-net condensations and origin of light and\nmassless fermions.\\\n[*Phys. Rev. D*]{} [**2003**]{}, [*68*]{}, 024501, 25 pages. Wen,\nX.-G.[*Quantum field theory of many–body systems – from the origin of\nsound to an origin of\\\nlight and electrons*]{}; Oxford University Press: Oxford, 2004.\n\nWess, J.; Bagger, J. Supersymmetry and supergravity. [*Princeton Series\nin Physics*]{}; Princeton University Press: Princeton, N.J., 1983.\n\nWestman, J.J. Harmonic analysis on groupoids. [*Pacific J. Math.*]{}\n[**1968**]{}, [*27*]{}, 621–632.\n\nWestman, J.J. [*Groupoid theory in algebra, topology and analysis*]{};\nUniversity of California at Irvine, 1971.\n\nWickramasekara, S.; Bohm, A. Symmetry representations in the rigged\nHilbert space formulation of quantum mechanics. [*J. Phys. A: Math.\nGen.*]{} [**2002**]{}, [*35*]{}, 807–829.\n\nWightman, A.S. Quantum field theory in terms of vacuum expectation\nvalues. [*Phys. Rev.*]{} [**1956**]{}, [*101*]{}, 860–866.\n\nWightman, A.S., Hilbert’s sixth problem: mathematical treatment of the\naxioms of physics. In [*Mathematical Developments Arising from Hilbert\nProblems : Proc. Sympos. Pure Math.*]{}, Northern Illinois Univ., De\nKalb, Ill., 1974. [*Amer. Math. Soc.*]{}: Providence, R.I., 1976;pp.\n147–240.\n\nWightman, A.S.; Gärding, L. Fields as operator-valued distributions in\nrelativistic quantum theory. [*Ark. Fys.*]{} [**1964**]{}, [*28*]{},\n129–184.\n\nWigner, E. P. *Gruppentheorie*; Friedrich Vieweg und Sohn: Braunschweig,\nGermany, 1931;pp. 251-254. [*Group Theory*]{}; Academic Press Inc.: New\nYork, 1959;pp. 233-236.\n\nWigner, E. P. On unitary representations of the inhomogeneous Lorentz\ngroup. [*Annals of Mathematics*]{} [**1939**]{}, [*40*]{} (1),\n149ÃƒÂ¢Ã‚Â€Ã‚Â“204. doi:10.2307/1968551.\n\nWitten, E. Quantum field theory and the Jones polynomial. [*Comm. Math.\nPhys.*]{} [**1989**]{}, [*121*]{}, 351–355.\n\nWitten, E. Anti de Sitter space and holography. [*Adv. Theor. Math.\nPhys.*]{} [**1998**]{},[*2*]{}, 253–291. Wood, E.E. Reconstruction\nTheorem for Groupoids and Principal Fiber Bundles. [*Intl. J. Theor.\nPhysics*]{} [*1997*]{} [*36*]{} (5), 1253-1267. DOI: 10.1007/BF02435815.\n\nWoronowicz, S.L. Twisted $SU(2)$ group. An example of a non-commutative\ndifferential calculus. *Publ. Res. Inst. Math. Sci.* (1987), [**23**]{},\n117–181.\n\nWoronowicz, S. L. Compact quantum groups. In *Quantum Symmetries.* Les\nHouches Summer School–1995, Session LXIV; Editors: A. Connes; K.\nGawedzki; J. Zinn-Justin; Elsevier Science: Amsterdam,1998;pp. 845–884.\n\nXu, P. Quantum groupoids and deformation quantization. *C. R. Acad. Sci.\nParis Sér. I Math.* (1998), [**326**]{}, 289–294. Yang, C.N.; Mills,\nR.L. Conservation of isotopic spin and isotopic gauge invariance.\n[*Phys. Rev.*]{} [**1954**]{}, [*96*]{}, 191–195.\n\nYang, C.N. Concept of Off-Diagonal Long-Range Order and the Quantum\nPhases of Liquid He and of Superconductors.[*Rev. Mod. Phys.*]{}\n[**1962**]{}, [*34*]{}, 694ÃƒÂ¢Ã‚Â€Ã‚Â“704.\n\nYetter, D.N. TQFTs from homotopy 2-types. *J. Knot Theory Ramifications*\n[**1993**]{}, [*2*]{}, 113–123.\n\nYpma, F. K-theoretic gap labelling for quasicrystals, [*Contemp.\nMath.*]{}[**2007**]{}, [*434*]{}, 247–255; *Amer. Math. Soc.*:\nProvidence, RI,.\n\nYpma, F. [*Quasicrystals, C\\*-algebras and K-theory*]{}. Msc. Thesis.\n[**2004**]{}: University of Amsterdam.\n\nZhang, R.B. Invariants of the quantum supergroup $U_q(gl(m/1))$. [*J.\nPhys. A: Math. Gen.*]{} [**1991**]{}, [*24*]{}, L1327–L1332.\n\nZhang, Y.-Z.; Gould, M.D. Quasi-Hopf superalgebras and elliptic quantum\nsupergroups, *J. Math. Phys.* [**1999**]{}, [*40*]{}, 5264–5282,",
  "language": "INFORMAL",
  "phrase": "Quantum Symmetry",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/QuantumSymmetry"
    }
  ],
  "indexable": true
}