{
  "alternatePhrases": [
    "homomorphism",
    "monomorphism",
    "epimorphism",
    "endomorphism",
    "automorphism"
  ],
  "definition": "Often in a family of algebraic structures, those structures are\ngenerated by certain elements, and subject to certain relations. One\noften refers to functions between structures which are said to preserve\nthose relations. These functions are typically called\n[*homomorphisms*]{}.\n\nThis situation is generalized by category theory, where homomorphisms\nare regarded abstractly, not necessarily being maps between sets. For\nmore information on category theory, please see its entry. In this\nentry, we only mention category theory in passing and references to\ncategory theory safely may be ignored by the reader not familiar with\nthe subject.\n\nAn example is the category of groups. Suppose that $f:A \\to B$ is a\nfunction between two groups. We say that $f$ is a group homomorphism if:\n\n\\(a) the binary operator is preserved:\n$f(a_1 \\cdot a_2) = f(a_1) \\cdot f(a_2)$ for all $a_1, a_2 \\in A$;\n\n\\(b) the identity element is preserved: $f(e_A) = e_B$;\n\n\\(c) inverses of elements are preserved: $f(a^{-1}) = [f(a)]^{-1}$ for\nall $a \\in A$.\n\nOne can define similar natural concepts of homomorphisms for other\nalgebraic structures, giving us ring homomorphisms, module\nhomomorphisms, and a host of others.\n\nWe give special names to homomorphisms when their functions have\ninteresting properties.\n\nIf a homomorphism is an injective function (i.e. one-to-one), then we\nsay that it is a [*monomorphism*]{}. These are typically monic in their\ncategory.\n\nIf a homomorphism is an surjective function (i.e. onto), then we say\nthat it is an [*epimorphism*]{}. These are typically epic in their\ncategory. Sometimes the term “epimorphism” is used as a synonym for\n“epic” — in cases such as the term “ring epimorphism”, this usage can\nlead to ambiguity, so one needs to check the author’s usage.\n\nIf a homomorphism has an inverse, then we say that it is an\n[*isomorphism*]{}. Often, but not always, this is the same as requiring\nthat the homomorphism be a bijective function (i.e. both one-to-one and\nonto),\n\nIf the domain of a homomorphism is the same as its codomain (e.g. a\nhomomorphism $f:A \\to A$), then we say that it is an [*endomorphism*]{}.\nWe often denote the collection of endomorphisms on $A$ as\n${\\rm End}(A)$.\n\nIf a homomorphism is both an endomorphism and an isomorphism, then we\nsay that it is an [*automorphism*]{}. We often denote the collection of\nautomorphisms on $A$ as ${\\rm Aut}(A)$.",
  "language": "INFORMAL",
  "phrase": "Types Of Homomorphisms",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/TypesOfHomomorphisms"
    }
  ],
  "indexable": true
}