{
  "alternatePhrases": [
    "Bonhoeffer - van der Pol model",
    "BVP",
    "FitzHugh-Nagumo model"
  ],
  "definition": "The History\n===========\n\nThe FitzHugh-Nagumo equation is a simplification of the Hodgkin-Huxley\nmodel devised in 1952. The Hodgkin-Huxley has four variables and the\nFitzHugh-Nagumo equation is a reduction of that model. The reduction is\nfrom four variables to two variables where phase plane techniques may be\nused for the analysis of the model. The variables kept in the reduction\nof the model are the *excitable variable* and the *recovery variable*\nwhich are characterized as being the fast and slow variables\nrespectively. The FitzHugh-Nagumo model was called, by FitzHugh, the\n*Bonhoeffer - van der Pol model (BVP)*. FitzHugh explains that the BVP\nwas devised in the same way as the van der Pol equation “Its solution\ndoes not, to be sure, give an accurate fit to curves obtained from many\nphysical oscillators. The equation was intended rather to represent the\nqualitative properties of a wide class of such oscillators, its\nalgebraic form being chosen to be as simple as possible”.[@FR] The name\nof Nagumo is added to FitzHugh by being able to represent the BVP model\nas an electrical device [@NAY]. The BVP model “consists of three\ncomponents, a capacitor representing the membrane capacitance, a\nnonlinear current-voltage device for the fast current, and a resistor,\ninductor, and battery in series for the recovery current.”[@KS]\n\nThe Application\n===============\n\nThe application of the FitzHugh-Nagumo equation is to model the same\nphenomenon as the Hodgkin-Huxley model. The phenomenon that is modelled\nis the control of the electrical potential across cell membrane. This\ncontrol is done by the change of flow of the ionic channels of the cell\nmembrane. This results in the change in potential which is used to send\nelectrical signals between cells. This is readily observed in muscle and\nother excitable cells. For example the FitzHugh-Nagumo equation is used\nto model electrical waves of the heart.[@KS]\n\nThe Model\n=========\n\nThe *FitzHugh-Nagumo model* is defined by the following system of\ndifferential equations:\n\n$$\\begin{aligned}\n\\dot{x} & = & \\epsilon(y+x-x^3+I)\\\\\n\\dot{y} & = & \\frac{-1}{\\epsilon}(x-\\beta+\\gamma y)\\end{aligned}$$\n\nwhere $1-2\\gamma/3<\\beta<1$, $0<\\gamma<1$, and $\\gamma<\\epsilon^2$.[@FR]\nThere are many equivalent forms of the system, the more popular ones can\nbe found in [@RGG] with conversion for the different forms. A more\ngeneral FitzHugh-Nagumo model is defined by the following system of\ndifferential equations:\n\n$$\\begin{aligned}\n\\epsilon\\dot{x} & = & f(x,y) + I\\\\\n\\dot{y} & = & g(x,y)\\end{aligned}$$\n\nwhere $f(x,y)=0$ resembles a cubic shape and $g(x,y)=0$ only has one\nintersection with $f(x,y)=0$.[@KS] In the above two formulas the $I$ is\nthe external current applied to the system. The following system is\nknown as the *spatially distributed FitzHugh-Nagumo model* where\ndiffusion is added to the general FitzHugh-Nagumo model.\n\n$$\\begin{aligned}\n\\epsilon\\frac{\\partial v}{\\partial t} & = & \\epsilon^2\\frac{\\partial^2 v}{\\partial x^2}+f(v,w)+I\\\\\n\\frac{\\partial w}{\\partial t} & = & g(v,w)\\end{aligned}$$\n\nThe above model has different travelling waves depending on the choice\nof parameter of the system.\n\n[20]{}\n\nFitzHugh, Richard: Impulses and Physiological States in Theoretical\nModels of Nerve Membrane. Biophysical Journal, Volume 1, 1961.\n\nHale, Jack H. & Kocak, Hüseyin: Dynamics and Bifurcations.\nSpringer-Verlag, New York, 1991.\n\nIzhikevich, Eugene M., FitzHugh, Richard: . , 2006.\n\nKeener, James & Sneyd, James: Mathematical Physiology. Springer-Verlag,\nNew York, 1998.\n\nNagumo, J., S. Arimoto, and S. Yoshizawa: An active pulse transmission\nline simulating nerve axon, Proc IRE. 50: 2061-2070, 1964.\n\nRocsoreanu, C., Georgescu, A. & Giurgiteanu, N.: The FitzHugh-Nagumo\nModel: Bifurcation and Dynamics. Kluwer Academic Publishers, Boston,\n2000.",
  "language": "INFORMAL",
  "phrase": "Fitzhugh-Nagumo Equation",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/FitzHughNagumoEquation"
    }
  ],
  "indexable": true
}