{
  "alternatePhrases": [
    "non-abelian group",
    "noncommutative group",
    "non-commutative group"
  ],
  "definition": "A group is said to be *nonabelian*, or *noncommutative*, if has elements\nwhich do not commute, that is, if there exist $a$ and $b$ in the group\nsuch that $ab \\neq ba$. Equivalently, a group is nonabelian if there\nexist $a$ and $b$ in the group such that the commutator $[a,b]$ is not\nequal to the identity of the group. There exist many natural nonabelian\ngroups, with order as small as $6$. While any group for which the square\nmap is a homomorphism is abelian, there exist nonabelian groups of order\nas small as $27$ for which the cube map is a homomorphism.\n\nIn the first section we give a way to visualize the group of rotations\nof a sphere and prove that it is nonabelian. This should be readable by\nan undergraduate student in algebra. In the second section, we discuss\ngroups admitting a cube map and show that there are small nonabelian\nexamples. The second section is somewhat more technical than the first\nand will require more facility with group theory, especially working\nwith finitely presented groups and the commutator calculus.\n\nConcrete examples of nonabelian groups\n======================================\n\nAlthough most number systems we use are abelian by design, there exist\nquite natural nonabelian groups. Perhaps the simplest example to\nvisualize is given by the group of rotations of a sphere.[^1] We can\ncompose two rotations by performing them in sequence, and we can invert\na rotation by rotating in the opposite direction, so rotations do form a\ngroup. To follow what rotation does to the sphere, imagine that inside\nis suspended a copy of Marshall Hall’s classic text [*The Theory of\nGroups*]{}. We will keep track of three pieces of information, namely,\nthe directions that the front cover, the spine, and the bottom of the\nbook face. When the sphere is in the identity position, the front cover\nfaces the reader, the spine faces the left, and the bottom of the book\nis oriented downward.\n\nIn preparation for verifying that the group is not abelian, we define\ntwo rotations, $F$ and $R$. First, let $F$ (for “flip”) be the rotation\nwhich takes the point at the very top of the sphere and moves it forward\nthrough an angle of $\\pi$. For example, if we start with the sphere in\nthe identity position and then perform $F$, the front cover will face\naway from the reader, the spine will remain to the left, and the bottom\nof the book will be oriented upward. Second, let $R$ (for “rotate”) be\nthe rotation which takes the point at the very top of the sphere and\nmoves it left through an angle of $\\frac{\\pi}{2}$. If we start with the\nsphere in the identity position and then perform $R$, the front cover\nwill continue to face the reader, the spine will face downward, and the\nbottom of the book will be oriented to the right.\n\nWe now verify that the group of rotations is not abelian. If we start\nwith the sphere in the identity position and perform $FR$, that is,\nfirst $F$, then $R$, then the front cover will face away from the\nreader, the spine will face downward, and the bottom will be oriented to\nthe left. On the other hand, if we start with the sphere in the identity\nposition and perform $RF$, then while the front cover will face away\nfrom the reader, the spine will face *upward*, and the bottom will be\noriented to the *right*. So it matters in which order we perform $F$ and\n$R$, that is, $FR \\ne RF$, proving that the group is not abelian.\n\nSince every rotation in three-dimensional Euclidean space can be\ndecomposed as a finite sequence of reflections and rotations in the\nEuclidean plane, one might hope that we can find finite nonabelian\ngroups arising from objects in the plane, and in fact we can. For each\nregular polygon, there is an associated group, the dihedral group\n$D_{2n}$, which is the group of symmetries of the polygon. (Here $n$\ndenotes the number of the sides of the polygon, and $2n$ gives the\nnumber of elements of the group of symmetries.) It is generated by two\nelements, $F$ (for “flip”) and $R$ (for “rotate”). These elements can be\ndefined by analogy with the $F$ and $R$ above; for full details, consult\nthe entry “”, where flips are labelled instead by $M$ (for “mirror”). If\n$n\\ge 3$ (so we are dealing with an actual polygon here), it is possible\nto show that $FR \\ne RF$. Moreover, every group with order $1$, $p$, or\n$p^2$, where $p$ is a prime, is abelian. Thus the smallest possible\norder for a nonabelian group is $6$. But $D_{2\\cdot 3}$ has $6$ elements\nand is nonabelian, so it is the smallest possible nonabelian group.\n\nSmall nonabelian groups admitting a cube map\n============================================\n\nWhen we say that a group admits $x\\mapsto x^n$, we mean that the\nfunction $\\varphi$ defined on the group by the formula $\\varphi(x) =\nx^n$ is a homomorphism, that is, that is, that for any $x$ and $y$ in\nthe group, $$(xy)^n = \\varphi(xy) = \\varphi(x)\\varphi(y) = x^ny^n.$$ If\na group admits $x\\mapsto x^2$, then for any $x$ and $y$ we have that\n$(xy)^2 = x^2y^2$. Multiplying on the left by $x^{-1}$ and on the right\nby $y^{-1}$ yields the identity $yx = xy$. Thus all such groups are\nabelian. Moreover, the generalized commutativity and associativity laws\nfor abelian groups imply that an abelian group admits all maps\n$x\\mapsto x^n$. It is therefore reasonable to wonder whether the\nconverse holds. In fact it is possible for a nonabelian group to admit\n$x\\mapsto x^3$. The smallest order for such a group is $27$. It is\nbeyond the scope of this entry to prove that $27$ is the smallest\npossible order, but we will give an explicit example.\n\nLet $G$ be the group with presentation\n$$G = \\langle a, b, c \\mid a^3, b^3, c^3, [a,c], [b,c], [a,b]c \\rangle.$$\nThis can be realized concretely as the group of upper-triangular\nmatrices over $\\mathbb{Z}/3\\mathbb{Z}$ with $1$s on the diagonal, but\nfor simplicity we shall work directly with the presentation.\n\nThe first three relators tell us that each generator of the group has\norder $3$. The next two tell us that $c$ is central — since it commutes\nwith the other two generators and commutes with itself, it must\ntherefore commute with everything. The final relator is perhaps the most\ninteresting. We can interpret it as the rewrite rule $$ba \\mapsto abc,$$\nthat is, $$\\text{``when $b$ moves past $a$ it turns into $bc$.''}$$ Thus\ngiven an element of $G$ we can always write it in the normal form\n$a^j b^k c^{\\ell}$, where $0\\le j, k, \\ell<3$, and all such elements are\ndistinct. This proves that the cardinality of $G$ is $27$. Moreover, we\nalso observe that $$ba = abc \\ne ab,$$ so $G$ is not abelian.\n\nIt remains to check that $G$ admits the cube map. We will prove the\nsimpler statement that $G$ has exponent $3$. Given $x$ in $G$, we first\nnormalize it, so $x = a^j b^k c^{\\ell}$. Since $c$ is in the center of\n$G$, $$x^3 = (a^j b^k)^3 c^{3\\ell} = (a^j b^k)^3 = a^j(b^k a^j)^2b^k.$$\n\nTo normalize the word $b^k a^j$, we push each $b$ past all of the $a$s.\nSince pushing $b$ past a *single* $a$ turns it into $bc$, pushing it\npast $a^j$ turns it into $bc^j$, that is,\n$$b^k a^j = b^{k-1} a^j b c^j.$$ By induction it follows that\n$$b^k a^j = a^j b^k c^{jk}.$$ Applying this result to $x^3$, we get that\n$$x^3 = a^j(a^j b^k c^{jk})^2 b^k = a^{2j} (b^ka^j) b^{2k} c^{2jk} = a^{3j} b^{3k} c^{3jk} = 1.$$\nSince $x^3$ is trivial for any $x$, it follows that $G$ admits the cube\nmap.\n\nThe other nonabelian group of order $27$ has exponent $9$ and also\nadmits the cube map. This will be described in an attached entry.\n\n[^1]: The treatment we give here is informal. For a more formal\n    treatment of the group of rotations, consult the entries “” and “”.",
  "language": "INFORMAL",
  "phrase": "Nonabelian Group",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/NonabelianGroup"
    }
  ],
  "indexable": true
}