{
  "alternatePhrases": [
    "hekat division"
  ],
  "definition": "INTRODUCTION\n\nThe Akhmim Wooden Tablet dates to the 12th dynasty, circa 1950 BCE. The\nwooden tablet is 46.5 x 26 cm and is housed in the main Cairo Museum.\nThe text mentions 27 servant names, an unknown king’s name (citing the\n8th year of his reign), and five binary multiplications of a hekat unity\n(a volume unit) by 1/3, 1/7, 1/11, 1/11, 1/13 and by implication 1/n.\nOne \\[Q/64 + 5R/n) calculation 1/3 was repeated four times. The\nremaining four 1/n calculations that scaled (64/64) were repeated at\nleast once. Proofs returned the five two-part \\[Q/64 + (5R/n)ro\\]\nanswers to the initial (64/64) scaling parameter by multiplying each\nanswer by the initial 3, 7, 10, 11 or 13 integer.\n\nThe document was reported in 1901 b y Georges Daressy. Daressy analyzed\nand published in 1906 by indicating five multiplications of a hekat by\n1/3, 1/7, 1/10, 1/11 and 1/13. Unit fraction answers were recorded in\nbinary quotients and 1/320 of a hekat (ro) remainders. Daressy validated\nexact scribal proofs for 1/3, 1/7 and 1/10, but failed to prove\nexactness for the 1/11 and 1/13 cases.\n\nDaressy discussed scribal typos and scribal errors. Daressy muddled the\n1/11 and 1/13 multiplications and proofs in acubit context though\nsuspected all five multiplications were intended to be exact. Daressy’s\ndata stressed cubits rather than hekats a concern for Peet (1923).\nDaressy’s views were consistent with an unscaled binary fraction\nremainder. Peet did identify the ro remainder aspect of the AWT but not\nin the precise scribal scaled context. Daressy’s approach analyzed AWT\nbinary fractions and scaled remainders as single statements a point of\nview that is accepted today.\n\nGillings in 1972, and others, published 1/10th of a hekat (a volume\nunit) named hin, hinu, or henu scaled a linear cubit to a\ncubit-cubit-cubit.\n\nExactness of all five scribal answers and proofs were published in 2001\nby Hana Vymazalova, a Charles U., Prague, graduate student within hekat\nunity (64/64) context.\n\nGillings, Peet, Chace and other 20th century schgolars had not mentioned\na possible hekat unity (64/64) multiplied by 1/10 such that 1/320 of a\nhekat became a ro remainder by these steps, facts implied (but not cited\nby Vymazalova):\n\n(64/64)hekat times (1/10) = (6/64 + 4/640)hekat =\n\n(4 + 2)/64 hekat + 20/10 ro =\n\n(1/16 + 1/32)hekat + 2ro\n\nNote that the (4/640) hekat step became a ro unit by multiplying (4/640)\nby (5/5) = 20/10 ro\n\nThat is, 1/10 of a hekat was equivalent to 1 hin. The 1/10 of a hekat\nfact was discussed by Ahmes in 1650 BCE in RMP 81.\n\nAhmes, in RMP 81 converted 29 binary hekat quotients + scaled ro\nremainders to hin units that followed the AWT’s theoretical statement:\n\n(64/64) times 1/n = Q/64 + (5R/n)ro\n\nwith Q = Quotient, R = Remainder, and\n\ndivisor n was limited to the range 1/64 &lt; n &lt; 64.\n\nThe RMP included one part hekat statements, a point stressed by Peet.\nFor example: 10/n hin meant a hekat was scaled to a 1/10 unit. Peet\nincompletely discussed the AWT’s binary fractions statements as a one\npart statement, which it surely was not. Peet reported 1/3, 1/7, 1/10,\n1/11, 1/13 multiplication aspects of the problems and stressed the 1/320\nro unit by discussing one part statements.\n\nPeet did not report the (64/64) hekat unity that allowed five binary\nquotient plus a 1/320 remainder answers and five proofs to be recorded.\nPeet under reported the scribal context.\n\nUpdated translations of the AWT published in 2006 and 2011 correct\nDaressy’ 1/11 and 1/11 cases as division problems by complete beginning,\nmiddle and ending hekat statements that merge into 1/320 remainder\nanswers:\n\na\\. (64/64)/11 hekat = (5/64 + 9/704)hekat = (4 + 1)/64 hekat + (45/11)ro\n= (1/16 + 1/64)hekat + (4 + 1/11)ro\n\nb\\. (64/64)/13 hekat = (4/64 + 12/832)hekat = 4/64 hekat + (60/13)ro =\n1/16 hekat + (4 + 8/13)ro with 8/13 scaled by LCM 2 to 16/26 =\n\n(13 + 2 + 1)/26 = 1/2 + 1/13 + 1/26 recorded as: (64/64)/13 hekat = 1/16\nhekat + (4 + 1/2 + 1/13 + 1/26)ro.\n\nIt took 95 years for Vymazalova to correctly report the proof context of\nDaressy’s 1906 AWT hekat partitioning story. Hana Vymazalova reported\nthe proof side of the five two-part statements that returned (64/64)\nfive times. Vymazalova did not challenge Peet’s view of the five AWT\nbinary quotient and 1/320 remainder. Vymazalova only published scribal\nduplation calculations without mentioning how and where the (64/64)\nhekat unity was first introduced by the scribe.\n\nDaressy’s 1906 review of the AWT’s data surely garbled the 1/11 and 1/13\nproofs by not identifying the (64/64) aspect of the text. In 2002 Hana\nVymazalova corrected Daressy’s 1/11 and 1/13 oversights by pointing out\nthat (64/64) was returned five times in proofs. Vymazalova’s two\ncorrections were updated and published in 2006 and 2011 that showed a\nlarger scribal context, that all five initial calculations began with\nthe hekat unity (64/64).\n\nThe AWT reported a well-defined system of weights and measures\narithmetic from an Old Kingdom inexact system to an exact Middle Kingdom\nrational numberscaled by LCMs system.\n\nThe meta context in which Peet properly identified the 1/320 ro aspect\nof the AWT was missed until Hana Vyamazalova’s 2002 paper. Scholars for\nalmost 100 years did not connect the AWT partition method to RMP 81 and\n29 data points, and over 30 additional two-part partitions of a (64/64)\nhekat unity discussed in the RMP.\n\nCONTENTS OF THE AWT\n\nTranslated to our modern base 10, the AWT simply states that unity\n(64/64th) was divided by 3, 7, 10, 11 and 13 following a general rule of\ndivision, as is clearly read by:\n\n(64/64)/n = Q/64 + (5R/n)ro\n\nwith Q = quotient, and R = Remainder\n\nwriting the initial problem in modern base 10 fractions.\n\nMiddle Kingdom scribes used this pattern, by easily writing the quotient\nterm into a Horus-Eye series, for example (64/64)/3 = 21/64 (Q). Several\nscholars have seen this portion, but become foggy with respect to the\nremainder, one (1) in the case of n = 3.\n\nThe 2nd portion, the handling of the remainder, has been muddled and\nmisreported by scholars. One reason can be excused since R/64n) was\n’encoded’ by scribes that replaced 1/64 of a hekat with equivalent 1/320\nof a hekat remainders in an unusual style. The style allowed student\nscribes to create quotient (Q) and scaled reminders (R) as Q/64 +\n(5R/n)ro answers as one number.\n\nScholars did not see the scaled aspect of the (5R/n)ro remainders, nor\nthe vivid two-part number aspect of the notation that consistently\nreported\n\n(64/64) times 1/n = \\[Q/64 + (5R/n)ro\\]\n\nA few scholars openly pondered scribal issues when reporting the AWT and\nRMP two-part quotient and remainder data. Two 1987 scholars,\nRobins-Shute reported 100 hekat times 1/70 (one of ten RMP 47 problems)\nwithout commenting on the two-part \\[Q/64 + (5R/70)ro\\] notation in a\nRMP book. Robins-Shute fairly reported products and remainders contained\nin the scribal intermediate data, a form of scratching of heads that did\nnot report the beginning of the problem (6400/64) times 1/70, nor the\nfinal form of the answer \\[(91/64)hekat + (150/70)ro\\].\n\nRobins-Shute reported a personalized version of (64 + 16 + 8 + 2 + 1)/64\n+ (150/70)ro answer by reporting\n\n\\[(1 + 1/4 + 1/8 + 1/32 + 1/64)hekat + (2 + 1/7)ro.\n\nAhmes, for fun reported the remainder as \\[2 + (1/7)(6/6)\\]ro = (2 +\n(6/42))ro = 2 + (3 + 2 + 1)/42 = (2 + 1/14 + 1/21 + 1/42)ro, an answer\nthat the EMLR scribe included on line 14 300 years earlier. Robins-Shute\nsaw the correct scaled ro remainder but wished to report the simpler (2\n+ 1/7)ro version for a personal reason.\n\nChace, writing in a classic 1927 RMP book reported RMP 83 that discussed\nthree related data sets. Today it is clear that (64/64) was divided by n\n= 6, 20, and 40. The bird-feeding rates made little sense to Chace,\nsuggesting that Ahmes had garbled the data. Chace mentioned that Ahmes\nleft no clues to on this matter, a personal point that was obviously\nincorrect, when the AWT is considered. All Middle Kingdom scribes used\nthe methods. The Kahun Papyrus and Moscow Mathematical Papyrus also used\nthe notation.\n\nMiddle Kingdom scribes created and applied\n\n\\[Q/64 +(5R/n)ro\\] statements, over 60 times that followed the same\ntheoretical notation.\n\nFor none mathematicians, it may be best to refer to a modern base 10\nversion of the 4,000 year old arithmetic notation (shorthand), and\nponder the information for few days. After sleeping on the data, attempt\nto write in the ancient 2-part notation. That is, think in modern base\n10 for a few days, before trying to think and write as a 4,000 year old\nscribe.\n\nThere are four trees being discussed here, each suggesting confusion,\nunless care is taken to locate the forest of formulas at work. The tree\nare: (1) the Horus-Eye notation, followed by a hekat, written in the\nfirst half of the expression, (2) Hieratic Egyptian fraction notion,\nfollowed by ro in the second half of the expression, (3) the Egyptian\nfraction series represented only the rational number (5\\*R/n), noting n\nin the denominator, allowed the remainder to grow to any size, thereby\nallowed an exact computation, and (4) the word ro, as 1/320th was\nfactored from the remainder term.\n\nClearly ro was an element in a larger expression. Ro was a common\ndivisor that was used to add the Horus-Eye and Egyptian fraction series\ntogether, that also allowed a proof to be quickly recorded. Five proofs\nwere cited in the AWT. Each proof returned (64/64), meant that (64/64)\nwas the initial term in the problem.\n\nIt is recommended that novice readers allow one or two of the four trees\nthat you meet to be confused. Clear up the confusion by looking for a\nformula that define a forest that includes all four trees. Then and only\nread and work with the AWT data.\n\nThe ancient scribal notation began with (64/64) times 1/n problems. Each\nanswer was proved by multiplying two-part answers by n (inverse of 1/n,\nthereby defining our modern invert and multiply division rule). Proofs\nended by returning (64/64), after which a Q.E.D. could have been written\n(has a Latin scribe completed the task).\n\nHave patience. Each of the four ideas (trees) are simple. Summing them\nup to one ancient tool may cause problems for certain readers. Please\navoid shortcuts, especially the ones that Ahmes himself practiced. Only\npractice Ahmes’ shortcuts when you have discovered the formula hidden in\nthis class of Middle Kingdom arithmetic.\n\nPeet, Gillings and other scholars tended not to take the needed time.\nScholars often jumped into reading scribal shortcuts without\nunderstanding certain hidden formulas, in this case (64/64)/n = \\[Q/64 +\n(5R/n)ro\\].\n\nBegin at the beginning of each of the five AWT problems, as any scribal\nproblem must be parsed. Compare the beginning, middle and ending of each\nproblem. For example to obtain 45 additional AWT examples, consider RMP\n47, 81, and 83. Work each of the 45 problems by following any of the\nfive AWT patterns. Do your own work, every step of the way.\n\nYou will be rewarded. Spend the necessary time to work through a dozen\nor more of this class of problem. You will be rewarded with a scribal\nskill that serious scholars in the 1920s, Robins-Shute (1987) and\nClagett (1999) did not understand.\n\nBACKGROUND\n\nThomas E. Peet, 1923, partially repeated an analysis of the AWT by\nshowing several connections between Egyptian math and the practical\nexperiences of an ancient Egyptian scribe that used two numeration\nsystems, Horus-Eye and the Egyptian fractions (cited in the RMP). Peet\nmuddled where one system ended and where the other system began by only\ndetailing additive aspects of the two numeration systems, missing the\nexact Egyptian division features using 5ro as a partitioning idea, using\nnumerators and denominators = 320 in an interesting way. Peet also\nprematurely concluded that the Egyptian division was only an inverse of\nthe Egyptian multiplication operation.\n\nPeet did not directly discuss Egyptian division, as a general operation,\nas confirmed by the AWT examples. However, contrary to Gillings and\nRobins-Shute, Peet did seem to compute with 5ro, 4ro, 3ro, 2 ro and ro,\nbut only from a limited view of the AWT student. Peet was slightly\nmyopic, asking few meta questions, such as: were all of the student’s\ndivisions required to be exact? More importantly, no comparisons of\nPeet’s view of the AWT were made to the RMP and its 84 problems. At\nleast ten RMP problems, 36-43, and 81-82, have been misread with respect\nto ro, suggesting it was a weights and measures unit. Ro was actually\nconnected to a generalized partitioning role, as closely related to\nother exact partitioning methods cited in the RMP, and other Middle\nKingdom mathematical texts.\n\nScholars are free to explore Egyptian mathematics that meet a range of\nstandards. One of the Egyptian math topics is hekat division standard\nreported in the AWT.\n\nPeet, Gillings, 1972, and Robin-Shute, 1987 show that all the three\nscholars prematurely concluded in independent analyses that MK ro data\n(from the RMP and AWT) only meant 1/320 of a hekat, and no more. Not one\nof the three scholars grasped Ahmes central fact, that quotients and\nscaled ro remainders defined a weights and measures unit by beginning\nwith a hekat unity (64/64), and dividing by any rational number less\nthan 64.\n\nReturning to Peet, and his analysis will be shown in the next few\nparagraphs. He apparently made serious errors with respect to ro and its\nrelationship to Egyptian division, as was vividly declared in the AWT\nhekat and 1/64 divided by 1/n context. Peet did not see ro’s actual\nassociation with remainders, though he mentioned remainders from time to\ntime. It is clear that 64 times 5, an early form of mod 5 in the R/3\nterm, included the use of numerators and denominators, or, by example,\nlet the divisor of 64/64 be n, then\n\nQ + R/3\n\nappeared in two shorthand forms, the first being\n\n\\(1) (64/64)/n = Q/64 + R/(64n).\n\n\\(2) (64/64)/n = Q/64 + (5\\*R/n)\\* 1/320, with ro = 1/320\n\nAhmes used the second form. The first form is the manner in which modern\nmathematicians read this type of information.\n\nOne of the most exciting aspects of the AWT is that the rational number\n(5\\*R/n) was easily converted to an Egyptian fraction series. It not\nknown if this was the first generalized used of Egyptian fractions.\n\nSilverman’s 1975 point is plausible. Egyptian fractions were found in\nthe Old Kingdom. Silverman’s proposal may mean that the balance beam\nproblem was solved by an Old Kingdom scribe, noting:\n\nR/(64n)\n\nwith the Egyptian fractions series being either R/n or R/(64n).\n\nThanks to Middle Kingdom scribes for leaving red flags raised by the\nAWT, RMP, MMP and the KP so that profound hekat division problems are\nnow understood.\n\nIn the modern era, Daressy in 1906 incompletely discussed the AWT\nEgyptian fraction series data. Daressy saw exact divisions which seemed\nto be in cubit units. In 2002 Vymazalova added binary fractions and a\nscaled remainder that summed to (64/64). Today is is clear that the AWT\nmethod corrected and Old Kingdom cubit-cubit-cubit recorded as a hekat\ndivision method, that was proven by the AWT scribe by returning binary\nquotient and scaled remainder answers to its initial numerical values,\n(64/64).\n\n[8]{} Mahmoud Ezzamel, *Accounting for Private Estates and the Household\nin the 20th Century BC Middle Kingdom*, Abacus Vol 38 pp 235-263, 2002\nMilo Gardner, *The Egyptian Mathematical Leather Roll Attested Short\nTerm and Long Term, History of Mathematical Sciences*, Hindustan Book\nCompany, 2002. Milo Gardner, *An Ancient Egyptian Problem and its\nInnovative Solution, Ganita Bharati*, MD Publications Pvt Ltd, 2006.\nRichard Gillings, *Mathematics in the Time of the Pharaohs*, Dover\nBooks, 1992. T.E. Peet, *Arithmetic in the Middle Kingdom*, Journal\nEgyptian Archeology, 1923. Tanja Pommerening, *“Altagyptische Holmasse\nMetrologish neu Interpretiert” and relevant phramaceutical and medical\nknowledge, an abstract, Phillips-Universtat, Marburg, 8-11-2004, taken\nfrom \"Die Altagyptschen Hohlmass*, Buske-Verlag, 2005. L.E. Sigler,\n*Fibonacci’s Liber Abaci: Leonardo Pisano’s Book of Calculation*,\nSpringer, 2002. Hana Vymazalova, *The Wooden Tablets from Cairo:The Use\nof the Grain Unit HK3T in Ancient Egypt, Archiv Orientalai*, Charles U\nPrague, 2002.",
  "language": "INFORMAL",
  "phrase": "Akhmim Wooden Tablet",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AkhmimWoodenTablet1"
    }
  ],
  "indexable": true
}