{
  "alternatePhrases": [
    "Egyptian math"
  ],
  "definition": "Introduction\n============\n\nThe Akhmim Wooden Tablet may date to 2,000 BCE, 12th dynasty, or as late\nas 15th dynasty. The tablet is housed in the Cairo, Egypt Museum. It is\n46.5 x 26n cm in size and mentions 27 servant names, an unknown king’s\nname (citing the 8th year of his reign), five division calculations, one\nof which was repeated four times and five proofs. The document was\nreported in 1901 and analyzed and published in 1906 by Georges Daressy.\nDaressy indicated five divisions by 3, 7, 10, 11 and 13, and wrote out\nexact 1/p unit fraction series, and validated three of the five proofs.\n\nDaressy discussed the AWT in terms of binary fractions and minimized\naspects of the five Egyptian fraction series. Typos and other errors\nmuddled the 1/11 and 1/13th multiplications. Exactness was not\nidentified in the scribal proof for the 1/11 and 1/13 cases. Daressy\ncited the cubit-cubit rather than the hekat, the actual AWT context\n(Peet’s main complaint).\n\nHowever, Daressy’s cubit view was consistent with a binary fraction\nremainder arithmetic, and exact partitions. Peet did not identify\nseveral scribal arithmetic facts. Daressy’s approach properly analyzed\nAWT data that included binary fractions and scaled remainders.\n\nA small number of scholars worked on the 1/10th of a hekat (a volume\nunit) named hin, hinu, or henu scaled a linear cubit to a\ncubit-cubit-cubit within a hekat unity (64/64) such that 1/320 of a\nhekat was named ro\n\n(64/64)/10 hekat = (6/64 + 4/640)hekat =\n\n(4 + 2)/64 hekat + 20/10 ro =\n\n(1/16 + 1/32)hekat + 2ro =\n\n1 hin\n\nAhmes in Rhind Mathematical Papyrus (RMP) 81 used 29 binary hekat\nquotients + scaled ro remainders by following the theoretical statement\n\n(64/64)/n = Q/64 + (5R/n)ro\n\nwith Q = Quotient, R = Remainder, and\n\nn limited to the range 1/64 &lt; n &lt; 64. The AWT and RMP two-part\nstatements used one part statements. For example: 10/n hin simply meant\na hekat was scaled to a 1/10 unit named hin was the limit scholarly\ndiscussions. Peet in 1923 incompletely discussed the AWT’s binary\nfractions statements that conflicted with Daressy’s earlier work. Peet\nreported 1/3, 1/7, 1/10, 1/11, 1/13 multiplication aspects of the\nproblems and only stressed the 1/320 ro unit. Peet had not reported the\nmeta (64/64)/n division that reported five binary quotient plus a 1/320\nremainder answers and proofs. Peet under reported the scribal context\nand modern translation of the AWT n = 11 and 13 cases, correctly\nreported by: a. (64/64)/11 hekat = (5/64 + 9/704)hekat = (4 + 1)/64\nhekat + (45/11)ro = (1/16 + 1/64)hekat + (4 + 1/11)ro b. (64/64)/13\nhekat = (4/64 + 12/832)hekat = 4/64 hekat + (60/13)ro = 1/16 hekat + (4\n+ 8/13)ro with 8/13 scaled by LCM 2 to 16/26 = (13 + 2 + 1)/26 = 1/2 +\n1/13 + 1/26 recorded as: (64/64)/13 hekat = 1/16 hekat + (4 + 1/2 + 1/13\n+ 1/26)ro It 80 years for Vymazalova to correctly report the proof\ncontext of the AWT arithmetic story. Hana Vymazalova reported the proof\nside of the five two-part statements that returned (64/64) five times\nwhen multiplied by the initial divisors. Vymazalova did not challenge\nPeet’s calculation views of the five AWT binary quotient and 1/320\nremainder answers, points that were corrected in 2006.\n\nDaressy’s 1906 review of the AWT’s data garbled the n = 11 and n = 13\nproofs thereby confusing Peet and later researchers. In 2002 by Hana\nVymazalova corrected Daressy’s two proof errors. Vymazalova’s\ncorrections and other meta points were published in 2006 and 2011. The\nAWT reported a well-defined system of weights and measures arithmetic\nfrom an Old Kingdom inexact system to an exact Middle Kingdom rational\nnumber system.\n\nThe meta context in which Peet properly identified the 1/320 ro aspect\nof the AWT was missed until Hana Vyamazalova’s 2002 paper. Scholars for\nalmost 100 years did not connect the AWT partition method to RMP 81 and\n29 data points, and over 30 additional two-part partitions of a (64/64)\nhekat unity discussed in the RMP.\n\nContents of the tablet\n======================\n\nTranslated to our modern base 10, the AWT simply states that unity\n(64/64th) was divided by 3, 7, 10, 11 and 13 following a general rule of\ndivision, as is clearly read by:\n\n(64/64)/n = Q/64 + (5R/n)ro\n\nwith Q = quotient, and R = Remainder\n\nwriting the initial problem in modern base 10 fractions.\n\nMiddle Kingdom scribes used this pattern, by easily writing the quotient\nterm into a Horus-Eye series, for example (64/64)/3 = 21/64 (Q). Several\nscholars have seen this portion, but become foggy with respect to the\nremainder, one (1) in the case of n = 3.\n\nThe 2nd portion, the handling of the remainder, has been grossly\nconfused by scholars. One reason can be excused since R/(n\\*64) was\n’encoded’ by scribes replacing 1/64th with equivalent 5/320 remainders.\nThis allowed student scribes to add Q and R values as one number.\n\nTo the average scholar seeing an Egyptian fraction series, actually\n(5R/n) followed by ro (long known to be 1/320) did not ’feel’ like a\nremainder component. However, Ro, clearly used as a common divisor, can\nalso have been seen by Ahmes as n LCM, or even a GCD. Whatever ro’s\nmeaning to Ahmes, its details was left to modern code breakers.\n\nOnly a few scholars opnenly ’scratched’ their respective heads when\nseeing AWT and RMP two-part data. Two recent scholars: Robins-Shute saw\n(6400/64)/70 one of 10 RMP 47 problems. Robins-Shute did not report the\ntwo-part Q/64 + (5R/70)ro expression in a 1987 RMP book. Robins-Shute\nfairly reported products and remainders contained in the data, a form of\nscratching of their respective heads.\n\nAn earlier motivated scholar was Chace. In a 1927 RMP book, RMP 83\nreported three data sets for (64/64) divided by n = 6, 20, and 40. The\nbird-feeding rates made little sense to him, suggesting that Ahmes had\ngarbled the data. Chace mentioned that Ahmes left no clues to on this\nmatter, a personal point that is obviously incorrect when reading the\nAWT in its broader context.\n\nFactually, Ahmes and the AWT scribes created\n\nQ/64 +(5R/n)(1/320)statements, over 60 times following the same\ntheoretical style.\n\nFor none mathematicians reading, it may be best to refer to the modern\nbase 10 version of the 4,000 year old arithmetic notation (shorthand),\nand then, say a few days later, actually attempt write in the ancient\n2-part notation. That is, clearly think in our modern base 10 for a few\ndays, before trying to think and write as a 4,000 year old scribe.\n\nThere are four trees being discussed here, each suggesting confusion,\nunless care is taken. They are: (1) the Horus-Eye notation, followed by\na hekat, written in the first half of the expression, (2) Hieratic\nEgyptian fraction notion, followed by ro in the second half of the\nexpression, (3) the Egyptian fraction series represented only the\nrational number (5\\*R/n), noting n in the denominator, allowing it to\ngrow to any size, thereby allowing an exact computation, every time, and\n(4)the word ro, as 1/320th was factored from the remainder term.\n\nClearly ro was a minor term, in the expression, possibly only a common\ndivisor factor, used to add the Horus-Eye and Egyptian fraction series\ntogether, allowing a proof to be quickly performed, as was listed five\ntimes in the AWT (and not at all in the RMP).\n\nIt is therefore recommended that novice readers of this blog do not\nallow one or two of the different types of trees that you run into, to\nbe confusing. Look for the forest of each type of notation, stated as\nclearly as your education allows. Then and only then try to read and\nwork with the inner workings of the AWT, such as an individual tree. The\nwork on a complete (64/64)/n division problem as the 2,000 BC student\nscribe was trained.\n\nHave patience, each of the ideas are simple, seen separately. Taking in\nthe set of anjcient ideas at once causes problems for many people.\nPlease avoid shortcuts, especially the ones that Ahmes himself\npracticed, until you discover the foundations of Ahmes’ arithmetic, such\nas the ancient methods that created 2/n tables.\n\nPeet, Gillings and other may have taken a couple of modern shortcuts,\nmissing an ancient tree or two.\n\nBegin at the beginning of each of the AWT problems, and compare your\nbeginning, middle and end work with the same type of problem written out\nin the RMP (\\#47, 81, 83 are the best examples). Then work to the end of\neach AWT problem, doing your own work, every step of the way.\n\nYou will be rewarded. Spend the necessary time to work through more than\none ancient problem as scribes solved it, using all of the old tools.\n\nBackground\n==========\n\nThomas E. Peet, 1923, partially repeated an analysis of the AWT by\nshowing several connections between Egyptian math and the practical\nexperiences of an ancient Egyptian scribe that used two numeration\nsystems, Horus-Eye and the Egyptian fractions (cited in the RMP). Peet\nmuddled where one system ended and where the other system began by only\ndetailing additive aspects of the two numeration systems, missing the\nexact Egyptian division features using 5ro as a partitioning idea, using\nnumerators and denominators = 320 in an interesting way. Peet also\nprematurely concluded that the Egyptian division was only an inverse of\nthe Egyptian multiplication operation.\n\nPeet did not directly discuss Egyptian division, as a general operation,\nas confirmed by the AWT examples. However, contrary to Gillings and\nRobins-Shute, Peet did seem to compute with 5ro, 4ro, 3ro, 2 ro and ro,\nbut only from a limited view of the AWT student. Peet was slightly\nmyopic, asking few meta questions, such as: were all of the student’s\ndivisions required to be exact? More importantly, no comparisons of\nPeet’s view of the AWT were made to the RMP and its 84 problems. At\nleast ten RMP problems, 36-43, and 81-82, have been misread with respect\nto ro, suggesting it was a weights and measures unit. Ro was actually\nconnected to a generalized partitioning role, as closely related to\nother exact partitioning methods cited in the RMP, and other Middle\nKingdom mathematical texts.\n\nScholars are, of course, free to explore these issues on their own,\ncommenting on the actual mix of Egyptian mathematics that meets a few of\nthe standards that are deduced from the AWT, and its interesting set of\ndivision methodologies.\n\nPeet, and two later scholars, Gillings, 1972, and Robin-Shute, 1987,\nshow that all the three scholars prematurely concluded in independent\nanalyses that MK ro data (from the RMP and AWT) only meant 1/320 of a\nhekat, and no more. Not one of the three scholars grasped Ahmes central\nfact, that quotients and scaled ro remainders defined a weights and\nmeasures unit by beginning with a hekat unity (64/64), and dividing by\nany rational number less than 64.\n\nReturning to Peet, and his analysis will be shown in the next few\nparagraphs. He apparently made serious errors with respect to ro and its\nrelationship to Egyptian division, as was vividly declared in the AWT\nhekat and 1/64 divided by 1/n context. Peet did not see ro’s actual\nassociation with remainders, though he mentioned remainders from time to\ntime. It is clear that 64 times 5, an early form of mod 5 in the R/3\nterm, included the use of numerators and denominators, or, by example,\nlet the divisor of 64/64 be n, then\n\nQ + R/3\n\nappeared in two shorthand forms, the first being\n\n\\(1) (64/64)/n = Q/64 + R/(n\\*64).\n\n\\(2) (64/64)/n = Q/64 + (5\\*R/n)\\* 1/320, with ro = 1/320\n\nAhmes used the second form. The first form is the manner in which modern\nmathematicians read this type of information.\n\nOne of the most exciting aspects of the AWT is that the rational number\n(5\\*R/n) was easily converted to an Egyptian fraction series. It not\nknown if this was the first generalized used of Egyptian fractions.\n\nIt is plausible that Silverman’s 1975 point, that Egyptian fractions\nwere found in the Old Kingdom, may mean that the balance beam problem\nwas solved by an Old Kingdom scribe, noting:\n\nR/(n\\*64)\n\nwith the Egyptian fractions series being either R/n or R/(n\\*64).\n\nResearch is continuing in a broader context in which Egyptian remainder\narithmetic was found. Thanks to the scribes for leaving red flags raised\nby the AWT, and other clues, so that the simple five division problems\nof the AWT are fully decoded.\n\nEarly on, Daressy in 1906 discussed the Egyptian fraction series as\nremainder based. He saw the exact divisions of some unit, which he\nlabeled in cubit units. Adding in a broader view of binary fractions to\nthe discussion, going beyond Daressy’s analysis, a clue to the Old\nKingdom manner of partitioning a cubit, hekat, or any unit by remainder\narithmetic has been provided.\n\nIn addition a required meta view of the 2,000 BCE Egyptian economy adds\nabsentee landlords and Pharaoh using the MK finite Egyptian fraction\nunits.",
  "language": "INFORMAL",
  "phrase": "Akhmim Wooden Tablet",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AkhmimWoodenTablet"
    }
  ],
  "indexable": true
}