{
  "alternatePhrases": [],
  "definition": "I\n\nOld Kingdom (OK) numerals were written in hieroglyphic many-to-one\nsymbols. The OK numeration system followed a cursive binary algorithm\nthat rounded off, throwing away a 1/64 unit, in an infinite series. The\nsystem included an uncorrected binary system before 2350 BCE.\n\nAfter 2050 BCE a fully developed hieratic numeration and math system\ncorrected Old Kingdom round-off errors in Ahmes Papyrus and other texts.\nThe corrected numeration system encoded rational numbers by s in 2/n\ntables and every day math problems in finite ways.\n\nBy 1900 BCE the Akhmim Wooden Tablet (AWT), 1825 BCE in the Moscow\nMathematical Papyrus(MMP), 1800 BCE in the Egyptian Mathematical Leather\nRoll (EMLR), 1800 BCE in the Kahun Papyrus (KP) and 1650 BCE in the\nAhmes Papyrus (better known as the 1650 BCE Rhind Mathematical Papyrus\n(RMP)) applied the improved hieratic numeration system that solved a\nwide range business problems.\n\nFor example, Ahmes Papyrus recorded exact unit fraction data in a finite\narihmetic notation. Scholars in the 20th century incompletely considered\nscribal shorthand facts to unfairly report scribal longhand methods.\n\nIn 2006 AD Ahmes shorthand was decoded in RMP 36 AND RMP 37 longhand by\nadding back missing 2/n table data. The long hand information allowed\n’Ab initio’ aspects of RMP 2/n tables, mentioned by Peet and 1920s\nscholars as needed, to be formally added-back to once hard-to-read\nshorthand data within four 2/n table construction rules:\n\n1\\) 2/p = (2/p)(m/m) = (2m/mp), with the best divisors of mp to sum to 2m\nand the best best fraction series\n\n2\\) n/p = (n/p)(m/m) = mn/mp, with the best divisors of mp summed to mn\nand the best unit fraction series.\n\n3\\) n/p = (2/p) + (n -2)/p scaled by (m1/m1) and (m2/m2)\n\n4\\) when rules 1, 2 or 3 could not find (m/m), (m1/m1) and/or (m2/m2)\nidentity statements like\n\n1 = 53/53 = 2/53(30/30) + 3/53(20/20) + 5/53(12/12) + 15/53(4/4) +\n28/53(2/2) were solved\n\nThe four rules added back ’ab initio’ reconstructed facts to least\ncommon multiple (LCM) m arithmetic statements scaled to unit fraction\nseries. Scribal longhand included uses of red auxiliary numbers, and\nother ’ab initio’ facts. Considering these new facts assists in better\ndecoding Egyptian fraction data recorded in the RMP, EMLR, MMP, the KP\nand other Middle Kingdom and later Greek, Arab and medieval texts.\n\nThat is, RMP 36 and RMP 37 rational numbers (n/p) were scaled by least\ncommon multiples (LCM) m were thought of as (m/m) to (mn/mp). The best\ndivisors of denominator (mp) were written in red (red auxiliary numbers)\na misunderstood shorthand unit fraction series calculation step.\n\nAhmes’ longhand rational number arithmetic steps reports finite\narithmetic within exact unit fraction series whenever possible. A small\nnumber of round container calculations reported in RMP 41-44 rounded-off\nby applying an estimate for pi of 256/81 (3.1605). RMP 38 mentioned 22/7\n(3.1429) as a correction that reported (3 + 10/71) less pi less (3 +\n10/70) 1500 years later.\n\nII BACKGROUND ISSUES\n\nAfter 2050 BCE hieratic numerals and numbers were mapped one-to-one onto\nsound symbols (for the first time in the Western Tradition) within\nfinite arithmetic statements. Scribes demonstrated that Middle Kingdom\nrational numbers. written in finite arithmetic, were exact whenever\npossible. The finite arithmetic used unit fraction statements that\napplied prime numbers that were equivalent to our modern fundamental\ntheorem of arithmetic. The finite arithmetic contained algebra,\nalgebraic geometry, arithmetic progressions, geometric progression and\nweights and measures unit calculations that focused on business\ntransactions. The hieratic arithmetic defined “one of the essential\nskills of mathematics changed context, including notations, units, and a\ngreat deal more”, a feature of modern mathematics. Statements of Middle\nKingdom problems were often recorded in algorithms with solutions\nrecorded in finite arithmetic statements.\n\nA student scribe scaled rational numbers in the Egyptian Mathematical\nLeather Roll (EMLR) to show that the system was easy to use. The EMLR\nstudent scaled 26 rational numbers 1/p and 1/pq by multiples m that\nobtained m/pm and m/pqm to find concise and non-concise unit fraction\nseries. Fully trained scribes (Ahmes and the Kahun Papyrus (KP) author)\nconverted 2/n table rational numbers by up to 14 multiples m that\nobtained 2m/mp before concise unit fraction series were calculated in\nthe RMP 2/n table and a shorter KP 2/n table. Rational numbers recorded\nas unit fraction series used algebraic formulas in the KP, the , the\nAkhmim Wooden Tablet (AWT), and the Moscow Mathematical Papyrus (MMP)\nand other texts. The Ahmes Papyrus is also known as the RMP.\n\nIII Ahmes Papyrus, a summary\n\nAhmes scaled rational fractions (n/p) by LCM m/m to mn/mp. The best\naliquot parts of divisors (mp) were written in red ink that summed to\nnumerator (mp). Final unit fraction series recorded concise 50 member\n2/n table members and 87 problems written in the same notation. Scribal\nproblems may have first been solved in an economic context. The RMP\neconomic context scaled commodities like bread and beer in hekats of\ngrain, a volume unit that was used to pay wages. RMP 36 and scaled\nsolutions to 2/53, 3/53, 5/53, 15/53 and 30/53 exposed the scribal\nmeaning of red auxiliary numbers that built concise 2/n tables. Scribal\nvulgar fraction (rational number arithmetic) exposed meta numbers and a\nwindow to decode ancient .\n\nScribal meta arithmetic notations confused 19th and 20th century\nscholars. 20th century scholars suggested scribal division consisted of\n’single false position’, an idea that Arabs used to find roots to second\ndegree equation around 800 AD. Clagett as late as 1999 stressed ’single\nfalse position’ rather than following Schack-Schackenberg’s 1900\ndecoding of RMP 69’s pesu arithmetic operations, and a well defined RMP\n36 decoding information. In RMP 69-78 a pesu calculation followed two\nsecond degree equation solutions that were recorded 250 years earlier.\n\nThe meta scribal arithmetic was ’cracked’ in 21st century AD. Middle\nKingdom rational numbers and arithmetic operations are being corrected,\none problem at a time. Corrections add back missing scribal shorthand to\nexpose modern-looking vulgar fraction and modern-looking arithmetic\noperations that recorded the following:\n\nA. addition: (n/p + m/q) = (nq + mp)/pq 1. common: (1/p + 1/q) = (p +\nq)/pq 2. frequent: (1/p + 1/np) = (n + 1)/np\n\nB. subtraction: (n/p - m/q) = (nq - mp)/pq, 51 times, as a secondary\n2/nth table method.\n\nC. multiplication: (n/p x m/q) = (nm/pq), and (n/p x (m/m) = nm/mp, with\nmp aliquot parts = nm, writing 51 exact unit fractions series in 2/n\ntable. A second Old Kingdom duplation method was used to prove answers’\ncorrect value, by working the problem backwards (as RMP 1-28 detail).\nThe second method followed a doubling pattern (duplation), while the\nfirst and second methods looked and acted as modern arithmetic\ndefinitions.\n\nD. division: (nm/pq)/(m/q) = (nm/pq) x (q/m) = n/p, with division by\nm/q, an inverse q/m multiplication operation.\n\nIn 2010 it became clear that scribal geometry was algebraic based.\n\n1\\. The area (A) of a circle formula, used in MMP 10, RMP 41, and 42\nreplaced radius (R) with 1/2 a diameter (D/2), and replaced pi with\n256/81 in three steps (a, b, c)\n\na\\. A = (256/81)(D/2)(D/2)\n\nb\\. A = (64/81)(D)(D)\n\nc\\. A = (8/9)(8/9)(D)(D) cubits\n\n2\\. RMP 42, adding height (H) to compute volume\n\na\\. V = (8/9)(8/9)(D)(D) cubits,\n\nb\\. V = (3/2)(8/9)(8/9)(D)(D) khar (convert cubit units to khar units)\n\n3\\. In RMP 43 and the Kahun Papyrus scribes scaled RMP 42 formula\n\nV =(3/2)(8/9)(8/9)(D)(D)khar by 3/2 in two steps\n\na\\. (3/2) V = (3/2) (3/2)(8/9)(8/9)(D)(D)khar\n\nb\\. V = 2/3)(H)(4/3)(4/3)(D)(D) khar (directly calculate in khar units)\n\nRMP 43 data d = 8 and H = 6\n\nd\\. V =(2/3)(6)(4/3)(8)(4/3)(8)= (4)(32/3)(32/3) = 4096/9 = (455 +\n1/9)khar\n\nalgebraic arithmetic scaled geometry facts that Robins-Shute “RMP”, 1987\n(page 46) reported RMP 42 formuls V= “(8/9)(8/9)(D)D)cubit cubits =\n(3/2) x (8/9)(8/9)(D)(D)(H)khar = (32/27)(D)(D)(H) =\n(2/3)(4/3)(4/3)(H)khar”, and 20 khar/20 = (1) 400-hekat unit. Ahmes\nreported 4-hekat and 4-ro units in two-part Q/64 + (5R/n)ro answers, and\ndivided 400-hekat, 100-hekat, 4-hekat and 1-hekat units by divisor n by\nsubstituting (6400/64) for 100-hekat, (64/64) or 320 ro for 1-hekat.\n\nIV CONCLUSIONS\n\nUpdated 21st century analysis of Ahmes’ 87 problems strip away Middle\nKingdom Egyptian fraction notations and expose rational numbers,\nalgebra, algebraic geometry, arithmetic progression and arithmetic\noperations. Scholars in the 20th century transliterated hieratic\nnumerical data within an additive notation, and did not publish complete\ntranslations of scribal shorthand information. To fairly translate\nscribal rational number arithmetic into modern arithmetic statements\nmeta points of view have been developed.\n\nWeights and measures units used in the Middle Kingdom were also poorly\ntranslated. Translation errors are corrected by developing meta\ntheoretical and practical properties of ancient Egyptian fraction\nmathematics. Scribes scaled 2/n tables, algebra, geometry, and weights\nand measures statements by selecting the best LCM m and the best red\nauxiliary numbers.\n\nConsidering the 3,700 year mathematical life of Egyptian fraction\narithmetic LCM m was applied two ways. In the Middle Kingdom n/p was\nscaled by LCM m to mn/mp, a multiplication context. Sometime before 800\nAD, Greek, Arab and/or medieval scribes replaced the traditional\nmultiplication context with a subtraction context:\n\n(n/p - 1/m) = (mn -p)/mp, with (mn-p) set to unity as often as possible.\n\nFibonacci reported three versions of the unit fraction arithmetic system\nin the Liber Abaci. With the fall of the Byzantine Empire in 1454 AD,\nthe Liber Abaci and the unit fraction arithmetic fell out of use in\nEurope with Galileo. The Arabs version (present in Ghobar script) was\nused as late as 1637 AD, was erased with the implementation of modern\nArabic script. By 1600 AD Stevin’s 1585 AD decimal system, written in an\nArab algorithm, created base 10 decimal arithmetic, algebraic geometry,\nalgebra and unit fraction weights and measures operations, began to\ntrivialize the once bright Egyptian fraction arithmetic system.\n\n[10]{} A.B. Chace, Bull, L, Manning, H.P., Archibald, R.C., *The Rhind\nMathematical Papyrus*, Mathematical Association of Amnerica, Vol I,\n1927. NCTM reprints available. Edward Cherlin, *\\[Math 2.0\\]*,\n&lt;echerlin@gmail.com&gt;, mathfuture@googlegroups.com, Tue, March 1,\n2011 Milo Gardner, *An Ancient Egyptian Problem and its Innovative\nSolution, Ganita Bharati*, MD Publications Pvt Ltd, 2006. Richard\nGillings, *Mathematics in the Time of the Pharaohs*, Dover Books, 1992.\nOystein Ore, *Number Theory and its History*, McGraw-Hill Books, 1948,\nDover reprints available. T.E. Peet, *Arithmetic in the Middle Kingdom*,\nJournal Egyptian Archeology, 1923. Tanja Pommerening, *“Altagyptische\nHolmasse Metrologish neu Interpretiert” and relevant phramaceutical and\nmedical knowledge, an abstract, Phillips-Universtat, Marburg, 8-11-2004,\ntaken from \"Die Altagyptschen Hohlmass*, Buske-Verlag, 2005. Gay Robins,\nand Charles Shute *Rhind Mathematical Papyrus*, British Museum Press,\nDover reprint, 1987. L.E. Sigler, *Fibonacci’s Liber Abaci: Leonardo\nPisano’s Book of Calculation*, Springer, 2002. Hana Vymazalova, *The\nWooden Tablets from Cairo:The Use of the Grain Unit HK3T in Ancient\nEgypt, Archiv Orientalai*, Charles U Prague, 2002.",
  "language": "INFORMAL",
  "phrase": "An Over View Of Ahmes Papyrus",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AnOverViewOfAhmesPapyrus"
    }
  ],
  "indexable": true
}