{
  "alternatePhrases": [
    "Hindu-Islamic numerals"
  ],
  "definition": "INTRODUCTION: After 800 CE an un-ciphered Arab notation scaled rational\nnumbers by LCM m, written in a subtraction context by 1/m, recoded\nsometimes awkward unit fraction series. The revised numeration system\nreplaced the older ciphered Egyptian Greek and LCM m written as m/m in a\nmultiplication context. The Greek and Egyptian system had scaled\nrational numbers by LCM m/m from 2050 BCE to 800 AD in the business\nworlds of both cultures. An informal zero had been used in Egyptian\ndouble accounting and Greek math statements, one reason that Arabs had\nnot added zero to their numeration system.\n\nThe replacement Arab notation brought Hindu 1-9 numerals from India and\na hint of an algorithm from Babylon/Chaldean math traditions that\nrecorded rational numbers to awkward looking unit fraction series scaled\n(ciphered) by the same Greek LCM m in a subtraction context. A formal\nzero in a positional notation was missing until 1585 CE.\n\nAfter 800 CE Arabs and medieval scribes scaled (ciphered) rational\nnumbers n/p by LCM m that considered\n\n(n/p - 1/m) = \\[(mn -p)/mp\\]\n\nconsidered 0 less than n/p less than 1\n\nn/p was rational numbers recorded in 2-term unit fraction series that\nset (mn-p) = 1; and 3-term unit fraction series selected a second LCM m.\n\nThe new Arab arithmetic scaled rational numbers n/p by LCM m in a\nsubtraction context by seven conversion rules reported by Fibonacci in\n1202 CE. The seven rules scaled rational numbers n/p by LCM m to\n(mn-p)/mp continued operational properties of the older Egyptian\nfraction arithmetic rules for addition, subtraction, multiplication and\ndivision. Intermediate calculations tried to set remainder numerators\n(mn -p) equal to 1 (unity) statements by an algorithm. Unit fraction\nanswers recorded 2-term and 3-term unit fraction series.\n\nThe new numeration and subtraction based arithmetic system demonstrated:\n\n(n/p - 1/m) equaled (mn -p)/mp by considering obvious limitations:\n\nExample, (7/27 - 1/4) = 1/104, meant 7/27 = 1/4 + 1/104\n\nMore complex examples included 4/13 that could not be solved by 2-term\nseries. The more complex 4/13 case was solved by:\n\n(4/13 - 1/4) = (16 -13)/52 = 3/52 - 1/18 = (54 - 52)/936\n\nIn difficult cases like 4/13, 3-term unit fraction series is read in\nmodern arithmetic by:\n\n4/13 = 1/4 + 1/18 + 1/468\n\nThe medieval 2-term and 3-term conversions of rational numbers to\nconcise unit fraction system was attempted to popularized by Pope\nSylvester after 999 CE. Pope Sylvester suggested that Latin schools use\nHindu-Arabic numerals and the simplified arithmetic systems.\n\nOnly with the formal end of the Crusades did the generalized use of\nHindu-Arabic symbols and simplified arithmetic, algebra, geometry and\neconomic trading unit systems become popularized by the “Liber Abaci”,\nwritten in 1202 CE, Europe’s arithmetic book for 250 years.\n\nThe Liber Abaci was written by Fibonacci (Leonardo de Pisa), a son of a\nPisa merchant that had traveled with his father studying the math and\ntrading unit systems. The Liber Abaci book was used as a Latin school\ntextbook until the unit fraction system began to fall out of use in\nEurope after Byzantium (Constantinople) was over run by the Ottoman\nEmpire in 1454, an event that closed much of the Silk Road.\n\nMAIN POINTS: Arab mathematicians adopted Hindu 1-9 numerals around 800\nCE. The Arab innovation replaced Greek and Hellene ciphered numerals by\nadding East Indian base 10 numerals in a modified base 10 unit fraction\nsystem. The older Greek and Hellene ciphered numeration system had\nfollowed a 1,500 year older hieratic Egyptian system that mapped\nnumerals on a one-to-one basis to (sound) symbols. Egyptian scribes\nemployed a formal zero, though not positional, an awkwardness that\ncontinued with Hindu-Arabic numerals after 800 CE.\n\nThe medieval 1-9 numeration system commenced in 800 CE motivated\nEuropeans to adopt Arab numerals, Arab algorithms, and non-positional\nzero elements by a Pope Sylvester 999 CE edict. Europe adopted\nHindu-Arabic numerals and Arab and Greek mathematics by studying\nFibonacci’s after 1202 CE.\n\nAfter the closure of much of the Silk Road in 1454 CE, Fibonacci’s 250\nyear old arithmetic book dropped out of use. About the same time Liber\nAbaci math was translated by Nicolas Chuquet in 1453. Chuquet used a\nlattice multiplication, double false position, Diophantine indeterminate\nequations, Babylonian square root, algorithms, and aspects of the\nChinese Remainder Theorem methods that arrived years earlier via the\nSilk Road (as documented by Needham). Zero as a positional number was\nadded 130 years later within a new numeration system and algorithm that\nencoded rational numbers by the binomial theorem. The well known\ndefinition of $$n^0 = 1$$ was an element. Construction details of the\nmodern base 10 decimal system was recorded in 1585 CE by Simon Stevin.\nStevin rigorously applied zero in two books, one for science, and one\nfor business, as an exponential positional place-holder. Both books were\napproved by the Paris Academy. Several scholars have given credit to\nHindu-Arabic numerals 800 AD introduction spread to Europe and was\npopularized for 250 years in Fibonacci’s “Liber Abaci”.\n\nElements of Napier’s Bones, and Arab- Hellene lattice multiplication\nmethod were noted by Fibonacci. Napier popularized the new base 10\ndecimal system by adding logarithms. Napier’s numeration publications\nfacilitated several science activities, including ’s 1609 astronomical\nwork and logarithms were used to facilitate Huygens’ telescope, and\nGreek square root as late as Galileo.\n\nThe last surviving . The text pointed the way to Mecca from Morocco. , a\nset of actions that formally ended 3,700 of continuous unit fraction\narithmetic and mathematics use in the Egyptian, Greek, , and medieval\nmath worlds.\n\nBACKGROUND: Prior to 800 CE Greek and Egyptian scribes scaled rational\nnumbers to unit fraction arithmetic in concise ways. The 2,800 year old\nsystem scaled and ciphered rational number n/p by LCM m in a\nmultiplication context. Rational numbers n/p were scaled by m/m to mn/mp\nin a multiplication context by four rules before selected concise unit\nfraction series representations. Scribes selected the best divisors of\ndenominator mp that summed to numerator mn by . The older scribal\narithmetic demonstrated concise 2-term, 3-term, 4-term and 5-term unit\nfraction series representations of rational numbers.\n\nScholars in the 20th century did not decode the older Greek and Egyptian\nproto-number theory aspects of the four scribal rules. By the 21st\ncentury scholars began pointing out scribal p and q as prime numbers\nthat scaled n/p by LCM m/m to mn/mp before concise unit fraction series\nwere recorded.\n\nEgyptian and Greek scribes ciphered numbers onto sound symbols (letters)\non a one-to-one basis. Zero was used but was not a positional idea.\nBabylonians also used a practical zero (Neugebauer) near 2050 BCE when\nEgyptians used the word sfr for zero in double entry accounting and\nother applications.\n\nGreeks mapped numerals and rational numbers onto Ionian and Doric letter\nsymbols by adding (’), ie. 1/2 = to beta’, 1/3 = gamma’, and so forth,\nrecorded as unit fraction series. The Greek zero symbol recorded an oval\ntopped with two dots, a set of notations that began to be replaced with\nthe arrival of Arabic 1-9 numerals. The best unit fraction series were\noften not intuitive, and thus difficult for modern scholars to report as\noriginally computed.\n\nCONCLUDING COMMENTS: After 800 CE a subtraction context ciphered\nrational numbers (n/p - 1/m) to (mn -p)/mp to (mn -p) recorded 2-term\nand 3-term series. Fibonacci reported three Arab unit fraction\nnotations. The most popular Liber Abaci notation was translated by\nNicolas Chuquet in 1453 CE. Chuquet used a lattice multiplication,\ndouble false position, Diophantine indeterminate equations, Babylonian\nsquare root, algorithms, and aspects of the Chinese Remainder Theorem\nmethods arrived 1,500 years earlier via the Silk Road.\n\nIn 1585 CE medieval unit fraction arithmetic was written in Hindu-Arabic\n1-9 numerals ended in Europe, though unit fraction aspects continued as\nlate a . The medieval Ghobar script version of the unit fraction system\ncontained arithmetic words and math operations also ended when modern\nArabic script replaced Ghobar script in the 17th century. The Greek\nnumeration system was last used by to solve square root problems.\n\n[10]{} A.B. Chace, Bull, L, Manning, H.P., Archibald, R.C., *The Rhind\nMathematical Papyrus*, Mathematical Association of Amnerica, Vol I,\n1927. NCTM reprints available. Milo Gardner, *An Ancient Egyptian\nProblem and its Innovative Solution, Ganita Bharati*, MD Publications\nPvt Ltd, 2006. Richard Gillings, *Mathematics in the Time of the\nPharaohs*, Dover Books, 1992. Otto Neugebauer, *Exact Sciences in\nAntiquity* Oystein Ore, *Number Theory and its History*, McGraw-Hill\nBooks, 1948, Dover reprints available. T.E. Peet, *Arithmetic in the\nMiddle Kingdom*, Journal Egyptian Archeology, 1923. Tanja Pommerening,\n*“Altagyptische Holmasse Metrologish neu Interpretiert” and relevant\nphramaceutical and medical knowledge, an abstract, Phillips-Universtat,\nMarburg, 8-11-2004, taken from \"Die Altagyptschen Hohlmass*,\nBuske-Verlag, 2005. Gay Robins, and Charles Shute *Rhind Mathematical\nPapyrus*, British Museum Press, Dover reprint, 1987. L.E. Sigler,\n*Fibonacci’s Liber Abaci: Leonardo Pisano’s Book of Calculation*,\nSpringer, 2002. Hana Vymazalova, *The Wooden Tablets from Cairo:The Use\nof the Grain Unit HK3T in Ancient Egypt, Archiv Orientalai*, Charles U\nPrague, 2002.",
  "language": "INFORMAL",
  "phrase": "Arabic Numerals",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/ArabicNumerals"
    }
  ],
  "indexable": true
}