{
  "alternatePhrases": [],
  "definition": "Abstract: The Berlin Papyrus was written in the 1900 BCE era. An\nEgyptian Middle Kingdom scribe left the hieratic papyrus at Saqqara,\nEgypt. A brief analysis of the math contents were published in 1862, the\nfirst Egyptian fraction mathematical topic discussed in the modern era.\n\nA more complete analysis of Egyptian fraction aspects of the text was\npublished in 1900. The papyrus disclosed two aspects of ancient Egyptian\nmathematical knowledge. The text also included descriptions of an\nancient pregnancy test procedure and other Middle Kingdom medical\ninformation. The two main math aspects included solutions to two second\ndegree equations that applied two approaches that stressed an inverse\nproportion named pesu.\n\nANANYSIS: The first aspect solved an algebraic “area of a square of 100\nequal to two smaller squares, one was 1/2 + 1/4 the side of the other”.\nThe question does not suggest knowledge of the Pythagorean theorem. This\naspect demonstrate that was understood in one and two variables. The\nsame imagery was used to write the hieratic word pesu, an arithmetic\nproportion.\n\nThe second aspect solved two second degree equations considered\nvariables stated as one unknown was incompletely reported by Scott\nWilliams (U. of Buffalo) per:\n\n\"100 square cubits is equal to that of two smaller squares, the side of\none square is 1/2 + 1/4 of the other.\n\nWhat are the sides of the two unknown squares?\n\nIn modern era many would express the two sides this math text as\n\n1\\. x2 + y2 = 100\n\nand\n\n2\\. x = (3/4)y.\n\nIn other words: What were x and y?\n\nA modern solution might report\n\n((3/4)y)2 + y2 = 100\n\nimplies (1 + 9/16)y2 = (25/16)y2 = 100\n\nimplies y2 =(16/25)100 = 64\n\nimplies y=8 and x= (3/4)8 = 6.\n\nThe ’ab initio\" scribal method was more interesting.\n\nThe scribe began with 4x = 3y. The sum of two squares problem was solved\nby an inverse proportion, a one variable (pesu) method that was\ngeneralized by Gillings Pesu problems.\n\nGillings called the method Aha problems, not disclosing a scribal link\nto the Berlin Papyrus.\n\nThe Middle Kingdom single variable pesu method was recorded in , 70, 71,\n72, 73, 74, 75, 76, 77, 78, and the Kahun Papyrus. A parallel connected\nthe BP, RMP 69-78, and the KP was recognized by Schack-Schackenberg in\n1900. The pesu fact footnoted by Clagett in 1999, but misunderstood by\nClagett in the narrative. Clagett misreported the inverse proportion’s\ndivision operation and basic calculations as ’single false position’\nrather than the two-sided single variable method that\nSchack-Schackenberg reported.\n\nGillings confused the BP scribal solution by reporting the Egyptian\nscribal inform as simultaneous equations are solved today:\n\nx2 + y2 = 100, 4x - 3y = 0, what are x and y?\n\nClagett’s single false position suggestion was borrowed from 1920s\nattempts to read closely related Rhind Mathematical Papyrus problems and\nmethods, an approach that not involved in the Berlin Papyrus either.\n\nThe 1900 BCE Berlin Papyrus solution was reported by Schack-Schackenberg\nin 1900 AD as Ahmes reported his 1650 BCE solution in RMP 69.\n\nAssume the square of the first side (y) to be 1 cubit.\n\nThen the other side (x) will be 1/2 + 1/4.\n\nThen y2 = 1, and using Egyptian multiplication we determine\n\nx2 = (1/2 + 1/4 + 1/2)\\* (1/4 + 1/8 1/4)\\* (1/8 + 1/16 1/2 + 1/4 1/4 +\n1/8 + 1/8 + 1/16)\n\n= 1/2 + 1/16\n\nThus, x2 + y2 = 1 + 1/2 + 1/16.\n\nNow (1 + 1/2 + 1/16)1/2 = 1 + 1/4 and (100)1/2 = 10.\n\nDivide 10 by 1 + 1/4 and you get 8.\n\nAhmes’ pesu, an inverse proportional valuation of commodities, was\nfinitely informed by . The pesu used in the RMP 69 shed light on the\nBerlin Papyrus in other ways. The Middle Kingdom method was not\nconsistently parsed by scholars in the 20th century related to confusion\nover ’single false position and other issues. Gillings and Clagett\nmissed MK scribal arithmetic details by reporting personalized versions\nof the text’s math. By reading RMP 69, the 10 by 10 cubit was broken\ninto two squares in the ratio of 1: 3/4 to one another in the Berlin\nPapyrus. Following Schack-Schackenburg, properly footnoted by Clagett,\nthe pesu method offered a direct proof that abstract mathematics solved\ntwo second 1900 BCE second degree equations within hekat and loaf\nconversions to Pesu units.\n\nClagett was not alone in reporting the Berlin Papyrus method contained\nsingle false position division operation. Raw transliterated hieratic\ndata shows that Ahmes obtained 5/4 from the pesu step, and not from\nsingle false position. The simplest version of the data says that 10 was\ndivided by 5/4 and solved by 10 times 4/5 = 8, as we do today.\n\nSo we get x = 8.\n\nThe Berlin Papyrus reported\n\ny2 = 100 - 64\n\ny = 6\n\nobtained y = 6, using modern arithmetic steps such that:\n\n64 + 36 = 100\n\nwas proven.\n\nBerlin Papyrus Problem 2. You are told the area of a square of 400\nsquare cubits was equal to that of two smaller squares, the side of one\nsquare is 1/2 + 1/4 of the other, reported by the scribe as 2: 3/2 of\none another. What are the sides of the two unknown squares?\n\nThis is analogous to problem 1, ... except that the Berlin Papyrus\nscribe’s pesu calculation used 2: 3/2, an analysis that placed the pesu\ncalculation in a different logical step than the first problem. Subtle\ndifferences are important as historians report scribal shorthand notes\nas the mathematics was recorded.\n\nThe second Berlin Papyrus problem solved for x, and y\n\nwithin x squared plus y squared equaled 400, by considering\n\n2x = (3/2)y\n\nwithout solving for x before applying the arithmetic proportion method.\n\nThe x value was found after the proportion step by first finding\n\n2x = 20 x 2/5\n\nx = 20 x 4/5 = 16,\n\ny2 = 400 - 256 = 144\n\ny = 12\n\ncorrectly found\n\n256 + 144 = 400\n\nCONCLUSION: It is recommended that both Berlin Papyrus second degree\nequation problems be studied in the context of RMP 69-78, and the Kahun\nPapyrus pesu proportion method. Compare scribal conversions of hekat and\nloaves of bread to a pesu unit in the context of RMP 69-78, the Kahun\nPapyrus, and the proportional solution of two Berlin Papyrus second\ndegree equations. Several scholars in the 21st century, cluding that\nMiddle Kingdom mathematics wastheoretically based, recorded in\nhard-to-ecode shorthand, reporting anumber of unifying arithmetic\naspects, two being a second definition of scribal multiplication allow a\nclear use of scribal division as inverse to the second multiplication\noperation/ in the 19th and 20th centuries. Scribal math was likely\nunfied by a rational number double-check relationship to practical\nmeasurements recorded in double-entry accounting records, and scribal\nshorthand notes. The Berlin Papyrus, read within the context of RMP 69,\noffers two short pages of a long Middle Kingdom math story.\n\n[9]{} A.B. Chace, Bull, L, Manning, H.P., Archibald, R.C., *The Rhind\nMathematical Papyrus*, Mathematical Association of America, Vol I, 1927.\nNCTM reprints available. Marshall Clagett *Ancient Egyptian Science,\nVolume III*, American Philosophical Society, Philadelphia, 1999. Milo\nGardner, *An Ancient Egyptian Problem and its Innovative Solution,\nGanita Bharati*, MD Publications Pvt Ltd, 2006. Richard Gillings,\n*Mathematics in the Time of the Pharaohs*, Dover Books, 1992. H.\nSchack-Schackenburg, *“Der Berliner Papyreys 6619”, Zeitscrift fur\nAgypyische Sprache* , Vol 38 (1900), pp. 135-140 and Vol. 40 (1902), p.\n65f. T.E. Peet, *Arithmetic in the Middle Kingdom*, Journal Egyptian\nArcheology, 1923. Tanja Pommerening, *“Altagyptische Holmasse\nMetrologish neu Interpretiert” and relevant phramaceutical and medical\nknowledge, an abstract, Phillips-Universtat, Marburg, 8-11-2004, taken\nfrom \"Die Altagyptschen Hohlmass*, Buske-Verlag, 2005. Gay Robins, and\nCharles Shute *Rhind Mathematical Papyrus*, British Museum Press, Dover\nreprint, 1987. Hana Vymazalova, *The Wooden Tablets from Cairo:The Use\nof the Grain Unit HK3T in Ancient Egypt, Archiv Orientalai*, Charles U\nPrague, 2002.",
  "language": "INFORMAL",
  "phrase": "Berlin Papyrus And Second Degree Equations",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/BerlinPapyrusAndSecondDegreeEquations"
    }
  ],
  "indexable": true
}