{
  "alternatePhrases": [
    "straightedge and compass construction",
    "ruler and compass construction",
    "compass and ruler construction"
  ],
  "definition": "In order to define what a compass and straightedge construction is, some\npreliminary definitions are :\n\n-   A *compass* is a tool which can be used for drawing circles, or arcs\n    thereof, whose radii are sufficiently small, and for measuring\n    lengths.\n\n-   A *straightedge* is a tool which can be used for drawing lines, or\n    thereof.\n\nSome people use the word *ruler* to refer to the tool that is called a\nstraightedge here. This can cause some confusion, however, because\noutside of mathematics, a ruler is used to measure any desired. This is\n*not* a permissible tool for compass and straightedge constructions.\n\nWith these preliminaries out of the way, we can now proceed to the main\ndefinition.\n\nA *compass and straightedge construction* is the provable creation of a\ngeometric figure on the Euclidean plane (or complex plane) such that the\nfigure is created using only a compass, a straightedge, and specified\ngeometric figures.\n\nTypically, if no preexisting geometric figure is specified, the tacit\nassumption is that one can use a line segment of length $1$. Moreover,\nin such instances, one can specify what length represents $1$, but it\nmust remain constant throughout the construction.\n\nA geometric figure is *constructible* if it can be made from a compass\nand straightedge construction.\n\nOne has to be very careful with the terminology associated with compass\nand straightedge constructions. For example, the phrase “A $20^{\\circ}$\nangle is not constructible with compass and straightedge” refers to the\nfact that a compass and straightedge construction of a $20^{\\circ}$\nangle is not possible using the tacit assumption as described above. As\nanother example, the following is an erroneous argument regarding\ncompass and straightedge constructions:\n\n> A line segment of length $\\pi$ is constructible because, given a line\n> segment of length $1$, I can extend it as a ray. Then I can measure\n> the distance between the two endpoints with my compass. After that, I\n> can open the compass $\\pi$ times wider. Finally, I can mark that\n> distance on the ray from one of the endpoints of the original line\n> segment.\n\nThe above argument is one of many reasons why the word *provable*\nappears in the definition. One can open the compass however wide one\nwants, and one can mark arcs and points however one wants, but the\nconstruction is invalid unless one can prove indisputably that the\nconstruction really is what is stated. In the above example, one cannot\nprove that the compass was opened *exactly* $\\pi$ times wider than the\nlength of the original line segment.\n\nCompass and straightedge constructions are of historical significance.\nThe ancient Greeks are the most well-known civilization for\ninvestigating these constructions on an elementary level. It should be\npointed out that the compasses that they used were *collapsible*. That\nis, you could open the compass and draw an arc, but immediately after\nyou removed a point of the compass from the plane where you drew the\narc, the compass would close completely. It turns out that whether a\ncollapsible compass or a modern-day compass is used to perform these\nconstructions makes no difference. This statement is justified by the\nfact that one can use a collapsible compass to construct a circle with a\ngiven radius at *any* point as shown by .\n\nOne of the greatest applications of abstract algebra is being able to\ndetermine which constructions are possible and which are not. The\nbetween constructions and abstract algebra is that the set of all\nconstructible points is in one-to-one correspondence with the elements\nof the field of constructible numbers. Without abstract algebra, one\nwould be hard pressed to prove statements about constructibility such as\n“A $20^{\\circ}$ angle is not constructible with compass and\nstraightedge.”",
  "language": "INFORMAL",
  "phrase": "Compass And Straightedge Construction",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/CompassAndStraightedgeConstruction"
    }
  ],
  "indexable": true
}