{
  "alternatePhrases": [],
  "definition": "Egyptian Old Kingdom (OK) weights and measures rounded rational numbers\nto truncated binary weights and measures units to six binary fractions,\nthrew away smaller than 1/64 units before 2050 BCE. Binary balance beam\nunits were at the center of the OK centrally controlled Egyptian\neconomic system.\n\nAhmes in 1650 BCE scaled 50 Egyptian fraction entries in a 2/n table\nthat established theoretical economic units 400 years earlier . Rational\nnumbers n/p were scaled by least common multiple (LCM) m to mn/mp and\nthen to concise unit fraction series. The units scaled hekat and and\nrelated sub-units. The scaled numerator mn was often written as additive\n’red auxiliary’ series before a concise unit fraction series was\nrecorded.\n\nAhmes in RMP 36 scaled 3/53 hekat by LCM 20 to 60/1030 hekat = (53 + 4 +\n2 + 1)/1060 hekat as a theoretical unit that recorded exact portions of\ngrain contained in products as practical units.\n\nThe methodology established value used for trade and wage payments for\nhundreds of years.\n\nScribes scaled rational numbers by LCMs to red auxiliary numbers, 2/n\ntables, algebra, geometry and weights and measures that jump-started\nMiddle Kingdom finite arithmetic and a partially decentralized economy.\nScribes created finite quotient and exact remainders combining methods\nto measure 1/320 portions of grain in finite arithmetic. Scribes\nconverted rational numbers to concise unit fraction series in the AWT,\nMMP, and RMP that scaled a hekat unity, (64/64), by quotients (Q/64) and\nremainders (5R/n) obtained 1/320 (ro) units to value products, as well\nas (4-hekat) and (4-ro) in the MMP.\n\nDuring the Middle Kingdom (MK) (2050 BCE to 1550 BCE) a decentralized\nEgyptian economy encoded rational numbers into exact weights and\nmeasures units based in inverse square root and pesu methologies. The\nreplacement economic system allowed absentee landlords to pay wages in\ngrain units as well as pay 1/3 of 1/3 of gross profits taxes to Pharoah.\nThe economic and math systems stressed exact volume units (hekat, hin,\nro and other units) that replaced the OK rounded-off binary units in\nsecular life.\n\nMK scribes corrected OK rounded off errors by including theoretical and\npractical Egyptian fraction hekat units that exactly scaled commodities\nand paid commodity based wages. The corrected MK economic system was\nfinite and considered prime numbers for arithmetic operations. Egyptian\nMK scribes scaled rational numbers to unit fraction series within a\nsystem that formaly lasted until 1454 AD and informally to the early\n1600s (to the time of ) in Europe and 1637 AD in the Arab world. One MK\nsystem established a grain volume unit (named hekat, about 4800 ccm\ntranslated into modern metrics) that served as a unified monetary unit.\n\nThe Egyptian fraction numeration system assisted Pharaoh and elites in\ncontrolling granary outputs and decentralized productions of bread, beer\nand other grain based products. Scribal algebraic geometry formulas\ncreated cubit-cubits, khar, and hekat weight and measures units. A\ncubit-cubit contained 3/2 khar. A khar contained 20 hekat. A hekat\ncontained 4800 ccm. Theoretical and practical measurements of\ncubit-cubits, khar, 400-hekat, 100-hekat, 4-hekat, 2-hekat, 1-hekat,\n4-ro, 2-ro and 1-ro reported additional hekat sub-divisions. Smaller\nhekat units appear in , , and the .\n\nOverall scribal recorded weights and measures units in double-entry book\nbook keeping systems making scribes first accountants and second\nmathematicians. One inventory control method was discussed in one Rhind\nMathematical Papyrus problem. RMP 38 exposed as an aspect of trading\nunits by multiplying one hekat, 320 ro, by 7/22 reporting (101 +\n9/11)1-ro. Ahmes proved the accuracy of the answer by inverting 7/22 and\nmultiplying (101 + 9/11) by 22/7 returning 320 1-ro, adding a comment\nthat an exact hekat had been found.\n\nInside the partially decentralized economy discuss two absentee\nlandlords’ family and estate production and profit concerns in four\nletters. by Mahmoud Ezzamel appeared in the journal Abacus, Vol. 38, No.\n2 (2002), pp.235-262. Ezzamel, an accountant, shows that absentee\nlandlords relied on theoretical commodities and metals units that summed\nto a monetary system. Practical measurements issued payments to workers\nand implemented other management controls within rational number\nremainders written in Egyptian fractions. An abstract of Ezzamel’s\narticle follows: .\n\nThe Rhind Mathematical Papyrus (RMP) and the Moscow Mathematical\nPapyrus(MMP) precisely scaled grain to bread, beer and other products.\nPesu and sub-units (i.e besha, des-jugs) further scaled grain products\nfor practical distributions as wages. Gillings showed that alternando\nand dividendo, modern proportions, and a harmonic mean was used in bread\nand beer recipes. RMP and MMP problems reported 5 hekats of grain each\nproducing 200 loaves of bread. The balance of hekats, 10 hekats in the\nRMP and 11 hekats in the MMP produced beer. Each hekat produced one,\ntwo, and three types of beer, labeled from 8/3 pesu to 6 pesu, denoted\ninitial grain content by an inverse to the final product. A product with\n3/8 hekat of grain was reported as 8/3 pesu and written as 2 2/3 pesu.\n\nshowed in 2014 that the MMP partitioned 5 (4-hekat), 10 (4-hekat), 20\n(4-hekat) and 40 (4-hekat) by 2/3. For example 20 (4-hekat) mulltiplied\nby 2/3 = (16 1/4 + 1/16 + 1/64)(4-hekat) and (1 + 2/3) (4-ro), the same\npartition that 20 (1-hekat) x 2/3 = (16 + 1/4 + 1/16 + 1/64)(1-hekat) +\n(1 + 2/3)(1-ro) reveals. That is, scribal partitioning of small and\nlarge hekat volumes followed the same binary quotient and ro remainder\nintellectual process.\n\nAs additional background it is well known that before 2050 BCE Egyptians\nand Babylonians both used cursive algorithms to record numbers. After\n2050 BCE Babylonian numbers and math remained algorithmic. It is lesser\nknown that Egyptian numeration and math became non-algorithmic after\n2050 BCE. It is interesting to note that Egyptian cubic-cubits and khar\ntrading units may have extended to Babylon and Larsa in perfume trade\nreported by Robert Middeke Conlin in . The wider regional trading is\nincluded in ’s PHD thesis. The paper focuses upon perfume trade\ncontrolled from during the Egyptian Middle Kingdom period, 500 years\nbefore merged aspects of Egyptian and Babylonian business, science and\nmathematics, and 1000 years before Greek Demotic came into use.\n\nEqually important published in 2002 mentioning a political compromise\nthat encouraged absentee landlords to accumulate wealth. Egyptology and\neconomic historians debate the implications of the Heqanakht Papers\noften without stressing a central role of Egyptian fractions.\nIntellectually Egyptian fractions unified the newly decentralized\nEgyptian economy that created verifiable weights and measures units for\nelite participants. Morris Silver, Professor Emeritus, Department of\nEconomics, City College of the City University of New York, reviewed\nAllen’s book, adding several discussion points. also reviewed “The\nInvention of Coinage and the Monetization of Ancient Greece” by David M.\nSchaps in the same manner, adding meta and micro economic\nconsiderations. For example, aptly cited Babylonian (and Egyptian)\nmonetary systems that spread across the Ancient Near East using ’bags of\ncoins’ well before Lydia and Greeks were reported to have created\ncoinage.\n\nIn conclusion economic considerations motivated Pharaoh and elite\nabsentee landlords to control commodity inventories after 2050 BCE by\nimproving rounded off Old Kingdom weights and measures units. Middle\nKingdom fraction weights and measure were unitized in a finite\narithmetic system. Weights and measures units created double entry\naccounting entries that compared expected to actual usages of\ninventories. Scribal managers resolved differences by considering\nexpected (theoretical) daily usages by substituting (64/64) and 320 ro\nfor 1- hekat and 4-hekat unities and rational two-part binary quotients\nand 1-ro and 4-ro remainders. The hekat unit was one of several keys to\nthe Egyptian fraction system. Wages were paid in equivalent grain units\nof bread and other products was another key. The Heqanakht Papers\ndocuments absentee landlords, politically supported by Pharaoh, to gain\nprofits and reduce payments to workers during flood years to avoid\nlosses.\n\n[9]{} A.B. Chace, Bull, L, Manning, H.P., Archibald, R.C., *The Rhind\nMathematical Papyrus*, Mathematical Association of Amnerica, Vol I,\n1927. NCTM reprints available. Milo Gardner, *An Ancient Egyptian\nProblem and its Innovative Solution, Ganita Bharati*, MD Publications\nPvt Ltd, 2006. Richard Gillings, *Mathematics in the Time of the\nPharaohs*, Dover Books, 1992. Oystein Ore, *Number Theory and its\nHistory*, McGraw-Hill Books, 1948, Dover reprints available. T.E. Peet,\n*Arithmetic in the Middle Kingdom*, Journal Egyptian Archeology, 1923.\nTanja Pommerening, *“Altagyptische Holmasse Metrologish neu\nInterpretiert” and relevant phramaceutical and medical knowledge, an\nabstract, Phillips-Universtat, Marburg, 8-11-2004, taken from \"Die\nAltagyptschen Hohlmass*, Buske-Verlag, 2005. Gay Robins, and Charles\nShute *Rhind Mathematical Papyrus*, British Museum Press, Dover reprint,\n1987. L.E. Sigler, *Fibonacci’s Liber Abaci: Leonardo Pisano’s Book of\nCalculation*, Springer, 2002. Hana Vymazalova, *The Wooden Tablets from\nCairo:The Use of the Grain Unit HK3T in Ancient Egypt, Archiv\nOrientalai*, Charles U Prague, 2002.\n\nLinked Reference 1: (published 2006)\n\nLinked Reference 2: (Dec. 6, 2010)\n\nLinked Reference 3(submitted for publication May 2011)",
  "language": "INFORMAL",
  "phrase": "Economic Context Of Egyptian Fractions",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/EconomicContextOfEgyptianFractions"
    }
  ],
  "indexable": true
}