{
  "alternatePhrases": [
    "unit fraction series"
  ],
  "definition": "This narrative reports rational number as a/b rather than in the\nstandard LaTeX fraction form.\n\nPrior to 2050 BCE Old Kingdom Egyptian scribes rounded off rational\nnumbers to six-terms binary representations for 1,000 years. The binary\nnotation was stated in 1/2n units with a 1/64 unit thrown away. The\nrecorded rational numbers in the cursive pattern:\n\n1 = 1/2 + 1/4 + 1/8 + 1/16 + 1/32 + 1/64 + (1/64).\n\nNote that a potential 7th term (1/64) was rounded-off and thrown way.\n\nAfter 2050 BCE an exact numeration system discontinued the rounded-off\nOld Kingdom binary system. An exact hieratic weights and measures system\nreported rational numbers in 1/64 quotient and 1/320 remainder units\nwhenever possible.\n\nThe new Middle Kingdom math system “healed” rounded off binary series by\nseveral finite methods. Two weights and measures finite systems can be\nreported by:\n\n1\\. 1 hekat (a volume unit) used a unity (64/64)such that (32 + 16 + 8 +\n4 + 2 + 1/64)hekat+ 5 ro\n\nand (1/2 + 1/4 + 1/8 + 1/16 + 1/32 + 1/64)hekat + 5 ro\n\nmeant (64/64)/n = Q/64 + (5R/n)ro\n\nNote that the hekat unity was generally divided by rational number n. To\ndivide by 3 scribal long-hand would have written out\n\n(64/64)/3 = 21/64 hekat + 5/192 = (16 + 4 + 1)/64 hekat + 5/3 ro =\n\n(1/4 + 1/16 + 1/64)hekat + ( 1 + 2/3)ro\n\n2\\. (100-hekat)/70 = (6400/64)/70 = 91/64 hekat + 30/4480 = (64 + 16 + 8+\n2 + 1)/64 hekat + 150/70 ro =\n\n(1 + 1/4 + 1/8 + 1/32 + 1/64)hekat + (2 + 1/7)ro\n\nmeant (6400/64)/n = Q/64 + (5R/n)ro was applied for almost any hekat\ndivision problem.\n\nThe hieratic word ro meant 1/320 of a hekat in a grain weights and\nmeasures system. Note that 5 ro meant 5/320 = 1/64.\n\nGenerally, scribal shorthand recorded duplation aspects of mental\ncalculations and fully recorded two-part hekat quotients and ro\nremainders.\n\nAt other times 2/64 was scaled to 10/320 such that (8 + 2)/320 = 1/40 +\n2 ro\n\nThe 1900 BCE Akhmim Wooden Tablet (AWT) scaled two volume units in the\nEgyptian fraction notation that allowed Hana Vymazalova in 2002 CE to\nopen a long lost (64/64) hekat unity aspect of Egyptian fraction weights\nand measures.\n\nIn 2006 scholars showed that the AWT scribe divided (64/64) by 3, 7, 10,\n11 and 13 by writing exact 1/64 quotients and (5/5) scaled remainders to\n1/320 unit fraction series. Each AWT answer was proven by multiplying by\nthe divisor returning (64/64) the initial hekat unity, the central point\nmade by Vymazalova.\n\nA complete decoding of the AWT scribal methodology documented a solution\nto an Old Kingdom binary round-off problem. Ahmes used the AWT method\nover 40 times, scaling a 1/10 hin unit to 1/320 ro unit 29 times, as\nwell as solving several classes of problems.\n\nOn a higher numeration level the finite hieratic system scaled rational\nnumbers by least common multiple (LCM) m to optimized, but not optimal,\nunit fraction series. Middle Kingdom scribes scaled rational numbers to\nunit fraction series by the LCM that created a in the AWT and other\nhieratic texts. The Egyptian fraction numeration system ciphered\ncounting numbers 1:1 onto hieratic sound symbols replacing an Old\nKingdom hieroglyphic many-to-one system numbers written in rounded-off\nbinary numbers. A line was drawn over hieratic sound symbols to denote\nunit fractions. reported the significance of the ciphered numeration\nsystem. represented rational numbers in ordered unit fraction series,\nwriting the smallest to the largest unit fraction, from left to right.\n\nOne purpose of the Egyptian fraction system involved a finite weights\nand measures system applied to a commodity based monetary system\nestablished by Pharaoh. One theoretical aspect of the monetary system\ncontained Egyptian operations. The scribal arithmetic was undervalued by\nhistorians for over 120 years, from 1879 to 1999, by only reporting the\nadditive aspects of the raw transliterated data.\n\nScribal unit fraction answers contained two sides, additive numerators,\nand LCM scaled reminders. Math historians, beginning with F. Hultsch in\n1895, parsed aspects of the scribal aliquot part views of numerators and\nLCM denominators, though the unified aspects of the system remained\nvague for another 105 years. In 2002, the EMLR was validated containing\naliquot parts of LCM denominators in none optimized manners. The LCM\n(m/m) was written as a unity becoming a multiplier that scribes used to\nscale rational numbers to optimized, but not optimal, unit fraction\nseries in 2/n table tables and every day problem and answers. In 2006\nthe Akhmim Wooden Tablet was validated containing exact quotient and\nremainders within its primary division division method, ancient\nfragments documented in the EMLR and RMP 2/n table. The EMLR and RMP 2/n\ntable were fully decoded in as reported in Appendix I and II.\n\nDuring the Old Kingdom hieroglyphic writing scribes threw away 1/64\nunits within a 6-term binary notation named Horus-Eye. Around 1950 BCE\nthe Akhmim Wooden Tablet (AWT) reported a hekat unity system solving the\nOld Kingdom round-off problem. Corrected volume units added back missing\n1/64 units. Within the corrected notation multiplication of 400-hekat,\n100-hekat, 4-hekat and 1-hekat substituted two classes of hekat units,\none hekat = (64/64) (defined in the AWT and RMP 47) calculated binary\nquotients (Q/64) and scaled Egyptian fraction remainders (5R/n)ro; and\none hekat = 320 ro (in RMP 35-38).\n\nConcerning hekat arithmetic details, the discuss the hekat unity. The\nunity was partitioned by rational numbers. Multiplication and division\nanswers recorded binary quotients and scaled (5R/n)ro Egyptian fraction\nremainders, hekat units as 1/10 (hinu), 1/64 (dja), 1/320 (ro), and\nother units within modified quotients and remainders. The secondary\nhekat system converted m/n to integer quotients and non-scaled Egyptian\nfraction remainders written as m/n “name”. For example, Ahmes created\n1/10 units writing m = 10 and n= 3 by using the expression 10/3 hin,\nmeaning (3 + 1/3)hin.\n\nThe AWT’s binary quotient and Egyptian fraction partitions were proven\nby multiplying each quotient and remainder answer by the initial\ndivisor. The exact proof calculation returned each quotient and scaled\nremainder answer to an initial (64/64) unity value. The AWT proof may be\nthe first proof recorded in Western math history. Ahmes applied the\nproof methid in RMP 35-38, 320 ro problems.\n\nLength and area units (cubits, khet, setat and mh) were partitioned into\n1/8 setat quotients and mh (1 cubit by 100 cubit strips) remainders.\ndiscuss Ahmes’ geometry and associated arithmetic.\n\nThe Reisner Papyrus(RP), circa 1800 BCE, defines a labor efficiency\ndivision by 10 quotient and unscaled remainder rate. The RMP’s first six\nproblems used the RP division by 10 method. The RMP is one of several\ntexts that confirm the scribal use of a second form of quotient and\nremainder arithmetic. Modern historians, going beyond 1920’s additive\ntransliteration limitations, by considering meta Egyptian fractions,\nagree with the RP method, and other forms of meta (unified) Egyptian\nfraction mathematics.\n\nA second purpose of the Egyptian fraction notation exactly solved one\nand two variable first degree algebra problems. Rational number answers\nwere written into integer quotients and Egyptian fraction remainders.\nThe Rhind Mathematical Papyrus () and the cite several problems and\nsolutions, each with hard-to-read intermediate steps reaching Egyptian\nfraction answers.\n\nA third purpose of the Egyptian fraction notation created a commodity\nand metal based monetary system. The system is outlined by Mahmoud\nEzzamel . Yet, Ezzamel fairly parses by discussing two absentee\nlandlords’ production and management considerations of profit written in\nancient Egyptian fractions.\n\nA fourth purpose of the Egyptian fraction notation that generally\nconverted rational numbers to optimized, but not optimal, unit fraction\nseries. The was written by Ahmes in 1650 BCE. Translators assumed that\nAhmes had intuitively used ’red auxiliary’ multiples to write optimized,\nbut not optimal, unit fraction series. When the RMP was first published\nin 1879, historians began the task of breaking the 2/n table code, a\nproject that was not completed until 2005. The earliest nearly\nsuccessful code breaking effort was published by F. Hultsch in 1895.\nWith E.M. Bruins confirming Hultsch’s aliquot part approach in 1944.\nToday F. Hultsch and E.M. Bruins are honored by the Hultsch-Bruins\nmethod.\n\nReturning to the 1650 BCE and the Rhind Mathematical Papyrus it began\nwith a 2/n table. A 200 year older text, the Egyptian Mathematical\nLeather Roll (EMLR) was a student’s introduction to the 2/n table\nsubject. A student converted 26 rational numbers to non-optimal Egyptian\nfraction series. The EMLR converted rational numbers such as 1/8 by\nusing multiples 3/3, 5/5 and 25/25. Two out-of order series are also\ndiscussed on .\n\nSeveral Egyptian unit fraction notations were continuously used from\n2050 BCE to 1637 AD. For about 3,700 years Egyptian fraction methods\nunitized rational numbers in nearby Mediterranean cultures. Greeks used\nthe hieratic numeration systems by mapping the counting numbers onto\nIonian and Dorian alphabets. Unit fractions were denoted by a Greek\nletter followed by ’, or beta’ = 1/2. Greeks, and Hellenes fully used\nthe Egyptian fraction method of converting rational numbers to Egyptian\nfraction series for several purposes altering Ahmes’ methods in minor\nways.\n\nArchimedes followed a one-fourth geometric series tradition established\nby Eudoxus that found the area of parabola first by an infinite series:\n\n4A/3 = A + A/4 + A/16 + A/64 + ...,\n\nand by second finite Egyptian fraction proof:\n\n4A/3 = A + A/4 + A/12\n\nHeiberg in 1906 reported Archimedes’ two-level calculus method decoded\nfrom an 1100 AD Byzantine vellum document.\n\nAround 800 AD a major change took place in the Mediterranean region.\nModern base 10 numerals diffused from India and Arab trade began to\nenter Europe. By 999 AD, a Catholic Pope adopted Arab mathematics with\nits base 10 numerals and Egyptian fraction arithmetic. By the time of\nLeonardo de Pisa, Fibonacci, and the 1202 AD Liber Abaci, European\nweights an measures were also written in Arabic numerals.\n\nIn 1585 AD, the beginning of our modern base 10 decimals, modern base 10\ndecimals literally erased 3,600 years of Egyptian fraction arithmetic\nhistory. By 1900 AD European and Arab scholars were unable to read\nmedieval Egyptian fractions texts as well as the older Egyptian\nmathematical texts.\n\nAhmes’ 84 problems have been slowly read by scholars after the RMP was\npublished in 1877. The 2/n table was key to scholar research. But what\nmethod or methods did Ahmes use to create his 2/n table? Ahmes seemingly\nleft few clues to assist scholars in decoding the 2/n table’s\nconstruction method(s). Post-1877 scholars relied on intuition and\npersonalized mathematical senses to report suspected details, often\nconfusing the subject. Scholarly debates have correctly focused on the\n2/n table and its construction methods. Yet, confirmed 2/n table threads\ncontinue to be controversial. Egyptologists, and math historians, i.e.\nNeugebauer, Exact Sciences in Antiquity, had inappropriately proposed\nthat the RMP 2/n table and related Egyptian fraction methods represented\nforms of intellectual decline.\n\nHowever, one simple RMP 2/n table construction method, multiples, was\nreported in 2002 that changed the debate. An advanced idea had created\nfinite unit fraction statements. By 2006 it was shown that Egyptian\nfraction statements had solved an Old Kingdom infinite series round-off\nproblem. Scholars continue to parse several theoretical fragments of a\ngroup of ancient texts by considering related arithmetic patterns. As a\nconsequence 130 years of confusion related to Egyptian fraction\narithmetic is lifting an intellectual fog.\n\nFor example, Ahmes, the RMP scribe, has gained the majority of scholarly\nattention since the RMP was published in 1877. Sylvester in 1891\nincorrectly suggested that the greedy algorithm was present in the\nmedieval Liber Abaci and by implication the RMP. Hultsch in 1895 began\nto parse Ahmes’ 2/p conversion patterns by using aliquot parts. It took\nBruins in 1944 to confirm Hultsch’s earlier work, now known as the H-B\nmethod.\n\nAhmes, therefore, converted 2/p rational numbers into optimal or elegant\nEgyptian fraction series using a form of the H-B method. Ahmes’\nshorthand indicated that 2/43, and other 2/n table members, were\nconverted to an Egyptian fraction series by selecting optimal multiples,\nin the 2/43 case the multiple 42. Ahmes use of the multiple 42 allowed\n1/42 to become the first partition. The remaining Egyptian fraction were\nfound by considering the divisors (aliquot parts) of 42 or (21, 14, 7,\n6, 3, 2, 1). Ahmes’ fragmented shorthand indicates:\n\n2/43\\*42/42 = (42 + 21 + 14 + 6)/(42\\*43),\n\nsuch that:\n\n2/43 = 1/42 + 1/86 + 1/129 + 1/301\n\nin clear hieratic script.\n\nToday, 20th century additive scholarly adherents oddly do not accept the\nH-B method, or related methods used by Egyptians, Greeks, Hellenes,\nArabs, medievals and others for over 3,000 years. It is clear that H-B\ntype methods used modern addition, subtraction, multiplication and\ndivision operations and correctly parse 3,700 years of rational numbers\nconversions to Egyptian fraction series. , the simplest method is likely\nthe historical method, is slowly changing scholarly minds.\n\nAs another long term verification of Ahmes’ arithmetic Fibonacci’s 1202\nAD reports a very old style of writing multiples within the first four\nof seven rational number conversion methods.\n\nSummary: Today, interdisciplinary studies groups are oddly created by\n’invitation only’. As meta aspects of ancient mathematics are randomly\nstudied, without invitation, based on reading entire bodies of\nmathematical texts, great academic progress in understanding ancient\nmathematics will take place. Currently, common abstract mathematics\nthemes are deposited in fragmented story lines, often transliterating a\nsmall set of the ancient records, not noticing closely related\nmathematical methods. Moreover, university math history and philology\ndepartments often do not professionally share common meta themes (found\nby parsing numerical data) even when their offices are in the same\nbuilding.\n\nBroadly considering Old Kingdom edicts several Pharaohs likely had\nrequested exact numerical systems to control and allocate vital\ninventories of grain and its products including beer and bread are often\nmentioned. Egyptian scribes exactly converted rational numbers to\noptimal or elegant unit fraction series. The Middle Kingdom innovation\nexactly scaled weights and measure units to two Egyptian fraction\nsystems, one defined in the Reisner Papyrus and the second in the Akhmim\nWooden Tablet.\n\nSince 2002 AD scholarly debates are increasingly correcting Middle\nKingdom shorthand omissions of Egyptian fraction mathematics by adding\nback the missing data in scribal longhand notations. The 2050 BCE point\nof departure date formalized Egyptian fraction innovations within\nabstract arithmetic and practical weights and measures notations. Greeks\nand Arab scribes modified the theoretical arithmetic and weights and\nmeasures notations. Medieval scribes by Fibonacci recorded Greek and\nArab versions of the oldest Egyptian fraction mathematics. For example,\nSigler’s 2002 translation of the 1202AD Liber Abaci includes four 1650\nBCE conversion methods. Fibonacci’s era used 3,000 year old Egyptian\nfraction conversion methods that modified an ancient multiplication\ncontext to a medieval subtraction context. Today, 20th century Egyptian\nfraction debates, that fragments analyzed mathematical theory and\npractical statements are being unified. The oldest Egyptian fraction\nmathematics are being connected to the medieval era in interesting ways.\nThe largest set of ancient texts that describe economic and weights and\nmeasures texts are linked to the 1950 BCE hieratic texts and to the 1202\nAD Liber Abaci. Over 3150 years of common uses of rational number and\nunit fraction monetary methods.\n\n[8]{} Mahmoud Ezzamel, *Accounting for Private Estates and the Household\nin the 20th Century BC Middle Kingdom*, Abacus Vol 38 pp 235-263, 2002\nMilo Gardner, *The Egyptian Mathematical Leather Roll Attested Short\nTerm and Long Term, History of Mathematical Sciences*, Hindustan Book\nCompany, 2002. Milo Gardner, *An Ancient Egyptian Problem and its\nInnovative Solution, Ganita Bharati*, MD Publications Pvt Ltd, 2006.\nRichard Gillings, *Mathematics in the Time of the Pharaohs*, Dover\nBooks, 1992. T.E. Peet, *Arithmetic in the Middle Kingdom*, Journal\nEgyptian Archeology, 1923. Tanja Pommerening, *“Altagyptische Holmasse\nMetrologish neu Interpretiert” and relevant phramaceutical and medical\nknowledge, an abstract, Phillips-Universtat, Marburg, 8-11-2004, taken\nfrom \"Die Altagyptschen Hohlmass*, Buske-Verlag, 2005. L.E. Sigler,\n*Fibonacci’s Liber Abaci: Leonardo Pisano’s Book of Calculation*,\nSpringer, 2002. Hana Vymazalova, *The Wooden Tablets from Cairo:The Use\nof the Grain Unit HK3T in Ancient Egypt, Archiv Orientalai*, Charles U\nPrague, 2002.",
  "language": "INFORMAL",
  "phrase": "Egyptian Fraction",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/EgyptianFraction"
    }
  ],
  "indexable": true
}