{
  "alternatePhrases": [],
  "definition": "Since the 1880s an incomplete and muddled view defined ancient Egyptian\nmultiplication and division operations. on-line encyclopedia summarizes\na 1920s view on :\n\nThe art of computation arose and developed before the time of the oldest\nwritten records. The oldest advanced mathematical records include the\nKahun (Cahoon) papyri and the famous Rhind papyrus, which, among other\npapyri, date to 2050 BCE. Earlier additive hieroglyphic arithmetic\nmethods represented numbers in ways that Old Kingdom Egyptians performed\naddition and subtraction operations in relatively simple ways. For\nexample, multiplication was carried out by doubling, i.e. the factors\nwere decomposed into sums of powers of two, the individual summands were\nmultiplied, and the components added. Operations on fractions were\nreduced in Ancient Egypt to operations on aliquot fractions. More\ncomplicated fraction operations were decomposed with the aid of tables\nas the sums of aliquot fractions.\n\nIn 1862 the first Egyptian text, the Berlin Papyrus, was published.\nFormal scholarly solutions appeared in 1900 with the work of\nSchack-Shackenberg. European scholars did not consider the Berlin\nPapyrus when 1920s transliterations of the RMP were published in\nincomplete additive versions of Egyptian multiplication. The 1920s\nhistorians had also not followed up a 1895 report (by F. Hultsch) that\nsuggested a second form of multiplication method was present in Ahmes’\n2/n table, and other RMP problems (i.e. RMP 38). The second method\nincluded aliquot parts, as Springer suggests above.\n\nAliquot part were reported by in 1895. Hultsch parsed Ahmes’ 2/n table\nrevealing scribal patterns of divisors of scaled rational number\ndenominators that parsed 2/n table data. Springer’s Egyptian\nmultiplication encyclopedia entry did not specify scribal aliquot part\ndetails a topic that was not resolved until the 21th century.\n\nAhmes’ aliquot part division steps, sensed in the 19th century, were not\ndecoded during the 20th century for several reasons. Two reasons\nmisdirected 1920s math historians by considering transliterations rather\nthan translations. The first class of reason prematurely closed the\nsubject of Egyptian fraction arithmetic operations by concluding\nEgyptian multiplication contained only additive steps. The Second class\nof reason scribal division was suggested have followed an non-inverse\nprocess called ’single false position’, or ’trial and error’ reported by\nscholars related to RMP 24-35, Ahmes’ algebra problems.\n\nThe aliquot part story line remained unsolved until 2008. Shortly after\n2002 the and the were decoded revealing two aliquot part operational\nmethods: (1) new inverse multiplication and division methods, and (2) a\nLCM number method written in red. The multiplication and division\nmethods had been hidden in same set of aliquot part operational steps,\nincluding steps. In 2006, the 1895 Hultsch-Bruins method was confirmed\nfrom a second direction, detailing a common aliquot method used in the\nRMP and Egyptian Mathematical Leather Roll, and published on-line in\n2008.\n\nSpringer’s summary of Egyptian multiplication and division followed the\nmisleading 1920s definition of Egyptian division suggesting: “Division\nwas carried out by subtracting from the number to be divided the numbers\nobtained by successive doubling of the divisor.” Math historians from\n1920 to 1990 (i.e.; Howard Eves) called the proposed Egyptian division\nmethod ’single false position’, and 1990 scholars (i.e. Spalinger)\ncalled the scribal information ’trial and error’. Ironically, ’single\nfalse position’ was first documented in 800 AD, and at no earlier data.\nLater Arab texts improved up its root finding ’double ’, method. ’Trial\nand error’ in Ahmes’ algebra problems selected LCM m to scale rational\nnumbers n/p to mn/pm, and therefore can not be a scribal division\nfragment.\n\nSpringer’s definition of Egyptian division was historically incomplete\non several levels. A complete definition of Egyptian scribal division\nshould include discussion of the first six RMP problems. RMP 1-6\nreported division by 10 labor rates defined in the . In addition, RMP\nalgebra problems and methods are consulted. For example, Ahmes divided\n28 by 97, in (confirmed in RMP 34) by solving: x + (2/3 + 1/2 + 1/7)x =\n33 and x + (2/3 + 1/2 + 1/7)x = 37 as other vulgar fraction problems\nwere solved in the Kahun Papyrus and Rhind Papyrus 2/n tables. Aliquot\npart steps were hidden in theoretical multiplication and division\noperations for over 100 years.\n\nAhmes, therefore, did not use ’single false position’ in any arithmetic\noperation, a point made by Robins-Shute in 1987. The 1920s ’false\nposition’ and 1990 ’trial and error’ scholarly ideas were false\nsuppositions. For example, 28/97, in RMP 31, and data from RMP 21- 23\nexpose Ahmes’ LCM method. In RMP 23 where 45 was introduced solving most\nof the problem, but 360 was needed to Ahmes to complete the problem as\nall other algebra problems were solved.\n\nIn the 21st century, Ahmes is being reported converting vulgar fractions\ninto optimized unit fractions series within a LCM m multiplication\nmethod. The LCM method replaced the aliquot parts of the denominator in\nthe numerator. To convert 2/97 in RMP 31, and the 2/n table. Ahmes\nconverted 28/97 into two problems, 2/97 and 26/97, such that:\n\n1\\. To convert 2 by 97: As Ahmes’ 2/n table wrote for all 2/n conversions\nless than 2/101, he first selected a highly divisible number m as an\noptimizing multiplier m/m. In the 2/97 case 56 was selected, creating a\nmultiplier 56/56 such that the aliquot parts of 56 (28, 14, 8, 7, 4, 2,\n1) were introduced into the solution by writing:\n\n2/97\\*(56/56) = 112/(56\\*97) = (97 + 8 + 7)/56\\*97)\n\nand,\n\n2/97 = 1/56 + 1/679 + 1/776\n\n2\\. To convert 26/97 Ahmes looked for a multiplier m/m that would\nincrease the numerator to greater than 97. Ahmes found 4/4. By\nconsidering the aliquot parts of 4 (4 , 2, 1) Ahmes wrote out:\n\n26/97\\*(4/4) = 104/(4\\*97)= (97 + 4 + 2 + 1)/(4\\*97)\n\nsuch that:\n\n26/97 = 1/4 + 1/97 + 1/194 + 1/388\n\nand,\n\n3\\. Ahmes combined steps 2/97 and 26/97 into one Egyptian fraction series\nby writing:\n\n28/97 = 1/4 + 1/56 + 1/97 + 1/194 + 1/388 + 1/679 + 1/77\n\n’Single false position’ was false 20th century supposition that failed\nto parse Ahmes’ actual division operation. Ahmes division operation is\ncorrectly parsed as inverse to Egyptian multiplication. Egyptian scribes\napplied theoretical ideas in to convert rational numbers to Egyptian\nfractions.\n\nIn, a hekat was replaced by its 1/320 unit equivalent, 320 ro. In RMP.\n10 hekat, 3200 ro, was divided by 365, the number of civil days in the\nyear obtaining:\n\n8 + 280/365\n\nthe expected daily use of fat.\n\nThe quotient 8 was proven by the binary steps 1 - 365, 2 - 730, 4 -\n1460, and 8 - 2920. The remainder 280 (3200 - 2920 = 280). Translated to\nmodern notation Ahmes’ proof multiplied the initial divisor 365 by (8 +\n2/3 + 1/10 + 2190) summing (2920 + 243 1/3 + 36 1/2 + 1/6) obtaining\n3200 ro, the exact initial value of 10 hekat of fat.\n\nRMP 38 reported Ahmes multiplying 320 ro, one hekat, by 7/22, obtaining\n101 9/11. The 101 9/11 answer was proven by multiplying 101 9/11 by\n22/7, with the initial divisor 7/22 parsed by binary steps 34/11 times\n1/10 = 7/22 showing that inverse multipliers define division, one of\nseveral modern arithmetic ideas that were anticipated by Ahmes.\n\nEgyptian division was an inverse of Egyptian multiplication, reported in\nthe RMP and the 1900 BCE (AWT) and other Middle Kingdom texts.\n\nConclusion: To parse ancient Egyptian multiplication and division\nwritten with a weights and measures context , Ahmes’ 2/n table and other\narithmetic operations must be stripped away to reveal rational numbers.\nAhmes multiplication and division of rational numbers were inverse to\neach other.\n\nEgyptian multiplication contained two aspects, a theoretical side, and a\npractical side. Egyptian division was an inverse of Egyptian\nmultiplication, and visa verse. Prior to the 21st century AD Egyptian\nmath scholars had not considered theoretical aspects of the RMP and\nother Egyptian texts. Theoretical definitions hid an aliquot part and\nother arithmetic definitions, two being a hekat unity stated as (64/64),\nand a hekat stated as 320 ro. Egyptian division was quotient and exact\nremainder based, aspects that scholars are increasingly studying, linked\nto aliquot parts, 2/n tables, and other ancient scribal applications,\nsuch as weights and meaures, after 2005.",
  "language": "INFORMAL",
  "phrase": "Egyptian Multiplication And Division",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/EgyptianMultiplicationAndDivision"
    }
  ],
  "indexable": true
}