{
  "alternatePhrases": [],
  "definition": "ABSTRACT: The Egyptian Mathematical Leather ROLL (EMLR) was a 1900 BCE\ntext that may have been written as late as 1650 BCE. The 26 line text\noffered conversions of 21 1/p and 1/pq unit fraction series. The text\ndemonstrated six classes of conversion rules as predicates to a single\nand double least common multiple (LCM) rule. The single LCM rule\ndemonstrated that 1/p was scaled by LCM m to m/mp that obtained concise\nand non-concise unit fraction series. The double LCM aspect of the rule\nintroduced the student to a hekat double LCM scaling method. The EMLR\nscribe did not use red ink numbers as the Ahmes, the Rhind Mathematical\nPapyrs (RMP) scribe used in RMP 36 and RMP 37 (two problems that\nrigorously defined the Middle Kingdom LCM scaling rule).\n\nINTRODUCTION: The has been housed at the British Museum since 1864. The\nEMLR and the Rhind Mathetical Papyrus(RMP) were placed at the BM by the\nfamily of Henry Rhind. The leather roll was softened and unrolled in\n1927, almost 50 years after its sibling document, the RMP, was pirated\nfrom the British Museum and published in Germany in 1879.\n\nThe first chapter included two Berlin Papyrus second degree equations\nwas opened to scholarly discussions/debate in 1860, was resolved in 1900\nby considering the pesu as an inverse proportion. The RMP 2/n table\nopened a second chapter that decoded Egyptian mathematics was resolved\nin 2006 by considering LCM m. The 50 member Rhind Mathematical Papyrus\n(RMP) 2/n table demonstrated that optimized LCMs scaled 2/p to 2m/mp\nsuch that concise unit fraction series were obtained. The RMP conversion\nrule, demonstrated in RMP 36 and RMP 37, denominator mp was factored\ninto prime divisors. The scribe then selected the best divisors in red\nink that summed to numerator mp and thereby obtained concise and not-so\nconcise unit fraction series.\n\nScholars reported the EMLR’s arithmetic relationships that\nunintentionally overlooked theoretical aspects of unit fraction series.\nOther theoretical aspects of the and the RMP’s 87 problems continue to\nbe overlooked by staff of the BM in 2010 clearly documents.\n\nUPDATES TO A 2004 EMLR PAPER: The EMLR text was an introduction to\nEgyptian fraction mathematics. Six scribal methods non-optimally\nconverted 1/p and 1/pq to 26 awkward-looking unit fraction series by\napplying LCM m, a scaling factor. LCM m scaled rational numbers 1/2n,\n1/p, and 1/pq to m/2mn, m/mp and m/mpq by six rules:\n\na\\. (1/2n)(m/m)to m/2mn\n\nwith divisors of denominator 2mn selected that summed to numerator m and\na unit fractions series.\n\nb\\. (1/p)(m/m) to m/mp\n\nwith divisors of denominator mp that summed to numerator m and a unit\nfraction series.\n\nc\\. (1/pq)(m/m) to mp/mpq\n\nwith divisors of denominator mpq that summed to numerator mp and a unit\nfraction series. , d. (1/8)(25/8) to 25/200 to (8 + 17)/200 to 1/25 +\n17/200 demonstrates the rule.\n\ne\\. (17/200)(6/6) to 102/1200 to(80 + 16 + 6)/1200 = 1/15 + 1/75 + 1/200\ndemonstrates the rule.\n\nf\\. 1/8 = 1/25 + 1/15 + 1/75 + 1/2009 demonstrates a rule used to scaled\nthe hekat.\n\nRules d, e, and f show that LCM 25 scaled 1/18 and1/16 before 1/25 was\nsubtracted calculating remainders 17/200 and 17/400. The remainders were\nscaled by LCM 6 thereby calculating three of the four unit fractions in\nthe series, as the hekat remainders were scaled by 5/5 to ro 1/320th of\na hekat units.\n\nScholars before 2002 considered the EMLR as a possible decoding door to\nRMP 2/n table construction methods. But no door was opened until the\nabove six EMLR rules converted 22 rational numbers, 1/8 three times, 1/7\ntwo times, and 1/16 two times, reported 26 non-optimized patterns in\n2002.\n\nFrom 2004 to 2006 the EMLR was suggested to include 1/p = 1/A x A/25,\nwith 1/8 = 1/25 x 25/8.\n\nBy 2006 an “Occam’s Razor” update showed that 20 rational numbers were\nmultiplied by one of seven LCM m: 2, 3, 5, 6, 7, 10, and 25, written as\n2/2, 3/3, 5/5, 6/6, 7/7, 10/10 and 25/25. Each conversion obtained an\nawkward-looking unit fraction series showing that scribal students\neasily converted unit fractions to other unit fraction series.\n\nA deeper problem of selecting the best series was resolved by creating\n2/n tables. One recent suggests:\n\n1/28 = \\[1/(a + b)\\](1/a + 1/b) = \\[1/(4 + 7)\\](1/4 + 1/7) = 1/44 + 1/77\n\na relationship that the EMLR student or Ahmes may have used to convert\n2/35 and 2/91 discussed by:\n\n2/35 = \\[2/(5 + 7)\\](1/5 + 1/7) = (1/6)(1/5 + 1/7) = 1/30 + 1/42\n\n2/91 = \\[2/(7 + 13)\\](1/7 + 1/13) = (1/10)(1/7 + 1/13) = 1/70 + 1/130\n\nHowever, Ahmes shorthand notes cited 6/210 related to the 2/35\nconversion\n\n2/35(6/6)= 12/210 = (7 + 5)/210 = 1/30 + 1/42\n\na LCM m relationship that hold for\n\n2/91(10/10) = 20/910 = (7 + 13)/910 = 1/70 + 1/130\n\nHence, the reader must decide which approach was the historical method.\nFor myself, Occam’s Razor points in the LCM m scaling direction.\n\nWrapping up, the EMLR student used one LCM 23 times, and two LCMs twice,\nthat computed 26 non-optimal Egyptian fraction series. For example, 1/8\nwas converted by LCM 3, 5, 6 and 25. LCM 3 and 5 obtained non-optimal\nEgyptian fraction series by:\n\n(1/8)(3/3) = 3/24 = (2 + 1)/24 = 1/12 + 1/24,\n\n(1/8)(5/5) = 5/40 = (4 + 1))/40 = 1/10 + 1/40, and\n\nTwo multiples, 25 and 6, created an out-of-order series:\n\nmultiple one: 1/8(25/25) = 25/200 = (17 + 8)/200 = 17/200 + 1/25\n\nmultiple two: 17/200(6/6) = 102/1200 = (80 + 16 + 6)/200 = (1/15 + 1/75\n+ 1/200\n\nfinal answer: 1/25 + 1/15 + 1/75 + 1/200\n\nFootnote one: a modified method converted 28/97 in RMP 31 and 30/53 in\nRMP 36 by converting 2/97 + 26/97 in RMP 31 and 2/53 + 28/97 in RMP 36\nby two LCMs. In RMP 31 2/97 was scaled by 56/56 and 26/97 was scaled by\n4/4; and in RMP 36 2/53 was scaled by 30/30 and 28/53 was scaled by 2/2.\n\nAt one time it was suggested that another two step method had decreased\nthe denominator by:\n\nmultiple one: 1/8(25/25) = 25/200 = (24 + 1)/200 = 24/200 + 1/200;\n\nfactor by 1/5: 24/200 = 1/5\\*(3/5);\n\nmultiple 3:1/5\\[3/5\\*(3/3)\\]\n\nfinal answer: 1/15 + 1/25 + 1/75 + 1/200,\n\nwith the out-of-order unit fractions denoting an unknown two-phase\nmethod.\n\nLCM 6 converted rational numbers 1/7, 1/9, 1/11 and 1/15 by:\n\n1/7(6/6)= 6/42 =(3 + 2+ 1))/42 = 1/14 + 1/21 + 1/42,\n\n1/9(6/6)= 6/54 = (3 + 2 + 1)/54 = 1/18 + 1/27 + 1/54,\n\n1/11(6/6)= 6/66 =(3 + 2 + 1)/66 = 1/22 + 1/33 + 1/66,\n\n1/15(6/6)= 6/90 = (3 + 2 + 1)/90 = 1/30 + 1/45 + 1/90.\n\nInterestingly, the EMLR student wrote out an error\n\n1/13 = 1/28 + 1/49 + 1/96 = 3/49.\n\nrather than the implied 3/39, an impossible vulgar fraction to convert\nto a unit fraction series.\n\nAny one of three othwe LCMs 6, 12 and 14 scale 1/13 to solvable vulgar\nfraction series 6/78, 12/156 and 14/182\n\nThe student could have written\n\n1/13(6/6) = 6/78 = (3 + 2 + 1)/78 = 1/26+ 1/52 + 1/78\n\n1/13(12/12) = 12/156 = (6 + 3 + 2 + 1)/156 = 1/26 + 1/52 + 1/78 + 1/156\n\nand LCM 14 by an unlikely (n + 1) pattern that coincides with four\npatterns. The (n + 1) pattern was generalized in the RMP by 14 LCMs.\n\nThe EMLR student therefore could have written:\n\n1/13(14/14) = 14/182 = (13 + 1)/182 = 1/14 + 1/182\n\nFootnote two: Looking forward to the RMP the LCM m pattern was modified\n20 times in the that easily converted 2/p and n/p rational numbers to\nconcise unit fraction series. The modified RMP LCM m pattern was\nreported 3,000 years later as one of Fibonacci’s seven methods.\n\nOverall, the EMLR reported 22 unit fractions, prime, and composite\ndenominators, converted to Egyptian fractions by using eight least\ncommon multiples: 2, 3, 4, 5, 6, 7, 10, and 25, including a two phase\nmultiples 25 and 6 method (that converted 1/8 and 1/16).\n\nA broader narrative describing the EMLR is the found on .\n\nAn EMLR error incorrectly scaled rational number 1/13. The error showed\nthat the student was not ready to graduate, or, as equally likely, an\nintroduction to an advanced conversion method that was not understood.\n\nAn updates in 2011 shows that six EMLR conversion methods connect to\nthree advanced RMP conversion methods. For example the two out-of-order\nEMLR series\n\n1/8 = 1/25 + 1/15 + 1/75 + 1/200\n\nand\n\n1/16 = 1/50 + 1/30 + 1/150 + 1/400\n\nwere each scaled by LCM 25 and LCM 6 as an introduction to the second\nRMP rule\n\nn/p = (n -2)/p + 2/p\n\na method that used two LCMs (examples 30/53 (RMP 36) and 28/97(RMP 31).\n\nFootnote three: Advanced Egyptian scribes converted 2/n, n/p, and n/pq\nto short and concise unit fraction series. Scribes were expected to\nconvert small and large rational numbers to concise Egyptian fraction\nseries as needed. Egyptian fraction scribes were introduced to\nnon-optimal conversions in the EMLR and advanced conversions in the ,\nand a Greek Hibeh Papyrus n/45 table.\n\nCONCULSION: The EMLR is a 4,000 year of leather roll that demonstrated\nthat 26 rational numbers were converted to non-optimal unit fraction\nseries by a single LCM m such that 1/p x (m/m) = m/mp before inspecting\nthe divisors of mp that summed to numerator m. Six introductory LCM\nrules considered 8 LCMs and more than 8 sets of red auxiliary numbers\nthat summed to numerator m. LCMs and red auxiliary numbers were not\nexplicitly included in the EMLR. The EMLR scribe converted 26 rational\nnumbers Egyptian fraction series by applying six closely related\nconversion rules. The six rules validated that unit fractions 1/p and\n1/pq were scaled to solvable exact unit fraction series as needed. Three\nof six EMLR rules scaled 1/8 and 1/16 by a pair of multiples, 25 and 6.\nThe two LCM rule anticipated the second of three advanced RMP conversion\nrules: n/p = 2/p + (n -2)/p was also solved by two LCMs showed that\nscribes could select between alternatives. The EMLR was written by a\nstudent that may have gone on and learned Kahun Papyrus and RMP 2/n and\nn/p conversion rules and became a professional scribe.\n\n[6]{} Milo Gardner, *The Egyptian Mathematical Leather Roll Attested\nShort Term and Long Term, History of Mathematical Sciences*, Hindustan\nBook Company, 2004. Milo Gardner, *“Mathematical Roll of Egypt”,\nEncyclopaedia of the History of Science, Technology, and Medicine in\nNon-Western Cultures*, Springer, 2005 Richard J Gillings, *The Egyptian\nMathematical Leather Roll*, Australian Journal of Science 24 pgs\n339-344, 1962. Richard J Gillings, *The Egyptian Mathematical Leather\nRoll*, Archive for History of Exact Sciences pgs 291-298, 1974 Richard J\nGillings, *The Egyptian Mathematical Leather Roll Line 8, how did the\nScribe do it?*, Historia Mathematica pgs 456-457, 1981. S.R.K Glanville,\n*“Mathematical Leather Roll in the British Museum”*, Journal of Egyptian\nArchaeology pgs 232-8, 1927",
  "language": "INFORMAL",
  "phrase": "Egyptian Mathematical Leather Roll",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/EgyptianMathematicalLeatherRoll"
    }
  ],
  "indexable": true
}