{
  "alternatePhrases": [
    "\\'{E}lie Joseph Cartan"
  ],
  "definition": "Élie Joseph Cartan\n==================\n\nFrench mathematician and mathematical physicist;\\\nBorn: April 9th, 1869 in Dolomieu (near Chambéry), Savoie, Rhône-Alpes,\nFrance.\\\nDied: May 6th, 1951 in Paris, France.\\\nHis brother, Louis–a member of the ‘underground’ French Resistance– was\nbeheaded by the Nazis in December 1943.\n\nFormal studies:\n---------------\n\nSchool inspector Dubost was impressed by Élie Joseph Cartan’s abilities\nand obtained state funds that paid for Élie to attend the Lycée in\nLyons, completed with ‘distinction in Mathematics’. The state stipend\nwas then extended in order to allow him to study at the École Normale\nSupérieure in Paris.\n\n1.  Doctoral student in Paris at the École Normale Supérieure in 1888;\n\n2.  Doctorate in 1894\n\nAcademic Appointments:\n----------------------\n\n1.  1894–1896 Faculty appointment at the University at Montpellier\n\n2.  1896–1903 Lecturer appointment at the University of Lyon\n\n3.  1903–1909 Professor at the University of Nancy\n\n4.  1909–1912 Lecturer at the Sorbonne in Paris\n\n5.  1912–1920 Chair of Differential and Integral Calculus in Paris\n\n6.  1920–1923 Professor of Rational Mechanics at the Sorbonne in Paris\n\n7.  1924–1940 Professor of Higher Geometry at the Sorbonne in Paris\n\n8.  1940: Emeritus Professor at 71.\n\nHis son, Henri Cartan, later produced brilliant work in Mathematics; he\nwas a close mentor and early coworker of the German-born, (perhaps\ngreatest) French mathematician Alexander Grothendieck. Henri Cartan\nwrote about : “[*\\[My father\\] knew more than I did about Lie groups,\nand it was necessary to use this knowledge for the determination of all\nbounded circled domains which admit a transitive group. So we wrote an\narticle on the subject together \\[Les transformations des domaines\ncerclés bornés, **C. R. Acad. Sci. Paris**: 192 (1931), 709-712\\]. But\nin general my father worked in his corner, and I worked in mine.”*]{}\n\nResearch Results:\n-----------------\n\nÉlie J. Cartan achieved a mathematical synthesis of continuous groups,\nLie algebras and differential equations; he also produced a complete\nTheory of Spinors of fundamental interest both in Mathematics and\nMathematical Physics. He also produced results on the representations of\nsemisimple Lie groups; he then developed applications of to the theory\nof exterior differential forms. Between 1894 and 1904 he applied his\ntheory of exterior differential forms to a wide variety of problems in\ndifferential geometry, classical dynamics, special and general\nrelativity (for example, v. Spinor Theory invented by him in 1913; É.\nCartan published the two volume work Lecons sur la théorie des spineurs\nin 1938).\\\nAnother great French mathematician Jean Dieudonné wrote about Élie J.\nCartan :\\\n“[*He discussed a large number of examples, treating them in an\nextremely elliptic style that was made possible only by his uncanny\nalgebraic and geometric insight and that has baffled two generations of\nmathematicians. ”*]{}\n\nIn 1945 E.J. Cartan published the book [*“Les systémes différentiels\nextérieurs et leurs applications geométriques”*]{}.\n\nHonors and Awards:\n------------------\n\nLate in his life, Élie Cartan received many awards and honors; only the\nmost prominent ones are listed here. Honorary degrees from the\nUniversity of Liege in 1934, and from Harvard University in 1936.\\\nHe was elected to the French Academy of Sciences on March 9th, 1931 and\nhe was Vice-President of the Academy in 1945 and President in 1946. He\nwas awarded three honorary degrees in 1947 from the Free University of\nBerlin, the [*University of Bucharest, Romania*]{}, and the Catholic\nUniversity of Louvain, in Belgium. In 1948, he was awarded an Honorary\nDoctorate by the University of Pisa, Italy. He was elected a Fellow of\nthe Royal Society of London on May 1st, 1947, the Accademia dei Lincei\nand the Norwegian Academy.",
  "language": "INFORMAL",
  "phrase": "\\'{E}Lie Cartan",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/ElieCartan"
    }
  ],
  "indexable": true
}