{
  "alternatePhrases": [],
  "definition": "The sixteenth problem of the Hilbert’s problems is one of the initial\nproblem lectured at the International Congress of Mathematicians. The\nproblem actually comes in two parts, the first of which is:\n\n> The maximum number of closed and separate branches which a plane\n> algebraic curve of the $n$-th order can have has been determined by\n> Harnack. There arises the further question as to the relative position\n> of the branches in the plane. As to curves of the $6$-th order, I have\n> satisfied myself-by a complicated process, it is true-that of the\n> eleven branches which they can have according to Harnack, by no means\n> all can lie external to one another, but that one branch must exist in\n> whose interior one branch and in whose exterior nine branches lie, or\n> inversely. A thorough investigation of the relative position of the\n> separate branches when their number is the maximum seems to me to be\n> of very great interest, and not less so the corresponding\n> investigation as to the number, form, and position of the sheets of an\n> algebraic surface in space. Till now, indeed, it is not even known\n> what is the maxi mum number of sheets which a surface of the $4$-th\n> order in three dimensional space can really have.[@HD]\n\nand the second problem:\n\n> In connection with this purely algebraic problem, I wish to bring\n> forward a question which, it seems to me, may be attacked by the same\n> method of continuous variation of coefficients, and whose answer is of\n> corresponding value for the topology of families of curves defined by\n> differential equations. This is the question as to the maximum number\n> and position of Poincaré’s boundary cycles (cycles limites) for a\n> differential equation of the first order and degree of the form\n> $$\\frac{d\\;y}{d\\;x} = \\frac{Y}{X}$$ where $X$ and $Y$ are rational\n> integral functions of the $n$-th degree in $x$ and $y$. Written\n> homogeneously, this is\n> $$X\\left( y\\frac{d\\;z}{d\\;t} - z\\frac{d\\;y}{d\\;t}\\right)+\n> Y\\left( z\\frac{d\\;x}{d\\;t} - x\\frac{d\\;z}{d\\;t}\\right)+\n> Z\\left( x\\frac{d\\;y}{d\\;t} - y\\frac{d\\;x}{d\\;t}\\right)=0$$ where $X$,\n> $Y$, and $Z$ are rational integral homogeneous functions of the $n$-th\n> degree in $x$, $y$, $z$, and the latter are to be determined as\n> functions of the parameter $t$. [@HD]\n\n**The first part:**\\\n**The second part:**\\\nFind a maximum natural number $H(n)$ of the number of limit cycles and\nrelative position of limit cycles of a vector field $$\\begin{aligned}\n\\label{sys:pol_deg_n}\n\\dot{x} = p(x,y) &=&\\sum_{i+j=0}^n a_{ij}x^iy^j \\\\\n\\dot{y} = q(x,y) &=& \\sum_{i+j=0}^n b_{ij}x^iy^j.\\end{aligned}$$ [@DRR]\\\nAs of now neither part of the problem *(i.e. the bound and the positions\nof the limit cycles)* are solved. The difficulty of the problem can be\ndemonstrated by the fact that even the quadratic case $H(2)$ is not\nsolved (see Hilbert’s 16th problem for quadratic vector fields). The\nonly known case is the linear case where $H(1)=0$.\\\n**Definition:**\\\n$H(n)$ is called the *Hilbert number*.\\\n**Progress and attempts of the second part:**\n\n-   1923, $H(n)$ is finite for a polynomial system of degree $n$ (i.e.\n    finite number of limit cycle) by Dulac [@DH] (see Dulac’s Theorem).\n\n-   1981, An error is found in the proof of Dulac of Dulac’s Theorem by\n    Yulij Ilyashenko.\n\n-   1988, Jean Ecalle[@EJ], Jacques Martinet, Robert Moussu, Jean Pierre\n    Ramis and independently Yulij Ilyashenko[@IY91] prove Dulac’s\n    Theorem.\n\n-   1995, C. J. Christopher shows the following lower bound\n    $H(n)\\geq n^2\\log n$.[@CL]\n\n**See also:**\n\n-   David Hilbert,\n\n-   David Hilbert,\n\n-   Wikipedia,\n\n[10]{} , *Polynomial systems: a lower bound for the Hilbert numbers*,\nProc. Roy. Soc. London Ser. A 450 (1995), no. 1938, 219-224.\n\n, *Sur les cycles limite*, Bull. Soc. Math. France 51 (1923), 45-188.\n\n, *Introduction aux fonctions analysables et preuve constructive de la\nconjecture de Dulac*, Hermann, Paris, 1992.\n\n, *Mathematical Problems (translated by Dr. Maby Winton Newson)*,\nBulletin of the American Mathematical Society 8 (1902), 437-479.\n\n, *Finiteness theorems for limit cycles*, American Mathematical Society,\nProvidence, RI, 1991.\n\n, *Centennial History of Hilbert’s 16th Problem*, Bulletin of the\nAmerican Mathematical Society, Vol. 39, no. 3 (2002), 301-354.\n\nDumortier, F., Roussarie, R., Rousseau, C.: Hilbert’s 16th Problem for\nQuadratic Vector Fields. Journal of Differential Equations 110, 86-133,\n1994.\n\n**note:** Under construction! If someone can help with the first part\nthat would be great. I will add reference to the historical notes when I\ngo to school.",
  "language": "INFORMAL",
  "phrase": "Hilbert'S Sixteenth Problem",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/HilbertsSixteenthProblem"
    }
  ],
  "indexable": true
}