{
  "alternatePhrases": [
    "HTML"
  ],
  "definition": "[*Hypertext Markup Language*]{} (HTML) is an application of SGML for\ncreating documents to exchange over the Internet using the Hypertext\nTransfer Protocol (HTTP). Created by Tim Berners-Lee in the early 1990s,\nearly HTML was meant to describe document structure rather than document\nformatting. Berners-Lee intended HTML to enable scientists (physicists,\nbiologists, doctors, etc.) to publish research results and stay up to\ndate on relevant advances in their fields more quickly. As such, HTML\nprovided for almost all the document publishing needs of scientists: six\nlevels of headings, subscripts, superscripts, the letters of the Greek\nalphabet available by character entities, etc. What was missing was the\nability to include diagrams inline, which was solved by the addition of\nthe image tag, first proposed by Marc Andreessen in 1993.\n\nFor mathematics, and for some of the more theoretical branches of\nphysics, HTML did not provide enough: Simple superscripts and subscripts\nare insufficient for power towers (e.g., $2^{2^x} - 1$); tables are at\nbest a kludge for iterated sum and product notation; the providing of\nthe radical sign falls short for overlapping radicals such as in\n$\\sqrt{1 + \\sqrt{1 + \\sqrt{1 + \\sqrt{1 + \\sqrt{1 + \\ldots}}}}}$; etc. To\naddress these deficiencies, MathML was created in 1999, but it has yet\nto catch on even among mathematicians.\n\nThe HTML basics can be easily learned in about ‘5 minutes’; automatic\nconversions from plaintext or Microsoft Word documents to HTML are\nreadily available.\n\nFor math resources on the Web HTML remains the preferred format. The two\nmajor strategies for dealing with HTML’s mathematical formatting\ndeficiencies are: 1) Writing formulas in the way they would appear in\nsome computer programming language, or in TeX (Steve Cheng and others\nhave developed Web browser plug-ins that parse and render TeX found on\nHTML pages); this is the strategy adopted by the OEIS. 2) Turning\nmathematical formulas into bitmap images, sometimes providing the\nunderlying TeX command as a tooltip (this helps computerized\nsearchability, but presents somewhat of an obstacle for cutting and\npasting for citations); this is the strategy adopted by MathWorld and\nPlanetMath (though PlanetMath also offers the option of viewing an\nentire document as a bitmap or as TeX source).",
  "language": "INFORMAL",
  "phrase": "Hypertext Markup Language",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/HypertextMarkupLanguage"
    }
  ],
  "indexable": true
}