{
  "alternatePhrases": [],
  "definition": "(From Wikipedia)\n\nThe Kahun Papyyrus was discovered by Flinders Petrie in 1889. The\nfragmented hieratic text dates to 1825 BCE Egypt and includes\nmathematical and medical topics. Most Kahun fragments are kept at the\nUniversity College London date to the reign of Amenemhat III. One of the\nfragments referred to as the Kahun Gynaecological Papyrus dealt with\ngynecological illnesses and conditions.\n\nA second fragment began with a brief 2/n table. Middle Kingdom scribal\nconverted rational numbers 2/n to exact and concise unit fraction series\nas the RMP scribe followed 200 years later. The KP 2/n table converted\n2/3, ..., 2/21 to concise unit fraction series and implied n/p\nconversions in shorthand proofs as the RMP scribe also demonstrated.\n\nA longer Rhind Mathematical Papyrus (RMP) 2/n table converted 50\nrational numbers, 2/3, ..., 2/101 to concise unit fraction series. A\nlonghand LCM m conversion method waa defined in . The method scaled n/p\nby LCM m to mn/mp with the best divisors of mp recorded in red auxiliary\nnumbers that summed to numerator mn calculated exact and concise unit\nfraction series.\n\nA. Considering KP arithmetic and arithmetic progressions the raw data\ncontained finite arithmetic operating components. Arithmetic\nprogressions and geometric proportions were the highest forms of\nEgypotian mathematics. The KP scribe defined a 10-term arithmetic\nprogression summed to 100, with a difference (d) of 5/6. The KP\narithmetic progression was discussed in two RMP problems.\n\nScribal arithmetic progressions were also found in the RMP. Ahmes listed\ntwo columns of data (published by Gillings in 1972). Ahmes’s thinking is\nshown in Gillings’ column 11 by multiplying 5/12 times 9, a fact that\nwas needed to find the largest term of the RMP progression. Ahmes then\nadded 10 and wrote out the correct largest term of the arithmetic\nprogression, and subtracted 5/6, nine times. Gillings found the\nremaining terms of the progressions by using the KP’s method. To\nunderstand the KP method, readers must make arithmetic calculations as\nthe Middle Kingdom scribes wrote down in their three problems, double\nand triple checking your work with several tools.\n\nGillings’ 1972 analysis of both RMP versions of Middle Kingdom\narithmetic progression failed to parse the method in a manner that was\ncomparable, in every respect, to the KP method. For example, Gillings\nnoticed similar problems in the RMP (RMP 40, 64). Gillings muddled three\npages of his analysis on the topic.\n\nB. In 1987, Egyptologist Gay Robins, and Charles Shute, wrote a book on\nthe Rhind Mathematical Papyrus (RMP). Five years later Egyptologist John\nLegon wrote on the KP and the same class of arithmetic proportions used\nin the RMP. The KP and RMP report the same arithmetic proportion method\nto find the largest term. The method: take 1/2 of the difference, 1/2 of\n5/6 (5/12 in the KP) times the number of differences (nine times 5/12 =\n15/4 in the KP) plus the sum of the A.P progression (100 in the KP)\ndivided by the number of terms (10 meant 100/10 = 10 in the KP). Finally\nadd column 11’s result, 3 3/4, to 10, and the largest term, 13 3/4.\n\nIn unit fractions, the context of the text, add column 11: 5/12 times 9\nwriting 3 3/4 as 3 2/3 1/12 to 10 in column 12 beginning with the\nlargest term 13 2/3 1/12. The scribe subtracted 5/6 nine times created\nremaining terms of the arithmetic progression.\n\nRobins-Shute confused aspects of the problem by omitting the sum divided\nby the number of terms, a topic cited in a closely related RMP 40\nproblem. A scribal algebraic statement matched pairs added to 20\nreporting five pairs summed to 100, a set of facts included in RMP 40.\n\nThe complete KP method found the largest term facts reported in RMP 64\nand RMP 40 by John Legon in 1992. Scholars have parsed Rhind\nMathematical Papyrus 40 a problem that asked that 100 loaves of bread to\nbe shared between five men by finding the smallest term of an arithmetic\nprogression.\n\nC. A confirmation of the Kahun Papyrus arithmetic progression method\nmust include discussions of RMP 40 and RMP 64. In RMP 64 Ahmes asked 10\nmen to share 10 hekats of barley with a differential of 1/8 defining an\narithmetical progression. Robins and Shute reported: “the scribe knew\nthe rule that, to find the largest term of the arithmetical progression,\nhe must add half the difference to the average number of terms as many\ntimes as there are common differences, that is, one less than the number\nof terms”.\n\n1\\. number of terms: 10\n\n2\\. arithmetical progression difference: 1/8\n\n3\\. arithmetic progression sum: 10\n\nThe scribe used the following facts to find the largest term.\n\n1\\. one-half of differences, 1/16, times number of terms minus one, 9,\n\n1/16 times 9 = 9/16\n\n2\\. The computed parameter(1), was found by 10, the sum, divided by 10,\nthe number of terms. It was inserted by Robins-Shute, but had not been\nhigh-lighted, citing 1 + 1/2 + 1/16, or 1 9/16, the largest term. The\nremaining nine terms were found by subtracting 1/8 nine times to obtain\nthe remaining barley shares.\n\nThat is, the KP scribe used formula 1.0:1111111\n\n(1/2)d(n-1) + S/n = Xn (formula 1.0)\n\nwith,\n\nd = differential, n = number of terms in the series, S = sum of the\nseries, Xn = largest term in the series allowed three(of the four)\nparameters: d, n, S and Xn, to algebraically find the fourth parameter.\n\nWhen n was odd, x (n/2) = S/n,\n\nand x 1 + xn = x2 + x(n -1) = x3 + x(n -2) = ... = x(n/2) = S/n,\n\nNote that Robins-Shute omitted the sum divided by the number of terms\n(S/n):\n\nA modern footnote cites implementing as a grammar school student a\nsolution to the n = even case. Ahmes and Gauss found the sum for 1 to\n100 by using d = 1 following the same rule. Ahmes and Gauss reached the\nsum 5050 based on 50 pairs of 101 (1 + 101 = 2 + 99 = 3 + 98 = ...) by\nusing an identical arithmetic progression rule.\n\nD. A four level review of a Kahun Papyrus problem that reported 1365 1/3\nkhar as the volume of cylinder with a diameter of 12 cubit and height of\n8 cubits summarized by:\n\n1\\. Level 1 shows that pi was set to 256/81, and knowing one khar equaled\n3/2 of a hekat, the scribe computed 1365 1/3 khar began with the area of\na circle, $$A = (pi)r^2$$, and input pi = 256/81 and D = 2, considering:\n\na\\. A = (256/81)(D/2)(D/2) = (64/81)(D)(D)\n\nb\\. A = (8/9)(8/9)(D)(D) (algebraic formula 1.0)\n\nThis formula appeared in MMP 10, RMP 41, RMP 42, RMP 43, RMP 44, RMP 45,\nand RMP 46. In RMP 42 Ahmes adding height (H) and created two volume\nformulas.\n\nc\\. V = (H)(8/9)(D)(8/9)(D) cubits squared (algebraic geometry formula\n1.1)\n\nd\\. V = (3/2)(H)(8/9)(8/9)(D)(D) khar (algebraic geometry formula 1.2)\nconverted cubits to khar unit\n\nIn the Kahun Papyrus and RMP 43 algebraic geometry formula 1.2\nindirectly scaled by 3/2 considering\n\ne\\. (3/2)V = (3/2)(H)(3/2)(8/9)(8/9)(D)(D) = (H)(4/3)(4/3)(D)(D)\n\nf\\. V = (2/3)(H)\\[(4/3)(D)(4/3)(D)\\] khar (algebraic geometry formula\n1.3)\n\ng\\. or directly considering V = (3/2)(H)(8/9)(8/9)(D)(D)\n=(32/27)(D)(D)(H) =(2/3)(H)(4/3)(4/3)(D)(D) khar\n\npublished by Robins-Shute in “Rhind Mathematical Papyrus” 1987, on page\n46, confirming a scribal algebraic relationship.\n\nTo numerically verify scribal algebraic geometry was used, input scribal\nraw data D = 12, H = 8 (from the Kahun Papyrus):\n\nh\\. (4/3)(12) was reported as (16)(16) = 256 such that\n\ni\\. V = (2/3)8(256)=(1365 + 1/3)khar\n\nRMP 43 input D = 8 and H = 6 into the same formula\n\nj\\. V = (2/3)(6)\\[(4/3)(8)(4/3)(8)\\] = (4)(32/3)(32/3) = 4096/9 = (455 +\n1/9) khar\n\nk\\. A 4-quadruple hekat (400 hekat) division required RMP 43 and the\nKahun Papyrus by the volume (V) formula.\n\nV = (2/3)(H)\\[(4/3)(4/3)(D)(D)\\] (khar)\n\nRMP 41, 42, 44, 45, 46, and 47 also input khar times 1/20 data as\n4-hekat units to scale the ancient hekat to a modern 4800 ccm. In RMP 47\n400-hekat was multiplied by 1/10 and 1/20 to 10 4-hekat and 5 4-hekat,\nrespectivelu. As important RMP 47 multiplied 100-quadruple hekat (100\n1-hekat) written as (6400/64)hekat by 1/30, 1/40, 1/50, 1/60, 1/70,\n1/80, 1/90 and 100 to obtain 1-hekat quotients and 1-ro remainders.\n\nAn archaeological study can test scribal feeding rates for quail, dove,\nduck and geese by considering RMP 83 data. This class of study can test\n1/10 a hekat scaled to 480 ccm. A recent feasibility study shows1 hekat\nmay have equaled 250-500 ccm for geese and ducks.\n\n2\\. Level 2 reported relative values of 12 fowls in terms of a set-duck\nunit paid in the following problem by:\n\na\\. 3 re-geese unit value 8 set-ducks = 24\n\nb\\. 3 terp-geese unit value 4 set-ducks = 12\n\nc\\. 3 Dj. Cranes unit value 2 set-ducks = 6\n\nd\\. 3 set-duck unit value 1 set-duck = 3\n\ntotal value 45 set-ducks.\n\nNot calculated, but included in the valuation of (12 - 1) = 11 with 100\n- 45 = 55, cited 55/11 as the total value as 5 times the value of one\nset-duck, with each water fowl given a value based on the daily, 10 day,\n30 day and total hekat of grain consumed at rates reported in . RMP 83\nused the same (64/64) scaling method reported in the Akhmim Wooden\nTablet and in .\n\ne\\. The RMP included subtle and therefore complex Egyptian problems that\ndirectly discussed MK bird valuations in hekats. The scribal manner\nimplied that Egyptian fraction arithmetic was focused upon , setting\nprices to pre-determined standards within:\n\nHekat/n recorded in binary quotients (hekat) and scaled ro remainders\n=====================================================================\n\na\\. 1/40 (64/64)/40 = 1/64 hekat + \\[24/40(64) = (120/40(ro)\\]\n\n1/64 hekat + 3 ro\n\nAhmes’ set-goose, dove and quail hekat feeding/consumption rate\\*\n\nb\\. 1/20: (64/64)/20 = 3/64 + 20/20 ro = (2 + 1)/64 + ro\n\n(1/32 + 1/64)hekat + 1 ro\n\nAhmes’ valuation of a set-duck based a feeding/consumption rate\\*\n\nc\\. 1/16: (64/64)/16 = 4/64 = 1/16 hekat\n\n1/10: (64/64)/10 = 6/64 + 20/20 =\n\n\\[(4 + 2)/64 = (1/16 + 1/32)hekat + 1 ro\n\nAn AWT number ... and a djendjen feeding/consumption rate\\*\n\nd\\. 1/9: (64/64)/9 = 7/64 + 5/9 ro = ( 4 + 2 + 1)/64 + \\[5/9 = (10/18)ro\n= (9 + 1)/18)\\]\n\n(1/16 + 1/32 + 1/64)hekat + (1/2 + 1/18)ro\n\ne\\. 1/8: (64/64)/8 = 8/64 = 1/8 hekat\n\nf\\. 1/7: (64/64)/7 = 9/64 + 5/7 ro =\n\n(8 + 1)/64 + \\[(10/14)ro = (7 + 2 + 1) /14 ro\\] =\n\n(1/8 + 1/64)hekat + (1/2 + 1/7 + 1/14)ro\n\n(another AWT number)\n\ng\\. 1/6: (64/64)/6 = 10/64 + 20/6 ro =\n\n(8 + 2)/64 + (3 + 1/3)ro=\n\n(1/8 + 1/32) hekat + (3 + 1/3)ro\n\nAn Ahmes geese and crane feeding/consumption rate\\*\n\nh\\. 1/5: (64/64)/5 = 12/64 + 20/6 ro =\n\n(8 + 4)/64 hekat + (3 + 1/3)ro\n\n(1/8 + 1/16)hekat + (3 + 1/3)ro\n\n(An Ahmes’ terp-goose hekat feeding/consumption rate\\*)\n\ni\\. 1/4: (64/64)/4 = 16/64 = 1/4 hekat\n\nj\\. 1/3: (64/64)/3 = 21/64 + 5/3 ro =\n\n(16 + 4 + 1)/64 + (1 + 2/3)ro =\n\n(1/4 + 1/16 + 1/64 hekat + ( 3 + 2/3) ro\n\n(another AWT number)\n\nk\\. 1/(5/2): (64/64)/2 + (64/64)/8 =\n\n(1/2 + 1/8)hekat\n\n(An Ahme’ re-goose hekat feeding/consumption rate\\*)\n\nl\\. 1/2: (64/64)/2 = 32/64 = 1/2 hekat\n\nm\\. 1/1. (64/64)/1 = 64/64 = 1 hekat\n\nRaw hekat consumption and division of a hekat by 40, 20, 10, 9, 8, 7, 6,\n5, 4,3, 5/2, 2, and 1 data was taken and extended from Clagett’s data to\na table of fowl valuations based on fowl hekat consumption rates\\* ...a\nbasic economic fact that Ahmes understood very well.\n\n3\\. Level 3 showed that Ahmes in may have corrected the KP scribal\nover-estimate of grain volume in the cylinder. Ahmes may have down-sized\nthe volume of a 12 cubit diameter and 8 cubit high cylinder to 1356 3/14\nkhar by approximating pi to 22/7, improving the volume estimate by 9\n5/42 khar, though is no direct evidence of that suggestion.\n\n4\\. Level four considers arithmetic when Plato spoke of mathematics by:\n\n\"How do you mean?\n\nI mean, as I was saying, that arithmetic has a very great and elevating\neffect, compelling the soul to reason about abstract number, and\nrebelling against the introduction of visible or tangible objects into\nthe argument. You know how steadily the masters of the art repel and\nridicule any one who attempts to divide absolute unity when he is\ncalculating, and if you divide, they multiply, taking care that one\nshall continue one and not become lost in fractions.\n\nThat is very true.\n\nNow, suppose a person were to say to them: O my friends, what are these\nwonderful numbers about which you are reasoning, in which, as you say,\nthere is a unity such as you demand, and each unit is equal, invariable,\nindivisible, -what would they answer? \"\n\nfrom Chapter 7. “The Republic” (Jowell translation).\"\n\nand the work of .\n\nthat includes Archimedes showing that pi was an irrational number\nlimited to well-defined rational number limits smaller than Egyptians\nrecorded by 256/81 and 22/7 approximations.\n\nE. The Kahun Papyrus calculation of the 1365 1/3 khar volume would\nlikely have been corrected by Ahmes with pi set at 22/7, 175 years\nlater, and improved by Archimedes including calculus, with Egyptian and\nGreek businessmen freed from the abstract number of Egyptians.\n\nF. The Kahun Papyrus contains other numerical information. One data set,\neight lines of large quotient and remainder rational numbers was\npreceded by 14 lines of missing data. The fragmented data may relate to\na calculation ending with 1/12. The historical context of the data,\ncited below is unclear.\n\n15\\. 925157 + 1/3\n\n16\\. 708453 + 1/3\n\n17\\. 709533 + 1/3\n\n18\\. 508098 + 2/3 + 1/8 + 1/16\n\n19\\. 407042 + 2/3\n\n20\\. 440003 + 1/6\n\n21 209200\n\n22\\. 1/12\n\nAs a wild guess, a prime number analysis may offer a few hints to\ndecoding aspects of the ancient data:\n\n15\\. 2775460 divided by 3, factors (2, 2, 5, 73, 1901) divided by 3\n\n16\\. 21283600 divided by 3, factors 2, 2, 2 ,5 ,13, 4093) divided by 3\n\n17\\. 2128600 divided by 3, factors (2, 2, 2, 5, 5, 29, 367) divided by 3\n\n18\\. 508098 + 41/48 = 243887050 divided by 48, or\n\n121943525 divided by 24, factors (5, 5, 11, 443431) divided by 24\n\n19\\. 1221128 divided by 3, factors (2, 2, 2, 152641) divided by 3\n\n20\\. 2640019 divided by 6, factors (61, 113, 383) divided by 6\n\n21\\. factors (2, 2, 2, 2, 5, 5, 523)\n\n22\\. 209200 times 12 = 25700900\n\nThe data was converted to rational numbers and prime factors to consider\nastronomical cycles as a possible ancient context. More on this data\nwhen, or ever, reliable data becomes available.\n\nG. In summary, the Kahun Papyrus (KP) was notable for a 2/n table, an\narithmetic progression problem, a calculation of the volume of a\ncylinder (in khar and hekats), a valuation of four classes of birds by\nthe lowest valued bird ) a set-duck), an economic trading unit system\nused regionally in the Ancient Near East, that was passed down to the\nGreeks, and a large number problem that discussed an unclear aspect of\nscribal numerical abilities.\n\nAncient Egyptian fraction arithmetic was finite. The finite system\nrepresented positive rational numbers that scaled 2/n to 2m/mn, and n/p\nto mn/mp. Selected divisors of mn and mp recorded red numbers that\nassisted scribes to record concise unit fraction series. Unit fraction\nseroes were typically 5-terms 1/a + 1/b + 1/c + 1/d + 1/e, or less,\nscaled in a manner that confused 19th and 20th century scholars. The\nEgyptian fraction Middle Kingdom notation was continuously used for\n3,600 years. Scholars in the 21st century AD have finally parsed the\n4,000 year old unit fraction notation that fell into disuse after 1454\nAD. With the dominance of algorithmic base 10 decimal arithmetic,\napproved by the Paris Academy in 1585 AD, and updated by Napier and\nothers, the earliest Egyptian fraction notation, and all its descendants\nwere replaced by 1600 AD and forgotten by 1900 AD.\n\nThe KP and RMP scribes used identical methods that calculated largest\nterms in arithmetic progressions. Formula 1.0 defined four variables (d,\nn, S and xn). Algebraically identical methods found any one of the four\nvariables, knowing three variables.\n\nFormula 1.0 did not rely on rational number differences(d) being\nconverted to Egyptian fraction series. Agreement on the larger\nquestions, i.e., what were the beginning, and intermediate arithmetic\nsteps of the arithmetic progression formula, have been algebraically\nresolved, though not fully published in the academic journals.\n\nOther common calculations were used in the KP and the RMP. The KP scribe\nconverted rational numbers 2/n and n/p to concise and exact Egyptian\nfractions based on finite Egyptian fraction arithmetic, and red\nauxiliary numbers in identical ways.\n\nResearch continues with respect to the scribal economic valuation\nproblems, scaled by binary quotients and 1/320 (ro) remainders, recorded\nin the Akhmim Wooden Tablet, the RMP, and the KP. Other meta mathematics\nissues cited in the KP, an important mathematical text, are also being\ninvestigated.\n\n[4]{}\n\nRichard Gillings, *“Mathematics in the Time of the Pharaohs”*, pages\n176-180, MIT Press, Cambridge, 1972 John Legon, *“A Kahun Papyrus\nFragment”*, pages 21-24, Discussions in Egyptology 24, 1992. Luca\nMiatello, *“The difference 5 1/2 in a problem of rations from the Rhind\nmathematical papyrus”*, Historia Mathematica, vol 34, issue 4, pages\n277-284, Nov. 2008. Gay Robins and Charles Shute, *“The Rhind\nMathematical Papyrus”*, pages 41-43, British Museum Press, Dover\nReprint, 1987.\n\nExternal links\n--------------\n\n-   -   -",
  "language": "INFORMAL",
  "phrase": "Kahun Papyrus And Arithmetic Progressions",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/KahunPapyrusAndArithmeticProgressions"
    }
  ],
  "indexable": true
}