{
  "alternatePhrases": [
    "rational numbers"
  ],
  "definition": "Abstract (2015 Update): The “Liber Abaci”, a 1202 AD Latin text,\nprimarily scaled vulgar fractions n/p to unit fraction by seven\ndistinctions in a subtraction context. The Hindu-Arabic numeral notation\nbegan in 800 AD scaled rational numbers n/p by LCM m per: (n/p - 1/m) =\n(mn -p)/mp, replaced Greek alphabet ciphered rational numbers encoded by\nmultiplication. Fibonacci set numerator (mn -p) to unity (1) as often as\npossible to define 2-term series. In the seventh distinction 3-term\nseries were calculated by subtracting a second 1/m. The first of three\nArab arithmetic notations solved arithmetic, algebra, geometry and\nmodular arithmetic problems, such as an inverse proportion square root\nmethod used by Archimedes, pertinent to the medieval era.\n\nINTRODUCTION The “Liber Abaci” (Book of Calculation) was written by\nLeonardo Pisano. Fibonacci was Leonardo’s Latin name. Leonard was the\nson of a Pisa merchant, and often went with his father to Arab ports and\nother trading locations. On these trips Leonardo wrote down practical\nand abstract sides Hindu-Arabic arithmetic operations that were used in\nthe regional weights and measures system of the Mediterranean world. As\na historical consequence, Fibonacci documentation of medieval trading\nunits indirectly and directly reported aspects s of very old theoretical\nand practical Egyptian fraction arithmetic that were passed down to\nmedieval traders.\n\nThe “Liber Abaci” was a very successful book. It was used in the\nmedieval period for 250 years to teach arithmetic and higher mathematics\nin European Latin schools. Today, five copies of the book exist. The 800\nyear old book had been partially translated by 20th century scholars.\nScholars tended to take single arithmetic subjects, often omitted\nrelated arithmetic subjects linked to older unit fraction arithmetic.\n\nModern base 10 decimal themes were built by an algorithm flowered after\n1585 CE. The foundations of our decimal system retained 3,200 year older\nfinite Egyptian fraction arithmetic, but implicitly hid the older finite\nnumber theory, arithmetic, and algebraic foundations that stressed\nalgorithms as questions. Singular 20th century themes oddly limited\n“Liber Abaci” translations to base 10 decimals foundations related to\nalgorithms. For example, theory of equation and number theory algorithm\nfocused books drew upon medieval algebra but omitted large aspects of\nmedieval number theory.\n\nSigler’s 2002 translation is 500 pages. The first 125 pages began to\nexpose medieval arithmetic and hints of pertinent aspects of the 3,200\nyear older Egyptian fraction arithmetic. Earlier scholars footnoted and\ndiscussed “Liber Abaci “math topics without decoding arithmetic and\nalgebra building blocks taken from older arithmetic foundations. The\nSigler translation was a great improvement over the earlier partial\ntranslations.\n\nBut even Sigler failed to expose final rational number notations that\nscaled n/p by subtracting LCM 1/m, i.e. (n/p – 1/m) = (mn-p). Earlier\nGreek rational numbers were also not cited by Sigler that scaled n/p by\nmultiplying LCM m/m, i.e. (n/p)(m/m) = (mn/mp). Greeks also used scaled\nrational numbers in its final notation, as Egyptians did before them, by\nfinding the best divisors of mp summed to mn. Arabs had replaced Ionian\nand Dorian alphabet encoding of numerals that mapped 1/2 = beta’, and so\nforth.\n\nSigler’s important work footnoted most arithmetic, algebra and higher\nmath topics, recorded in final rational number notations and methods.\nSigler made sense of Leonardo’s rambling narratives by overlaying modern\nversions of medieval unit fraction arithmetic. Sigler’s footnotes are\nimportant, yet sparse based on his untimely death and confusing modern\npoints of view.\n\nThe Sigler translation directly and indirectly includes the fundamental\ntheorem of arithmetic as understood by Arabs. The first seven chapters\nindirectly discuss theoretical and practical aspects of the 3,200-year\nold system of Egyptian fractions. At various places Leonardo cites three\ndifferent arithmetic notations to record rational numbers in unit\nfraction series. The first arithmetic notation was dominant in the 500\npage book. The second and third notations were used for special\nfactoring purposes not intended to be parsed by this paper.\n\nLEONARDO’S SEVEN EGYPTIAN FRACTION METHODS (Distinctions) This paper\nanalyzes seven rational number conversion methods, or distinctions, as\nwritten in “Liber Abaci” remainder arithmetic. Leonardo used the first\nnotation to scale vulgar fractions to elegant and not-so-elegant\nEgyptian fractions series. Fibonacci indirectly discusses older Egyptian\nfraction system as this paper will hi-light.\n\nThe seven conversion methods used by Leonardo were built by selecting a\nsubtraction 1/m, a LCM, in a subtraction a step, per “ab initio”, from\nthe beginning details:\n\n(n/p - 1/m) = (mn - p)/mp\n\nFibonacci set (mn –p) = 1 as often as possible, in the first six\ndistinctions, further discussed by:\n\n1\\. Leonardo’s first distinction\n\nThe first method contains three aspects—the simple, the composite, and a\nreversed composite. Two remainder arithmetic notations were used.\n\na\\. Simple factoring, 1/2 of 1/9 meant 1/18. In addition 1/2 x1/9 was\nconverted to an Egyptian fraction series 1/2 = 1/3 + 1/6. Note that 1/18\n= 1/27 + 1/54, was an older Egyptian fraction series that Fibonacci did\nnot list.\n\nb\\. The second composite used a Greek or Arab notation that reported 1/18\n= 1/2 0/9, which equals 5/10 0/9, as listed by Leonardo. Aspects of this\nrule may date to the time of Ahmes, when (64/64), a hekat unity was\npartitioned into 1/64 quotients 1/320 (ro) remainders. In other examples\nAhmes mentally scaled 1/2 to 5/10, a common practice employed by Ahmes\n(who scaled 1/64 by 5/5 to 5/320, recorded as 5 ro)\n\nc\\. The third reversed composite used a Greek or Arab notation that\nallowed the denominators, 10 and 9, to be switched, stating that:\n\n1/18 = 5/10 0/9 = 5/9 0/10.\n\nNote that 5/10 0/9 = 5/90 = 1/18 and 5/9 0/10 = 5/90 = 1/18.\n\nSigler summarized Leonardo’s first method (distinction) rule, and its\nthree aspects, primarily through the assistance of Dunton and Grimm’s\n“Fibonacci on Egyptian fraction” paper. Dunton and Grimm stressed the\nalgebraic statement k/kl = 1/l, an algebraic identity, as a fair method\n(which it is not) to capture Leonardo’s three part rule. Note that the\nthird aspect of Leonardo’s method (distinction), titled “third reversed\ncomposite,” is one of three methods that Dunton and Grimm did not parse,\na logical omission that Sigler adopted.\n\n2\\. Second method (distinction)\n\nWhen greater numbers are not divisible by the lesser, a phrase offered\nby Leonardo, was clarified by these examples:\n\na\\. 5/6 = (3 + 2)/6\n\n= (1/2 1/3), a quotient name for a numerator\n\nb\\. 7/8 = (4 + 2+ 1)/8 = (1/2 1/4 1/8)\n\nc\\. A reverse composite is used to solve for\n\n3/40 = (3/4 0/10) meaning that\n\n3/4 = (3/10 0/4)\n\nwas used to solve example problems by applying tables of separations, as\nLeonardo listed lists parts of 6, 8, 12, 20, 24, 60 and 100. This class\nof table was reported in the Coptic era, by David Fowler and others. In\na broad sense, the RMP 2/nth table was an example of this class of\ntable.\n\n(Again, Sigler stressed Dunton and Grimm modern view per the statement\n(k + 1)/klm = 1/lm + 1/km), an analysis that insufficiently captured the\nmedieval methodology.)\n\n3\\. Third method (distinction)\n\na\\. 2/11 = (1/6 0/11), parts of 2/11\n\nb\\. 3/11 = (1/4 0/11) = (1/11 1/4)\n\nc\\. 6/11 = 1/22 1/2\n\nd\\. 8/11 = 2/11 + 6/11\n\nmeant that a table of values defined the scope of distinction two.\n\n(Sigler again cited Dunton and Grimm by a proposed modern identity k/(kl\n-1) = 1/l + 1/(kl -1) rather than the actual ( n/p – 1/m) = (mn – p)/mp\n= 1 encoding context).\n\n4\\. Fourth method (distinction)\n\nThis distinction indirectly applied aspects of Ahmes’ 2/p construction\nmethodologies, where highly composite denominators were selected to\nsolve several examples. The vulgar fraction examples selected by\nLeonardo were, 19/53, 5/11, 7/11, 6/19 and 7/29. The older methodology\nbegan to be re-discovered in 1895 by F. Hultsch, and 1944 by E.M. Bruins\nby the Hultsch-Bruins method.\n\na\\. 19/53 - 1/3 = (3 + 1))/(3 x 53) = 1/159 1/53, meant that\n\n19/53 = 1/159 1/53 1/3, a statement found in Egyptian texts.\n\nb\\. 5/11 - 1/3 = (3 + 1)/(3x 11) = 1/11 1/33, meant that\n\n5/11 = 1/33 1/11 1/3, again a very old form of style and contents\n\nc\\. 7/11 - 1/2 = (2 + 1)/(2 x 11) = 1/22 1/11 1/2\n\nd\\. 6/19 - 1/4 = (4 + 1)/(4x 19) = 1/19 1/76, meant\n\n6/19 = 1/76 1/19 1/4\n\ne\\. 7/29 - 1/5 = (5 + 1)/(5x29) = 1/29 + 1/145, or\n\n7/29 = 1/145 1/29 1/5 in Leonardo’s notation.\n\n(Sigler did not comment on this distinction. This approach was expanded\nby Ahmes, 2850 years earlier to solve 30/53 = 28/53 + 2/53 as a second\nbasis of the 2/n table.)\n\n5\\. Fifth method (distinction)\n\na\\. 9/26 - 1/3 = (1/3 0/26 1/3) = 1/78 1/3\n\nb\\. 11/26\n\nc\\. 11/29 = (1/78 1/3 1/3) since\n\n11/29 - 1/3 = (3 + 1)/(93 x 29) = 1/79 1/3\n\nd\\. 11/62 = (0/62 1/31 1/7), since\n\n11/62 - 1/7 = (14 + 1)/(7x 62), or\n\n11/62 = (0/62 1/7 1/31 1/7), an alternate Leonardo notation.\n\n(Again, Sigler cited few historical or pertinent info to summarize this\ndistinction’s important set of examples, at least in the eyes of\nLeonardo.)\n\n6\\. Sixth method (distinction)\n\na\\. 17/27 - 3/27 = 14/27 - 1/2 = 1/54, meant\n\n17/27 = 1/54 1/9 1/2, since 3/27 was found to reduce the vulgar fraction\nbeing converted.\n\nb\\. (20/53 - 18/48) = (960 - 954)/(18x53), meant\n\n20/53 = 18/48 + 6/(18 x 53) = 18/48 1/8 0/53\n\n\"7. Seventh method (distinction)\n\na\\. (4/9 - 1/13) = 3/(13 x 49)\n\n= (1/319 0/637 1/617 1/319 1/13), not elegant\n\nb\\. 4/49 - 1/14 = 7/(14 x 49)\n\n= (1/2 0/49 1/14), elegant\n\nc\\. 4/49 = 1/7 x (4/7) = 1/7 x (4/7 - 1/2 = 1/14)\n\n= (1/2 0/49 1/14), elegant alternative\n\nOne of the first rational numbers that could not be scaled to a 2-term\nseries is 4/13. Leonardo would have selected (4/13 – 1/4) =( 3/53 –\n1/18) = 1/468 meant 4/13 = (1/4 + 1/18 + 1/468).\n\nAn older parallel is found in Ahmes’ shorthand. In RMP 31 and RMP 36,\ntwo rational numbers 28/97 and 30/53 could not be converted. Ahmes\napplied the first 2/n table approach to achieve a conversion to unit\nfraction series. Ahmes’ arithmetic considered the aliquot parts of 56,\nand 4 for 28/97 and 30 and 2 for 30/53 per:\n\n28/97 = 2/97 + 26/97 = 2/97\\*(56/56) + 26/97\\*(4/4) = (97 + 8 + 7 ) +\n(97 + 4 + 2 + 1)/388\n\n30/53 = 2/53 + 28/53 = 2/53 \\*(30/30) + 28/53\\*(2/2) = (53 + 5 + 2)/1590\n+ (53 + 2 + 1)/106\n\nA version of the older scaling method was condensed by Arabs and\nFibonacci in a subtraction context. Leonardo’s seventh distinction\nlikely was extended to include 2/53, that converted 30/53 by: (30/53 -\n1/30) = (53 +5 + 2)/1590 = 1/30 + 1/318 + 1/795 And 3-term series, i.e.\n(4/13- 1/4) = (3/53 – 1/18) = 1/468 = 4/13 = 1/4 + 1/18 + 1/468\n\nLeonardo’s square root data was demonstrated in Chapter 14 “The Finding\nSquare and Cubic Roots , and on the Multiplication, Division and\nSubtraction of Them, and on the Treatment of Binomials and Apotomes and\ntheir Roots”. Only the details of the square root method, also used by\nGalileo, Archimedes and most likely Egyptians, will be parsed.\n\nThe inverse proportion method estimated the square root of prime\nnumbers, and any number, in 3-steps to 8-decimals, translated into\nmodern arithmetic:\n\noutlined the square root of 10 by (3 + 1/6), 1/36, 1/228 and by\nnarrative (3 + 1/6 – 1/228)\\^2\n\nSigler should have footnoted:\n\n1\\. (3 + 1/6)\\^2 = 10 + 1/36 2. 1/36 x (6/38) = 1/228 3. (3 + 1/6 –\n1/228)\\^2\n\nSteps that applied the binomial theorem (a + b)\\^2 to a\\^2 + 2ab + b\\^2,\n10 = a\\^2 + 2ab, and 1/36 = b\\^2, in step 1; an inverse proportion 1/36:\n2ab, in step 2; and reduced error= 1/36 to (1/228)\\^2, in step 3.\n\nSigler’s following Leonardo narrative : “Truly according to geometry and\nnot arithmetic, the measure of any root can be of any number can be\nfound, and it is found in this manner”, an untrue and true statement. In\nthe medieval math era, like today, the binomial theorem was an algebraic\nidea and not geometry, hence untrue to that extent. “Double false\nposition”, another geometric method named by 20th century scholars makes\nthe statement true, to that extent.\n\nTaken together the seven Arab and medieval distinctions included older\narithmetic methods that Leonardo borrowed to mentally compute, and\nrecord vulgar fractions in shorthand notations. Leonardo often converted\nvulgar fractions to either a 2-term or a 3-term unit fraction series in\nfinal notations, as needed.\n\nCONCLUSiONS:\n\n1\\. The “Liber Abaci” demonstrated uses of vulgar fractions in square\nroot intermediate steps, and in other problems, including the scaling of\nfinal rational number answers usually with no hint of an algorithm. Use\nof vulgar fractions in mental and written arithmetic was common. 2. The\nformal medieval rational number system was rigorously demonstrated in\nthe first 1/3 of the “Liber Abaci”, but unequally applied in the\nremaining 2/3 of the book. For example, the square root of 10 mentioned\nas (3 + 1/6 – 1/228)\\^2 was not recorded in a final rational number\nnotation. 3. Distinction one contained three older arithmetic methods\nthat may date to an Egyptian scribal style of writing parts of a\nfraction. Egyptian scribal long hand decoded from the EMLR and RMP\nscaled rational numbers by LCM m/n in a multiplication context. Leonardo\nscaled 1/18 by factoring 1/2 x 1/9, with 1/2 = 1/3 + 1/6 such that 1/18\n= 1/27 + 1/64. The EMLR used this method four times, and the RMP used\nthis method to convert 2/101. 4. Leonardo’s square root method applied\nthe binomial theorem, taken from algebra, and not by geometry as\nLeonardo’s narrative seems to report. Geometry was also applied in the”\nLiber Abaci” to find roots by double false position method, one of many\nmedieval topics not analyzed in this introductory paper. References • 1\nSamuel Borofsky, Elementary Theory of Equations, The MacMillian Company,\nNew York, 1963 (fifth printing). • 2. Heinz Leueneburg, Leonardi Pisani\nLiber Abbaci oder Lesevergngen eines Mathematikers, Mannheim: B. I.\nWissenschaftsverlag, 1993. • 3. Oystein Ore, Number Theory and its\nHistory, McGraw-Hill, 1948. • 4. L. E. Sigler, Fibonacci’s Liber Abaci,\nLeonardo Pisano’s Book of Calculations, Springer, 2002.",
  "language": "INFORMAL",
  "phrase": "Liber Abaci",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/LiberAbaci"
    }
  ],
  "indexable": true
}