{
  "alternatePhrases": [
    "modular arithmetic"
  ],
  "definition": "INTRODUCTION Four Mayan super-numbers: 341640, 1195740, 1765140 and\n2448420 were recorded on a wall near Tikal, Guatemala around 419 AD. All\nfour highly composite long count distance numbers were multiples of 780,\na nominal Mars cycle, one calendar round (18980) and three calendar\nrounds The four distance numbers were also multiples of other nominal\nplanetary cycles, including Mercury (117), moon (260), Venus (584, 585),\nearth (360, 365) and 2340, 4680.\n\nA. MATH ISSUES: Concerning Mars, outside of almanacs, the four 419 AD\nsuper-numbers divided by 780 created quotients 438, 1533, 2263 and 3139,\nrespectively. The quotients describe annual retrogrades that can be\nfurther parsed into base 10 arithmetic by considering:\n\n1 86400 sec/day divided by 90 = 960(780) = 748800 days to lose one full\nMars day\n\n2\\. 748800 =6400(117) = 2880 (260) = 2080(360) = 1280(585) = 960(780)\n\nNote 748800 is a composite number 160(4680) that is numerically\nconsistent with Mayan calender round super-number math.\n\nMayan super numbers were reported by Aveni in 1992 “The Sky in Mayan\nLiterature” per:\n\n1\\. 2920 =8(365)= 5(584)\n\n2\\. 4680 = 40(117) = 18(260) = 13(360)= 8(585)=6(780)\n\n3\\. 18980 = 73(260) = 52(365)\n\n4\\. 37960 = 146(260) = 104(365)\n\n5\\. 56940 = 219(260) = 156(365) = 73(780)\n\n6\\. 1366560 = 5256(260) = 1752(780) =3744(365)= 72(18980)\n\nIn 2012 Aveni, et al, data reported the four Mayan super-number\n\n1\\. 341640 parsed by 2920(117) = (6)(219)(260) = 949(360) =\n(6)(156)(365)= 585(584) = (6)(73)(780)= 146(2340) = 73(4680)= 18(18980)\n= 9(37960) = 6(56940) appear over 28 times (still counting) as LCMs of\n260, 360,364, 365, 584, 585, and 780 taking 2 cycles, 3 cycles, 4, 5, 6\nand 7 cycles at a time.\n\n2\\. 1195740 = 10220(117) = (21)(219)(260) = 3285(364)= (21)(156)(365)=\n2044(585)= (21)(73)(780) = 63(18940) = 21(56940) meant LCM (260, 364,\n365, 585) = LCM (364, 365, 585,780) and two other LCMs.\n\n3\\. 1765140 = (31)(219)(260) = (31)(156)(365) =\n(31)(73)(780)=(3)(31)(18980) = 31(56940)= LCM (260, 365, 780, 2263)\n\n4\\. 2448420 = (43)(219)(260) = (43)(156)(365) = (43)(73)(780) =\n(3)(43)(18980)= 43(56940) = LCM (260, 365, 780, 3139)\n\n\\*validates LCM quotients of 260, 365, 780 and other planets can be any\ninteger. Most LCMs lead to calendar rounds, the domain of Mayan math and\nastronomy.\n\nThe most basic Mayan almanac reported the cycles of Mercury (117) and\nVenus (585) were scaled to Mars (780) and lunar(260) on three levels.\nThe Mercury 117 day nominal cycle was factored into 9(13).\n\nSecond the nominal aspect of Mercury (117) and Venus (585) were extended\nto 2340, a least common multiple cited within the four-part Mayan\nculture by:\n\n2340 = 20(117)= 4(585) planetary cycles that also equaled 9(260) and\n3(780).\n\nA second level of the Dresden Codex seasonal almanac scaled four lines\nof quotients that summed to 91 by 20 = 1820 and added remainders that\nreached 1898, 1898, 1924 and 1911. The Madrid and Dresden contained\ncalendar round texts.\n\nA third level of the discussed earth cycles(360, 364, 365) in terms of\nthe lunar (260), Venus (584, 585) and Mars(780) in 20 additional\nmeta-cycles that summed to 2-calendar rounds 38960, 38960, 38960 + 260\nand 38960 + 520.\n\nScholars have suggested that the four stations of Mercury and Venus,\nperiods of first and last visibility, as morning stars and evening\nstars, and periods of invisibility explain the nominal numbers.\nMercury’s four stations are symmetric averaging 35 days before the first\nconjunction, 5 days invisibility and 38 days as morning star and 38 days\nas the evening star. Venus’ four stations are not symmetric, as Mayans\n(Dresden) and Mixtecs (Grolier) reported 8 days, 236 days, 90 days\n(morning star) and 250 days (evening star), by the Brickers (2011).\n\nB. LANGUAGE , stative and positional words: In Mayan languages, words\nwere usually viewed as belonging to one of four classes: verbs,\nstatives, adjectives, and nouns. Statives are a linguistic class of\npredicative words expressing a quality or state, whose syntactic\nproperties fall in between those of verbs and adjectives in\nIndo-European languages. Verb and stative words are sometimes inflected\nfor person but normally lack inflections for tense, aspect and other\npurely verbal categories. This is very similar to the so-called Japanese\n“adjectives”. Stative words were positional and numeral adjectives.\n\nPositional words were a class of root words characteristic of, if not\nunique to, the Mayan languages, form stative adjectives and verbs\n(usually with the help of suffixes) with meanings related to the\nposition or shape of an object or person. Mayan languages have between\n250 and 500 distinct positional roots.\n\nMayans and regional cultures also stressed traditional Olmec four-part\nnumbers in stative and positional language notations in animal and other\nimages and added colors for emphasis. Stative words were qualitative and\npositional.\n\nQuantitative words and numbers recorded greatest common divisors (GCD),\nleast common divisors (LCM) and other number theory ideas in Mayan\ntexts. At times Mayan quotients were red in color and remainders were\nblack in color. It should be noted that the same color could be used for\nmultiple stative purposes.\n\nAfter 1200 AD the Aztecs, a nearby culture, considered (stative words)\nthat represented east as an ideal aspect of life, south as a good aspect\nof life, weest as a bad aspect of life, and north as an evil aspect of\nlife used symbols from the north that governed conquered ares by force\nto obtain annual tribute payments.\n\nFour-part Mayan aspects of life were active at all times. Mayans before\nand after 1200 AD limited meanings of four-part aspects of astronomy by\nscaling two planetary cycles in almanac LCMs and GCDs. Almanac extended\npractical four-part day names \\[two from 260 factored from 13(20) and\ntwo from 360 factored 18(20)\\] to political and local issues. Mayan\nscribes converted theoretical numerations base numbers to regional color\nbased and other action phrase often pointing actual actual astronomical\nevents. Red, black, white, and green, for example, were complementary\naspects of four-parts of a given subject.\n\nC. ANALYSIS: Recent scholarship suggests that Mayans selected two or\nmore planetary cycles that converted theoretical almanac problems into\nday names and other ideas to report practical solutions. That is, Mayan\ncreated super-numbers (GCDs) and LCMs for purposes for almanac solution\nof no more than four astronomical cycles in practical named days, with\nthe four directions encoded as trees in the Dresden Codex Mercury-Venus\nalmanac, the later in ways that are not fully understood.\n\nTo explore Mayan two or more planetary cycles summed to super-numbers,\nMars and other planets are discussed in the journal SCIENCE (May 2012).\nFour super-numbers were written on a wall near Tikal, Guatemala shortly\nafter 419 AD. The smallest super-number 341640 can also be divided by\n11960 (405-moons, a Mayan lunar calendar cycle) such that 28 + 26(260)\noffers another quotient and scaled remainder. The same class of 260\nscaled remainder can be found by dividing other well known Mayan\nsuper-number with smaller Mayan super-numbers:\n\n1\\. 37960/1820 = 20 + 6(260)\n\n2\\. 37960/11960 = 3 + 8(260)\n\n3\\. 11960/1820 = 20 + 6(260)\n\nMayan quotients and scaled remainders requires consistent numeration\nsystems to translate historical data into modern base 10 arithmetic.\nGiven that Mayan modular arithmetic, defined nominal (theoretical)\nplanetary and lunar cycles, was used by Mayans to predict astronomical\nevents. Studying Mayan almanacs, for example one parsed in and further\ndiscussed in may assist in pointing out additional Mars reelated\nsuper-numbers.\n\nFour Mayan super-numbers were mentioned 1,700 years ago. The\nintellectual effort that created the numbers may have modified 4,000\nyear old Egyptian rational numbers arithmetic that scaled n/p by LCM m/m\nto mn/mp in Mayan modular arithmetic. Of course, Mayans most likely,\nknew nothing of Egyptian math.\n\nMayan rational number math was written in clock and modular arithmetic.\nMayan inspected the cycles of our moon, Mercury, Venus, earth, Mars and\npossibly Saturn and Jupiter in nominal and actual way by considering\n1,000 year older Olmec long count modular arithmetic methods.\n\nThe Olmec long count contained five digits: A.B.C.D.E The smallest digit\nE used 365 days (kin) as a base. The second smallest digit D used 20\ndays (uinal); the third smallest digit C used 360 (tun); the fourth B\nused 7200 (katun) and the largest A used 144,000. Mayans loved to create\nnumber systems of this type, some longer and some shorter.\n\nD. POSSIBLE CONNECTIONS TO EGYPT, GREECE AND MEDIEVAL MATH: Western\nastronomers created least common multiples (LCM) and other prime number\nbased mathematics. Even though ancient Egyptian astronomical records\nhave not been fully decoded by scholars, Egyptian math and 2/n tables\nwere used by Greeks, Arabs and medieval scribes used LCMs to scale\nrational numbers before writing out concise unit fraction series.\nEgyptian, Greek, Hellene, Arab and medieval divisibility rules stressed\nprime number factoring of quotients and remainders. By 1650 BCE Ahmes\ncreated a 2/n table by scaling 2/n from 2/3 to 2/101 by an LCM m/m such\nthat 2/n was converted to concise unit fraction series by solving\n\n2/p(m/m) = 2m/mp\n\nThree examples\n\n1\\. 2/7 times 4/4 = 8/28 = (7 + 1)/28 = 1/4 + 1/28\n\n2\\. 2/41 times 24/24 = 48/984 = (41 + 4 + 3)/984 = 1/24 + 1/246 + 1/328\n\n3\\. 2/43 times 42/42 = 84/1806 = (43 + 21 + 14 + 6)/1806 = 1/42 + 1/86 +\n1/129 + 1/301",
  "language": "INFORMAL",
  "phrase": "Mayan Super Number Arithmetic",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/MayanSuperNumberArithmetic"
    }
  ],
  "indexable": true
}