{
  "alternatePhrases": [
    "Millenium Prize Problems"
  ],
  "definition": "The *Millennium Problems* are seven problems for the solution of which\nthe Clay Mathematics Institute (CMI) is offering a prize of \\$7 million.\nSomeone who can solve just one of these problems receives \\$1 million.\nFor each problem, the CMI had a professional mathematician write up an\nofficial statement of the problem which will be the main standard by\nwhich a given solution will be measured against. The prize offer was\nannounced in May 2004.\n\nThe seven problems are:\n\n1.  The Birch and Swinnerton-Dyer conjecture. It concerns elliptic\n    curves over rational numbers and the L-series attached to those\n    curves. The official statement of the problem was given by Andrew\n    Wiles.\n\n2.  The Hodge conjecture. It concerns Hodge cycles and their linear\n    combinations. The official statement of the problem was given by\n    Pierre Deligne.\n\n3.  “Existence and smoothness of the The Navier-Stokes equation.” The\n    Navier-Stokes equation calculates momemtum in fluids (specifically,\n    liquids and gases). The official statement of the problem was given\n    by Charles Fefferman.\n\n4.  “P versus NP.” It concerns the difference between verification and\n    computation in polynomial time. The official statement of the\n    problem was given by Stephen Cook.\n\n5.  The Poincaré conjecture. It is believed that every simply-connected\n    compact 3-manifold is homeomorphic to $S^3$. The official statement\n    of the problem was given by John Milnor.\n\n6.  Quantum Yang-Mills theory. Just as Hilbert’s problems a hundred\n    years before included a problem relating to the mathematics of\n    physics, so does this 2000 collection. The official statement of the\n    problem was given by Arthur Jaffe and Edward Witten.\n\n7.  The Riemann hypothesis. It concerns the distribution of primes. This\n    one was 8 of 23 in Hilbert’s problems. The official statement of the\n    problem was given by Enrico Bombieri.\n\n[1]{} Keith Devlin, [*The Millennium Problems: The Seven Greatest\nUnsolved Mathematical Puzzles of Our Time*]{} New York: Perseus Books\nGroup (2002)\n\nExternal link\n=============",
  "language": "INFORMAL",
  "phrase": "Millennium Problems",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/MillenniumProblems"
    }
  ],
  "indexable": true
}