{
  "alternatePhrases": [
    "geometry"
  ],
  "definition": "From Wikipedia\n\nThe Moscow Mathematical Papyrus (MMP),also known as the Golenischev\nMathematical Papyrus, was once owned by Egyptologist Vladimir\nGolenidenov. Today the document is housed in the Pushkin State Museum of\nFine Arts in Moscow. Based on the palaeography of the hieratic text\ndates to the Eleventh dynasty of Egypt. Approximately 18 feet long and\nvarying between 1 1/2 and 3 inches wide, its format was divided into 25\nproblems with tentative solutions by the Soviet Orientalist Vasily\nVasilievich Struve in 1930. It is one of a half dozen well-known\nMathematical Papyri. Along with the Rhind Mathematical Papyrus(RMP), the\nKahun Papyrus(KP), the Berlin Papyrus (KP), the Egyptian Mathematical\nPapyrus (EMLR), the Akhmim Wooden Tablet(AWT), and the Ebers\nPapyrus(EB). The MMP is about the same age as the AWT, BP, KP, and the\nEMLR, and about 250 years older than the RMP and EB.\n\nThe 10th problems of the MMP calculated the area of a hemisphere, a 1/2\nslice of a cylinder. Gillings dedicated a chapter to a diameter (D/2)\ntimes (D/2) times pi = 256/81 as the area of a circle, cubit x cubit, a\ntopic repeated in RMP 41,42, 43, 44, 45, and 46 by adding height to\ncompute volume, cubit x cubit x cubit.\n\nThe MMP began with the modern area of the circle $$A = (pi)r^2$$ and\nreplaced pi with 256/81 and r with D/2 and considered:\n\n1\\. A = (256/81)(D/2)(D/2) 2. A = (64/81)(D)(D) 3. A = (8/9)(8/9)(D)(D)\n\nThe scribe input D = 9 and found the area of a semi-circle\n\n4\\. A = ((9 - 9/9) = \\[(8)(8)\\]/2 = 64/2 = 32 (the cubit squared unit was\nomitted)\n\nin RMP 41 Ahmes input D = 9\n\n5\\. A = (9 - 9/9) = (8)(8) = 64 cubits squared\n\nIn RMP 42 Ahmes input D = 10\n\n6\\. A = (10 - 10/9) = (80/9)(80/9) = 6400/81 = (79 + 1/81)cubits squared\n\nand input H =10\n\n7\\. V = (6400/81)(10) = 64000/81 = 790 + 10/81 = 790 + 20/162 = \\[790 +\n(18 + 2)/162 = 790 + 1/18 + 1/81\\]\n\nand converted to khar units by:\n\n8\\. V = \\[790 +10/81\\] + 1/2\\[790 + 10/81\\] = \\[1185 + 15/81\\]khar\n\nleaving rational number conversions to unit fraction series calculations\nto the reader.\n\nB. In RMP 43 Ahmes into D = 8 and H = 6 in line 2 as the Kahun Papyrus\ninput D = 12 and H = 8 using a volume of a circular granary formula in\nkhar units that used height (H) and further scaled V = (3/2)\n(H)(8/9)(8/9)(D)(D) by 3/2, obtaining (3/2)V =\n(H)(3/2)(3/2)(8/9)(8/9)(D)(D) = (H)(4/3)(4/3)(D)(D) and scaling both\nsides by 2/3\n\n9\\. V = \\[(2/3)H(4/3)(D)(4/3)(D)\\]khar\n\n10\\. RMP 43 data:(2/3)(6)(4/3)(8)((4/3)(8) = (4)(32/3)(32/9) = 4096/9 =\n(455 + 1/9)khar\n\nA khar contained 10 hekats in the Middle Kingdom and 16 hekats in the\nNew Kingdom.\n\n11\\. Kahun Papyrus(KP) data: (2/3)(8)(4/3)(12)(4/3)(12)= (16/3)(16)(16) =\n4096/3 = (1365 + 1/3) Khar\n\nThe KP scribe formula used the MMP 10 area of a circle formula, and RMP\n43’S volume of a cylinder formula. The scribe also considered r = D/2\nand pi = 256/81 as the MMP and RMP scribes had done and added in a\ngeneralized formula.\n\nAs a related point is important to comment that RMP 38 improved scribal\nuses of pi = 256/81 to 22/7 in the context of correcting granary losses,\nlarge with an implied correction. RMP 38 apparently corrected for\ngranary losses such that 22/7 was used for pi in area and circumference\ncalculations. Indirect proof is suggested by the .\n\nProblem 14: Volume of frustum of square pyramid. The problem may be the\nmost difficult to decode following scribal rules. The scribe calculated\nthe volume of a frustum. This is the only ancient example finding the\nvolume of a frustum of a pyramid or cone\\[4\\]. There are no known\nexamples of a volume calculation of a complete pyramid or cone.f\nHowever, it is expected that an infinite series of the formula was known\nin the Old Kingdom. The MMP scribe would have corrected the Old Kingdom\nround off errors in the older formula by writing exact unit fraction\nseries by following 2/n table rational number conversion rules.\n\nSimilarly, in Mesopotamia interest seems to have been in finding the\nvolumes of frustums rather than complete pyramids or cones. The\nBabylonian mathematical tablet BM 85194, for example, sets out the\ncalculation for the volume of a trapezium-sectioned fortification wall.\n\nThe problem states that a pyramid has been truncated in such a way that\nthe top area is a square of length 2 units, the bottom a square of\nlength 4 units, and the height 6 units, as shown. The volume is found to\nbe 56 cubic units, which is correct.\n\nThe text of the example runs like this: “If you are told: a truncated\npyramid of 6 for the vertical height by 4 on the base by 2 on the top:\nYou are to square the 4; result 16. You are to double 4; result 8. You\nare to square this 2; result 4. You are to add the 16 and the 8 and the\n4; result 28. You are to take 1/3 of 6; result 2. You are to take 28\ntwice; result 56. See, it is of 56. You will find (it) right” \\[5\\]\n\nThis describes the correct calculation:\n\n$$V = 1/3*6(4^2 + 4 \\times 2 +2^2)$$\n\nwhich indicates that the Egyptians knew the correct formula for\nobtaining the volume of a truncated pyramid:\n\n$$V = 1/3*h(a^2 + ab + b^2)$$.\n\nThe origins on how and why Egyptians arrived at the formula for the\nvolume of a frustum are unknown. Regionally, the Babylonians, about the\nsame time, used an incorrect approach by averaging the area of base and\ntop and multiplying by height.\\[6\\]\n\nTouraeff, the first commentator, strangely saw Problem 14 as describing\nthe more general formula for the volume of any frustum\\[7\\], a formula\nthat was not derived for another 3000 years. He was not alone in this\nview.\\[8\\]\n\n$$V = 1/3*h(A+\\sqrt{A B}+B)$$\n\nas discussed by , and .\n\nMMP 12 and 16 are beer formula problems. MMP 12 scaled 13 hekats of\ngrain producing 8 des-jubs of date-beer. The scribe asked how many times\n13 hekat of grain produces 13/6 (pesu) beer? Answer 6 times. On its\nsurface beer (and bread) problems were simple. However, on the\ndistribution side a deeper economic context of Egyptian fractions has\nbeen exposed, one that connects proportional mixing of beer ingredients\nusing modern algebraic ideas of\n\n1\\. alternando (y/x) = (q/p)\n\nand,\n\n2\\. dividendo (y -x))/x = (q-p)/p\n\nand, in MMP 21 a harmonic mean mixed sacrificial bread, reported by\nGillings with confirming RMP 76 information.\n\nGillings 40 years ago summarized (on pages 134 and 135 in “Mathematics\nin the Time of the Pharaohs”) algebraic connections to proportional\nmixes of bread and beer ingredients rather than invverse proportional\npesu units. Gillings did not suspect that the trading of beer and bread\nproducts with the pesu, a secondary monetary scaling unit to him, was\nmore important. Gillings read RMP 72 that traded 45 pesu bread for 10\npesu bread, a class of problem that was missing in the MMP. The hekat\nwas a primary monetary unit with many commodities scaled against is\nvalue.\n\nThe Kahum Papyrus and arithmetic progressions show that simple\nproportions were well understood.\n\nThere were several bread and beer production and distribution problems\nthat included raw materials and labor. Bread produced 200 loaves from 5\nhekats of grain were scaled to 20 pesu. From 13 to 16 hekats of grain\nwere split between bread and beer productions in a manner that allowed\naccurate distributions. One hekat of grain, 1/4 to 1/8 of a worker’s\nsalary, scaled into pesu units, facilitated bread, beer, and other\nproduct distributions. RMP 72, 73 and 75 confirm the MMP conclusion.\n\nIn MMP 18, the 20 setat area of a triagle, with a base of (1/3 + 1/5)\nkhet, solved for the altitude by considering the 40 setat area of a\nrectangle, reckoning 2/5 of 1 to be (2 1/2), to reach the correct\naltitude of 4 khet.\n\nIn MMP 20, 1/5 of 2/3 of a 1000 hekat was shown to be 133 1/3 hekat,\nwith a final answer written in Akhmim Wooden Tablet ( form (133 + 1/4 +\n1/16 + 1/64)hekat + (1 + 2/3)ro, a division of a hekat unity (64/64)\nthat Ahmes used 30 plus times in the RMP.\n\nRelated Middle Kingdom area and volume problems are discussed in the\nRhind Mathematical Papyrus and transliterations of other texts cited by\nMarshall Clagett, 1999, Ancient Egyptian Science“ VOL III, beginning on\npage 210, as well as by several sections of Richard J. Gillings\n”Mathematics in the Time of the Pharaohs\". The Clagett and Gillings\ntreatises are available on-line thanks to google books.",
  "language": "INFORMAL",
  "phrase": "Moscow Mathematical Papyrus",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/MoscowMathematicalPapyrus"
    }
  ],
  "indexable": true
}