{
  "alternatePhrases": [],
  "definition": "[*PlanetMath*]{} is a free, collaborative, online mathematics\nencyclopedia. The emphasis is on peer review, rigor, openness, pedagogy,\nreal-time content, interlinked content, and community. Intended to be\ncomprehensive, the project is located at the Digital Library Research\nLab at Virginia Tech.\n\nPlanetMath was started when the popular free online mathematics\nencyclopedia MathWorld was taken offline by a court injunction as a\nresult of the CRC Press lawsuit against the Wolfram Research company and\nits employee (and MathWorld’s author) Eric Weisstein.\n\nPlanetMath uses the same copyleft as Wikipedia: the . An author who\nstarts a new article becomes the owner of that article; he or she may\nthen choose to grant editing rights to other individuals or groups. All\ntextual content and mathematical formulas are written in LaTeX, a\ntypesetting system that requires some learning but is popular among\nmathematicians because of its support of the technical needs of\nmathematical typesetting and its high-quality output. The user can\nexplicitly create links to other articles, and the system also\nautomatically turns certain words into links to the defining articles.\nFor more details on the automatic linking, see the collaboration on .\nFor more details on controlling the linking of an article, see the\ncollaboration on The topic area of every article is classified by the of\nthe American Mathematical Society. Users may attach addenda, errata, and\ndiscussions to articles.\n\nThe most common method of public communication within PlanetMath is\nposts. Users can add posts in the as well as attach posts to articles, ,\n, , and other posts. A system for private messaging among users is also\nin place.\n\nUsers who are new to PlanetMath are highly encouraged to read the\nfollowing collaborations:\n\n-   -   -   -   -   \n\nThe software running PlanetMath is written in Perl and runs on Linux and\nthe Apache Web server. It is known as $No\\\"{o}sphere$ and has been\nreleased under the .\n\nMost of the very most basic topics are covered, though PlanetMath is\nstriving to improve coverage of elementary and intermediate topics. Due\nto the increasing popularity of the package PSTricks, more members of\nPlanetMath are able to incorporate graphics into their articles. This\nhas enabled PlanetMath to cover many elementary and intermediate topics\nin geometry that were once lacking. There are several methods of\ncreating graphics on PlanetMath. For more details on creating graphics\non PlanetMath, see the collaboration on .\n\nPlanetMath also has entries on highly advanced and specialized topics.\nPlanetMath has entries on the integers and . The following top-level\nMathematics Subject Classification categories have only one or two topic\nentries at PlanetMath:\n\n-   74-XX, mechanics of deformable solids;\n\n-   76-XX, fluid mechanics;\n\n-   85-XX, astronomy and astrophysics.\n\nThe Wikipedia:WikiProject Mathematics/PlanetMath Exchange project\nassists in content exchange between PlanetMath and Wikipedia.\n\n[*This entry was adapted from the Wikipedia article as of February 24,\n2007.*]{}",
  "language": "INFORMAL",
  "phrase": "Planetmath",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/PlanetMath"
    }
  ],
  "indexable": true
}