{
  "alternatePhrases": [
    "platonism"
  ],
  "definition": "Plato’s Mathematics () from Wikipedia\n\nINTRODUCTION: Ancient math studies must parse available ancient texts as\noriginally written. Concerning Plato’s cave and Platonism texts adds\nback missing shorthand steps, must point out initial number theory\nfacts, and include intermediate and final number theory calculations.\n\nAs background, it is well known that Plato’s math ideas were influenced\nby Pythagoreans and Egyptian algebraic arithmetic. Greek and Egyptian\nnumber theory commonly scaled rational numbers to concise unit fraction\nseries by multiplication in almost every quotient and remainder detail.\nFor example,Greek arithmetic proofs defined division as an inverse\nmultiplication operation, a relationship copied from Egyptian proofs..\n\nIn “The Republic” Plato placed Greek math building blocks in historical\nperspective. The term Platonism offers a parallel to Plato’s belief in a\nWorld of Ideas typified by Allegory of the cave: the everyday world was\nimperfectly approximate to an unchanging, ultimate reality. To many\nmodern scholars, Platonism suggests that ancient Greek mathematical used\nabstract entities with no causal properties. The ancient entities may\nhave been eternal and unchanging to everyone, one view of modern\nPlatonism pondered by modern scholars.\n\nModern Platonic paradigms have been claimed by historians that decode\nClassical Greek texts. The same is true for scholars that decode Hellene\nand medieval math era texts. That is, Classical Greek math texts offers\na historical context that decodes abstract mathematics that may answer\nultimate reality questions, like are abstract numbers eternal?\n\nAnother modern context of mathematical Platonism suggests where and how\ndid the mathematical entities exist and how do we know about them in\nClassical Greece?\n\nFor example, was the Greek world separate from our physical world which\nwere occupied by the mathematical entities? In other words, did the\ntheoretical realm of numbers control Classical Greece thinkers including\nPlato?\n\nPLATO’S “REPUBLIC”: How can any one gain access to two abstract worlds,\none theoretical and one practical, and discover truths about math\nentities? One answer might ultimately ensemble a theory that postulates\nstructures that exist mathematically also exist physicaly. To see\naspects of the world of numbers through ancient eyes read Plato’s\nRepublic:\n\nPlato spoke of the ancient mathematical world by asking in the\n“Republic”, How do you mean?\n\n\"I mean, as I was saying, that arithmetic has a very great and elevating\neffect, compelling the soul to reason about abstract number, and\nrebelling against the introduction of visible or tangible objects into\nthe argument. You know how steadily the masters of the art repel and\nridicule any one who attempts to divide absolute unity when he is\ncalculating, and if you divide, they multiply, taking care that one\nshall continue one and not become lost in fractions.\n\nThat is very true.\n\nNow, suppose a person were to say to them: O my friends, what are these\nwonderful numbers about which you are reasoning, in which, as you say,\nthere is a unity such as you demand, and each unit is equal, invariable,\nindivisible, –what would they answer? \"\n\nfrom Chapter 7. “The Republic” (Jowell translation).\n\nIn context, chapter 8, H.D.P. Lee translation, reports the education of\na philosopher containing five mathematical disciplines:\n\n1\\. arithmetic, written in unit fraction ’parts’ using theoretical\nunities and abstract numbers;\n\n2\\. plane geometry, and,\n\n3\\. solid geometry consider the line to be segmented into rational and\nirrational unit ’parts’;\n\n4\\. astronomy;\n\n5\\. harmonics, that include music.\n\nOTHER CONSIDERATIONS: Translators of Plato’s works at various times\nrebelled against practical versions of classical practical mathematics.\nPlato himself and Greeks copied several Egyptian fraction abstract unity\nideas at least 1,500 years older.\n\nFor example, a hekat unity (64/64) was well defined by 1950 BCE as an\ninitial fact. The hekat unity beginning point allowed divisions by 3, 7,\n10, 11, 13 and multiplications by 1/3, 1/7, 1/10, 1/11 and 1/13 in the\nAkhmim Wooden Tablet.\n\nAhmes 300 years later divided a larger hekat unity. Ahmes thought of 100\nhekat written as (6400/64) allowed divisions by 10, 20, 30, 40, 50, 60,\n70, 80, 90 and 100 in RMP 47 that were written as (6400)/64) times 1/10,\n1/20, 1/30, 1/40, 1/50, 1/60, 1/70, 1/80, 1/90 and 1/100 in 10 separate\nproblems.\n\nAhmes used additional hekat unities: 320/320 and 320 ro in RMP 35-38. In\nRMP 38, hekat unity 320 ro was multiplied by 7/22, with the answer 101 +\n9/11 ro multiplied by 22/7 that exactly returned 320 ro as a proof (ro =\n1/320 of a hekat).\n\nAhmes defined another class of unity:\n\n53/53 = 2/53 + 3/53 + 5/53 + 15/53 + 28/53\n\nin RMP 36.\n\nThe multiple hekat unity methods allowed , Greek, Arab and medieval\nscribes as late as to not get lost in unit fraction calculations.\n\nTaking a long historical view, Egyptian, Greek, Arab and medieval\nweights and measures defined region-wide economic units within localized\neconomic systems that spanned across 3,700 years of the Ancient East\nEast. Middle Kingdom Egyptians used scaling methods, such as:\n\n4/13 by LCM 4 to 16/52 = (13 + 2 + 1)/52 = 1/4 + 1/26 + 1/52.\n\nwith 13 + 2 + 1 recorded in red.\n\nArabs, and Fibonacci scaled difficult rational numbers, like 4/13 by two\nLCMs, considering\n\n4/13 to 1/4, with remainder 3/52 scaled by 1/18 to obtain a final\n\n1/4 + 1/18 + 1/468\n\nseries, thereby maintained the unit fraction system a few more years.\n\nThe oldest unit fraction system formally began in 2050 BCE, and ended in\nEurope in 1454 AD when the Liber Abaci fell out of favor. The unit\nfraction system completely ended in 1637 AD when the Arab world\nintroduced modern Arabic script, destroying linguistic connections to\nthe very old economic system.\n\nGodel’s platonism postulated a mathematical intuition that allowed\nperceptions of mathematical objects, but not the precise mathematical\nlanguage that describes the object. This view resemblances things\nHusserl said about mathematics, and supports Kant’s proposed idea that\nmathematics can be analytic-synthetic distinction: conceptual\ncontainment (synthetic), A priori, and a posteriori (philosophy). Philip\nJ. Davis and Reuben Hersh suggest in ’The Mathematical Experience’ that\nmost mathematicians act as Platonists, even though, if pressed to defend\nthe position carefully, they may retreat from this formalism taken from\nthe philosophy of mathematics.\n\nMathematicians may infer opinions that amount to nuanced versions of\nPlatonism. These ideas are best described as neo-platonism.\n\nCONCLUSION Modern neo-platonic points of view provide unclear templates\nto decode ancient Greek and texts. To decode Greek number theory,\narithmetic, algebra, and geometry the Greek word multitude must be\nunderstood as ancient scribes reported finite least common multiples as\na scaling idea. To Greek arithmetic that followed the older Egyptian\narithmetic scaled rational numbers n/p by LCM m to mn/mp. The best\ndivisors of mp were pondered in red numbers that summed to numerator mn\nin the RMP, Kahun Papyrus 2/n tables that reported 2-term, 3-term,\n4-term and 5-term series To multitude m scaled rational numbers n/p by\nLCM m to (n/p - 1/m) = (mn - p)/mp, before setting (mn-p) = 1 whenever\npossible to 2-term series, and when not possible selected a second m\nthat calculated 3-term series.",
  "language": "INFORMAL",
  "phrase": "Plato'S Mathematics",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/PlatosMathematics"
    }
  ],
  "indexable": true
}