{
  "alternatePhrases": [
    "remainder arithmetic",
    "Egyptian fractions",
    "Egyptian math"
  ],
  "definition": "INTRODUCTION: Scholarly Egyptian fraction debates date to 1862. These\ndebates decode aspects of the 1800 BCE math and math from other texts.\nThe Berlin Papyrus hinted at a scribal square root method solved two\nsecond degree equations, and a pesu (inverse proportion) method (decoded\nin 1900).\n\nClosely related textual debates include the 1650 BCE Rhind Mathematical\nPapyrus(RMP)(published by 1879 in Germany), the 1900 BCE Akhmim Wooden\nTablet (published in 1906) and the 1900 BCE Egyptian Mathematical\nLeather Roll (EMLR) (published by 1927 England) offer subtle Egyptian\nfraction issues that slowly give up ancient scribal math secrets. For\nexample, a was published in Dec. 2012.\n\nThe 1879 Egyptian fraction phase of the debate began after a bootleg\ncopy of the RMP was taken from the British Museum and published in\nGermany. British, German, European, USA and Arab scholars debate the RMP\nmath themes begin with a hard-to-read RMP 2/n table. The 1927 arithmetic\ndebate placed in concrete an additive conclusion with the publication of\nPeet and Chace’s additive view of the RMP 2/n table offered a misleading\npoint of view.\n\nIn 1900 the inverse proportion pesu was decoded as a method that solved\ntwo second degree equation. Later analysis of the pesu revealed\nadditional remainder arithmetic properties.\n\nIn 1901 and 1906 the Akhmim Wooden Tablet reported a volume unit (a\nhekat) scaled by 1/3, 1/7, 1/10, 1/11 and 1/13. Georges Daressy found\nthe exact aspect of the 1/3, 1/7 and 1/10 cases. It took until 2001 for\nHana Vymazalova to report the exact aspect of the 1/11 and 1/13 cases by\npointing out an initial hekat unity written as (64/64).\n\nIn 1927 scholars suggested the EMLR text would shed light on the RMP and\nother scribal Egyptian fraction methods. The 26 line 1800 BCE EMLR was\nunrolled and additively read by British Museum scholars. An anticipated\ndeeper understanding of Egyptian arithmetic was not reported. Several\nearly 1930’s German scholars suspected that the , at some point, would\nprovide deeper insights.\n\nIn 1933 the events that led up to World War II virtually stopped\nEgyptian fraction research. Research started up again in 1945. Research\nslowly progressed over the next 50 years. Gillings published an\nexcellent summary of the available Egyptian fraction texts in 1972 and\nindirectly mentioned the Akhmim Wooden Tablet. Gillings accepted the\nmajority of the 1920’s additive views of Peet and Chace while adding\nseveral minor suggestions as aids to read the most popular texts.\n\nBy 2004, scholars began to discuss abstract Egyptian math themes by\nidentifying scaled aspects of 2/n table unit fraction series used in the\nRMP’s 87 problems and the 26 line EMLR. Additional Egyptian fraction\ntexts have been brought into the larger debate also report abstract\nthemes.\n\nIn 2004 three publications jump-started abstract aspects of Egyptian\nfraction arithmetic. The first was an algebraic version of 22 EMLR\nconversions of rational numbers created by six multiples. The multiples\nmay have been non-additive multiples. They hinted at a deeper arithmetic\nlikely used by Ahmes. The EMLR multiple method was soon connected to the\nsecond publication, the 1202 AD Liber Abaci’s and seven rational number\nconversion methods published by Sigler. The Liber Abaci had been read\nfor years in fragmentary ways. Finally the full text was translated from\nLatin to English. The third publication was the 1900 BCE Akhmim Wooden\nTablet. This text hinted at an abstract form of Egyptian remainder\narithmetic. The paper was published by Vymazalova, a Charles U. graduate\nstudent.\n\nIn 2007 a lease common multiple method connected the first 2002\npublication to the 2004 publication. The LCM method allowed EMLR and RMP\nEgyptian fraction data to be computed by an identical method. By\nconsidering the entire scope of Egyptian fraction literature that six\nnon-optimal EMLR multiples had been adapted by Ahmes, the RMP scribe,\ninto a single optimal multiple method. Ahmes seemed to easily convert 51\n2/n table rational numbers to optimized Egyptian fraction series by\nselecting an optimal multiple. Research continues to parse Ahmes’ math\nspecifics. All that is known for sure is that Ahmes used ’red auxiliary’\nnumbers, an LCM method. Ahmes’ selection of an optimal multiple may have\nalso considered Akhmim Wooden Tablet and RMP remainder arithmetic.\n\nIn 2008 the RMP 2/n table was read in terms of RMP 36. Additional\nscribal 2/n table construction methods were published on-line in and .\n\nBACKGROUND: Using Webster’s new collegiate dictionary, an Egyptian is\ndefined by: 1. a native or inhabitant of Egypt; 2. the Afro-Asiatic\nlanguage of the ancient Egyptian from the earliest time to the 3rd\ncentury A.D.\n\nBy adding the word fraction to the word Egyptian, creates the phrase:\nEgyptian fraction. This narrative will show that Egyptians living before\nthe 3 century A.D. wrote Egyptian fractions in ways that took over 115\nyears of debate to ’break the ancient scribal code’ of Egyptian fraction\narithmetic. The 115 year narrative’s definition of an Egyptian fraction\ndisallows the interjection of post-300 AD non-Egyptian fraction ideas\nand methods, such as represented by the modern greedy algorithm, and\nother modern decoding attempts that had hidden the ancient scribal\nmethods from full view.\n\nFor example, by removing the modern idea of algorithm, and its 800 AD\nbirth, as a decoding possibility, the 2/n table and the EMLR methods\nbegan to be fairly decoded in other ways. That is, the possible greedy\nalgorithm’s use in the Liber Abaci (as noted by Sylvester in 1891 in the\nlast of its Egyptian fraction methods) only included the use of a second\nsubtraction step, and not an n-step algorithm. In other words, by\nplacing algorithms, and other none scribal arithmetic suggestions (like\nfalse position) aside, the central outline of 2,000 BCE scribal\narithmetic come into view.\n\nThree of the four scribal arithmetic operations look much like our own\nmodern arithmetic operations. The older duplation multiplication\noperation was unique to Egyptian mathematics. Aspects of remainder\narithmetic may have been disliked by Greeks, and Arabs. By the time of\nthe Liber Abaci (1202 AD), Greek and Arab lattice multiplication came\ninto dominance, thereby replacing the multiplication method Yet, the\nolder Egyptian arithmetic’s use of addition, subtraction and division\noperations looked nearly the same in 1650 BCE, as they did in 1202 AD,\nwithing three arithmetic operations.\n\nGenerally ancient scribes wrote rational numbers as exact unit fraction\nseries in optimal ways. The scribal methods for converting rational\nnumbers has been a murky subject, in several respects. Hence few modern\nscholars have ventured into the deeper aspects of all four of the\nancient scribal arithmetic topics, as they relate to the 4,000 year time\nperiod, since their first appearance. In other words, this summary is\nintended to high-light a few of the murky aspects of this longer\narithmetic subject reporting for the first time a unified definition of\nthe older Egyptian fractions.\n\nReturning to a broader Egyptian fraction decoding topic, the first\nchapter stresses that the Egyptian Mathematical Leather roll and its\nconversion of 1/p and 1/pq unit fractions to Egyptian fractions was an\nancient teaching tool for anyone wishing to become a scribe. The EMLR\nstudent raised its simple set of unit fractions to multiples of 2, 3, 4,\n5, 7, and 25, as needed, and then parsed his/her denominators by\nmultiples of the denominator. For example 1/3 was raised 2/2 = 2/6,\nallowed 1/3 + 1/3, a non-Egyptian fraction looking definition to be\nstated. Next 1/4, one of the binary numbers was raised to 4/4= 3/12,\nallowing (2 + 1)/12 to write 1/6 + 1/12. In total, the EMLR converted 26\nlines of Egyptian fractions, several repeated 1/p or 1/pq unit\nfractions, converted by a different multiple of 2, 3, 4, 5, 7 and 25,\nand finding not-so-elegant Egyptian fraction series.\n\nThe second decoding chapter begins with elegant two-term Egyptian\nfraction series for 2/pq vulgar fractions. Ahmes is reported as using an\noptimal method.\n\nCONCLUSION: Egyptian and medieval unit fractions texts report general\nconversions of rational numbers to optimal and not-so-elegant unit\nfraction series. Ahmes, for example, wrote exact unit fraction series by\nan abstract scaling method. Seven rational number conversions methods,\nin three notations, were summarized in the 1202 AD Liber Abaci. Four\nLiber Abaci methods hint at 2,800 year older 2/n tables. Scribal methods\nin 1202 AD scaled rational numbers by a subtraction method. The 1650 BCE\nand older method scaled rational numbers by a multiplication method.\n\nScribal methods used in 1650 BCE partitioned a volume unit named the\nhekat to hin, dja, ro and other sub-units. Scribal weights and measures\nsystem scaled quotients and remainders in interesting ways, one was\nsquare root. Pharaohs were interested in controlling beer, bread, grain\nand other vital national inventories by scaling every rational number\nremainder, if possible. Egyptian fraction controls recorded in the\nAkhmim Wooden Tablet used a remainder arithmetic system that double\nchecked rational number results. Hekat units included the hin, oipe, dja\nand ro. Hekat units partitioned vulgar fractions in weights and measures\napplications. Several classes of remainder arithmetic units were cited\nin Egyptian fraction texts. One class was recorded in the Reisner\nPapyri. Several classes were recorded in the RMP. The Reisner and RMP\nreported a common production rate system that scaled to units of 10 to\nmeasure production outputs of workers days, likely in 10 hour days.\n\nScholars often consider three math windows to parse Egyptian fraction\ntexts. Modern and scribal algebra offers one Egyptian fraction window.\nScribal 2/n tables and optimized (but not optimal) least common multiple\nmethods offer a second window. Remainder arithmetic applications used\nwithin weights and measures offers a third window. Considering the three\nmath windows, scholars have debate Egyptian fraction methods for about\n150 years. Happily, the Egyptian fraction debate is winding down.\nAgreements are being reached concerning theoretical and abstract aspects\nof the oldest Egyptian fraction arithmetic. A central element of the\nabstract arithmetic was remainder arithmetic.\n\n[8]{}\n\nGeorges Daressy, *\"Calculs Egyptiens du Moyan EmpireÃ‚Â¢?, Recueil de\nTravaux Relatifs De La Phioogie et al Archaelogie Egyptiennes Et\nAssyriennes XXVIII, 1906, 62Ã‚Â¢72*, Paris, 1906. Milo Gardner, *The\nEgyptian Mathematical Leather Roll Attested Short Term and Long Term,\nHistory of Mathematical Sciences*, Hindustan Book Company, 2004. Milo\nGardner, *An Ancient Egyptian Problem and its Innovative Solution,\nGanita Bharati*, MD Publications Pvt Ltd, 2006. Richard Gillings,\n*Mathematics in the Time of the Pharaohs*, Dover Books, 1992. T.E. Peet,\n*Arithmetic in the Middle Kingdom*, Journal Egyptian Archeology, 1923.\nTanja Pommerening, *“Altagyptische Holmasse Metrologish neu\nInterpretiert” and relevant phramaceutical and medical knowledge, an\nabstract, Phillips-Universtat, Marburg, 8-11-2004, taken from \"Die\nAltagyptschen Hohlmass*, Buske-Verlag, 2005. L.E. Sigler, *Fibonacci’s\nLiber Abaci: Leonardo Pisano’s Book of Calculation*, Springer, 2002.\nHana Vymazalova, *The Wooden Tablets from Cairo:The Use of the Grain\nUnit HK3T in Ancient Egypt, Archiv Orientalai*, Charles U Prague, 2002.",
  "language": "INFORMAL",
  "phrase": "Remainder Arithmetic Vs Egyptian Fractions",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/RemainderArithmeticVsEgyptianFractions"
    }
  ],
  "indexable": true
}