{
  "alternatePhrases": [],
  "definition": "Red auxiliary numbers, from Wikipedia\n\nAhmes practiced selections of a least common multiple (LCM) m in RMP\n7-23. The majority of Rhind Mathematical Papyrus problems report red\nnumbers that assisted conversions of rational numbers n/p scaled by an\nLCM m to mn/mp. In RMP 36, and all other prolbems, the red auxiliary\nnumbers were summed to numerator mn. Ahmes obtained an optimized unit\nfraction series.\n\nFor examples, 3/53 was scaled by LCM 20 to 60/1060 that considered\nauxiliary numerator (53 + 4 + 2 + 1)/1060 was written out as 1/20 +\n1/265 + 1/530 + 1/1060, a component of solving the unity statement 53/53\n= 2/53 + 3/53 + 5/53 + 15/53 + 28/53.\n\nIn RMP 37 two additional red number methods specified that any series of\nunit fractions could be individually inverted to a red number numerator.\nAhmes showed that 1/4 and 1/8 could be scaled by LCM 72 playfully\nrecalling that non-optimal unit fractional series were available as\nproofs of denominator. Ahmes recorded 1/4 = 72/288 = (9 + 18 + 24 +3 + 8\n+ 1 +8 + 1)/288 = 1/32 + 1/16 + 1/12 +1/96 + 1/36 + 1/288 + 1/36 + 1/288\nin an out-of order EMLR-like series. Recording 1/8 = 72/576 = (8 + 36 +\n18 + 9 + 1)/576 = 1/72 + 1/16 + 1/32 + 1/64 + 1/576, another EMLR-like\nseries.\n\nRed auxiliary numbers had been noted by historians for 130 years. Most\nhistorians muddled the historical purpose and applications of the red\nscribal data. An initial purpose allowed LCM m to be selected that\nconverted 2/n rational numbers into a table rational numbers to\noptimized, but not always optimal, Egyptian fraction series. Math\nhistorians like F. Hultsch began to parse basic aspects of the red\nauxiliary number applications in the 19th century. Early math historians\nrecognized that red numbers were connected to LCM, but the specific\ncontext was left vague until the 21st century.\n\nIt took over 120 years years to fully parse the RMPs three applications\nof red auxiliary numbers. As a review, Ahmes’ red auxiliary problems was\nsummarized by George G. Joseph, “Crest of the Peacock” in 1993, as\nfragmented details from which ancient scribal students learned to apply\nthe method. On page 37, example 3.7 Joseph reports:\n\nComplete 2/3 + 1/4 + 1/28 to 1.\n\nThis meant: solve $$2/3 + 1/4 + 1/28 + x = 1$$ (example 3.7)\n\nThe lowest common denominator (LCM) was not 28, or 84, but rather 42.\nUnskilled modern students would multiple 3 times 28 finding an LCM of\n84. But 42 was sufficient for Egyptian scribes as noted by:\n\n$$84/3 + 42/4 + 42/28 + 42x = 42$$ (example 3.7.1)\n\nas written in fractions\n\n$$28 + (10 + 1/2) + (1 + 1/2) + 2 = 42$$ (example 3.7.2)\n\nwith 42 marked in red. Modern algebra would have included 42x, solving\n\n$$42x = 2$$\n\n$$x = 2/42 = 1/21$$ (example 3.7.3)\n\nmeaning scribes would have a written final series in the form:\n\n$$2/3 + 1/4 + 1/28 + 1/21 = 1$$ (example 3.7.4)\n\nThe RMP included three problems that asked Ahmes to complete a series of\nfractions adding to a given number. Two problems, RMP 21 and RMP 23,\nfollow:\n\nRMP 21: Complete $$2/3 + 1/15 + x = 1$$\n\nuse red auxiliary number 30 to find\n\n$$60/3 + 30/15 + 30x = 30$$\n\n$$20 + 2 + 8 = 30$$\n\n$$30x = 8$$\n\n$$x = 8/30 = 4/15 = (3 + 1)/15 = 1/5 + 1/15$$\n\nsuch that:\n\n$$2/3 + 1/5 + 2/15 = 1$$\n\nwas written as:\n\n$$2/3 + 1/5 + 1/10 + 1/30 = 1$$\n\nRMP 23: Complete $$1/4 + 1/8 + 1/10 + 1/35 + 1/45 + x = 2/3$$\n\nuse red auxiliary 45 to compute $$x = 1/9 + 1/40$$\n\nIn addition, RMP 36 solved 2/53, 3/53, 5/53, 28/53 and 30/53 by finding\nred auxiliary numerators considering:\n\n2/53\\*(30/30) = 60/1590 = (53 + 5 + 2)/1590 = 1/20 + 1/318 + 1/795\n\n3/53\\*(20/20) = 60/1060 = (53 + 4 + 2 + 1)/1060 = 1/20 + 1/265 + 1/530 +\n1/1060\n\n5/53\\*(12/12) = 60/636 = (53 + 4 + 2 + 1)/636 = 1/12 + 1/159 + 1/318 +\n1/636\n\n28/53\\*(2/2) = 56/106 = (53 + 2 + 1)/106 = 1/2 + 1/53 + 1/106\n\nand,\n\n30/53 = 2/53 + 28/53\n\nwith numerators (53 + 5 + 2), (53 + 4 + 2 + 1) and (53 + 2 + 1) written\nin red.\n\nNote that 30/53 can not be solved by finding one LCM integer. In RMP 31,\n28/97 also can not be solved by finding one LCM. In both cases the 2/n\ntable allowed conversions of 30/53 and 28/97 to optimized unit fraction\nseries to be found. In the 30/53 case, 30/53 became 2/53 + 28/53. In the\n28/96 case, 28/97 was parsed to 2/97 + 26/97. That is, the 2/n table\nallowed almost any rational number, n/p and n/pq, to be converted to an\noptimized, but not always optimal unit fraction series, by first\nconsiderring n/p = 2/p + (n-2)/p, and n/pq = 2/pq + (n- 2)/pq.\n\nIt turns out that the Egyptian Mathematical Leather Roll (EMLR) and the\nRMP 2/n table employed LCM’s to convert rational numbers to Egyptian\nfraction series. Interestingly, the EMLR used non-optimal LCMs allowing\nstudents to select any LCM guess and work out an Egyptian fraction\nseries. More importantly, the RMP began with 1/3 of the text reporting\n51 2/n optimized, but not always optimal, Egyptian fraction series.\n\nThat is, red auxiliary numbers defined a core method that math\nhistorians pondered for 130 years, but did not see. Visibility began to\nappear around 2002 with publications of the EMLR, the Akhmim Wooden\nTablet, the Ebers Papyrus, and other Egyptian fraction texts.\n\nUnderstanding Ahmes’ ’red auxiliary’ numbers, and its proto-number\ntheory properties, allows RMP arithmetic methods to come into focus.\nRecent journal papers report Egyptian fraction arithmetic in updated\nways. One of the more important updates reports scribal multiplication\nand division of rational numbers as inverse operations. The ancient\narithmetic operations had not followed duplation multiplication, as\nproposed for over 100 years, but the ancient operations in RMP 38, and\nother problems, looked and acted more like modern multiplication and\ndivision operations.\n\nThree 2001 Russian math encyclopedia entries discuss this Egyptian\nfractions topic beginning with a modern definition of LCMs. The\nencyclopedia was published on-line by Springer, with one suggesting\nancient LCMs were known to Ahmes by writing:\n\n$$3/11 = 1/6 + 1/11 + 1/66$$\n\nand, converting\n\n$$3/11* (6/6) = (18/66) = (11 + 6+ 1)/66 = 1/6 + 1/11+ 1/66$$\n\nThe mentions modern LCMs, and did not attempt to take an ancient leap\nback in time. Had a formal hypothesis been offered a clear path from the\npresent to a 4,000 year old ancient academic discussion would have be\nset in an interdisciplinary context. Proof, or disproof, that Ahmes\nthought in a modern version LCMs could then be formally presented.\n\nA generally reports an ancient aliquot fraction or ratio idea (Russian\nterms for red auxiliary numbers) without identifying a hypothetical use\nof ancient LCMs.\n\nConsidering the three Russian entries, Ahmes’ three LCM practice\nproblems, and Ahmes’ 2/n table patterns as one topic, a clear outline of\na proof that Ahmes did use a modern LCM definition is provided.",
  "language": "INFORMAL",
  "phrase": "Red Auxiliary Numbers, The First Lcm Method",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/RedAuxiliaryNumbersTheFirstLCMMethod"
    }
  ],
  "indexable": true
}