{
  "alternatePhrases": [],
  "definition": "Reisner Papyrus, From Wikipedia\n\nThe Reisner Papyrus (RP) is one of the basic hieratic\nmathematical/economic texts. The text was found in 1904 by George\nReisner and dates to the 1800 BCE period. The text was translated in the\n1920s close to its historical arithmetic, omitting several basic\neconomic implications. The document is housed in the Boston Museum of\nFine Arts (MFA) along with supporting several documents. Gillings and\nother scholars reported out-dated 1920s views of the arithmetic and\neconomic implications by accepting misleading translations.\n\nThe text’s tables 22.2 and 22.2 detail a scribal division by 10 method.\nThe method also appears in the first six problems solved in the 1650 BCE\nRhind Mathematical Papyrus(RMP). Egyptian fractions data followed a\nmethod defined in the Egyptian Mathematical Leather Roll(EMLR) and the .\nLabor efficiencies and wage payments were included the Reisner Papyrus.\nDockyard workshop labor was monitored in man-days by applying a division\nby 10 method. Wage payments were monitored by disks, pegs, cones and\ndiamond shaped objects that could be placed around a worker’s neck,\nnamed Terseset (trssr). This class of objects was mentioned in the Kahun\nPapyrus.\n\nThe arithmetic computed a labor efficiency rate by answering how deep\ndid 10 workmen dig (in building a chapel) in one day? Gillings in\n“Mathematics in the Time of the Pharaohs”, repeated an incomplete view\nof the RP. Gillings analyzed lines G10, from table 22.3B, and line 17\nfrom Table 22.2 on page 221, divided\n\n39 by 10 = 4,\n\na poor rounded off approximation, as properly corrected by Gillings to:\n\n39/10 = (30 + 9)/10 = 3 + 1/2 + 1/3 + 1/15\n\nYet, other RMP division by 10 answers were correctly stated as scribal\nquotients and remainders, facts that Gillings did not discuss in scribal\neconomic and mathematical terms. Table 22.2 described the work done in\nthe Eastern Chapel. Additional raw data was listed on lines G5, G6/H32,\nG14, G15, G16, G17/H33 and G18/H34, as follows:\n\n12/10 = 1 + 1/5 (G5)\n\n10/10 = 1 (G6 and H32)\n\n8/10 = 1/2 + 1/4 + 1/20 (G14)\n\n48/10 = 4 + 1/2 + 1/4 + 1/20 (G15)\n\n16/10 = 1 + 1/2 + 1/10 (G16)\n\n64/10 = 6 + 1/4 + 1/10 + 1/20 (G17 and H33)\n\n36/10 = 3 + 1/2 + 1/10 (G18 and H34)\n\nPeet in 1923 and Robins-Shute in 1987 noted the RP division by 10 method\nas also explained in the RMP. Peet and Robins-Shute muddled the\nquotients and remainders basis of the RP, and the RMP. Scholars from the\n1920s had taken an additive position that muddled the reading of the\nfirst six problems of the RMP missing meta aspects of the 150 year older\nRP quotient and remainder method.\n\nGillings, Robins-Shute. and 1920’s scholars (i.e. Peet) had not analyzed\nRMP data in a meta context. Early scholars had only reported\ntransliteration aspects of hieratic arithmetic. Meta mathematical\naspects of the RP, for example, connect its arithmetic to the Akhmim\nWooden Tablet (AWT), the RMP, and to other texts, had been omitted by\nscholarly reviews. That is, Gillings’ review of the RP, and RMP, had\nscratched the surface of hieratic arithmetic. Had scholars dug a little\ndeeper, looking for meta mathematics, they may have found 80 years ago\nthat quotients and remainders had been present in the RP, correcting its\n39/10 error, as well as structuring several hieratic mathematical texts.\n\nThe RP errors could have been resolved by Gillings in terms of a\npossible uses of well known scribal quotients and remainders. Ahmes and\nscribes used the RP method many times. Ahmes has been minimized by 1920s\nscholars to have not fully understood meta quotients and remainders.\n\nThe RMP’s first six problems were written in a meta division by 10\ncontext that scales quotients and remainders. Gillings had forgotten to\nsummarize his RP findings in a rigorous mathematical manner. Had he done\nseveral Middle Kingdom texts would have identified that used the same\nscaled rational numbers recorded to concise unit fraction quotients and\nremainders.\n\nSeen on a meta level it is clear that the Reisner Papyrus scribe\nunderstood:\n\n39/10 = (Q’ + R)/10 with Q’ = (Q\\*10), Q = 3 and R = 9\n\nsuch that:\n\n39/10 = 3 + 9/10 = 3 + 1/2 + 1/3 + 1/15\n\nwith the remainder written in Egyptian fractions. The remainder 9/10 was\nconverted to a unit fraction series by following scaling rules set down\nin the AWT, the EMLR, and other hieratic texts. The RP was one of\nseveral texts that structured the 150 year younger RMP, that began with\nsix RP-type labor valuation problems.\n\nThe RP remainder arithmetic has been directly confirmed by older and\nyounger hieratic texts. The oldest text was the 2000 BCE to 1850 BCE\nAWT. The AWT defined scribal remainder arithmetic in term of another\nscaled rational quotient and remainder context, a hekat volume unit\nscaled to 64/64. The AWT wrote quotients as integers and binary\nfractions, and scaled (by a multiplier 5/5) remainders. Oddly, Gillings\ndid not cite aspects of this vivid AWT arithmetic in “Mathematics in the\nTime of the Pharaohs”, even though the AWT was included in the index of\nGillings other-wise ecellent book.\n\nGillings and 1920’s scholars had missed several opportunities to point\nout likely uses of scribal remainder arithmetic built upon quotients and\nremainders. Gillings and the 1920s academic community that preceded him\nhad inadvertently omitted a critical scaled rational number discussions\nof scribal remainder arithmetic. Remainder arithmetic had been used in\nother ancient Near East situations, two being solar and lunar calendars.\nGeorges Daressy suggested a third use of AWT remainders within a\ndiscussion that was not revisited by Hana Vymazalova until 2002, a topic\nthat was confirmed by a generalized approach in 2006.\n\nConcerning labor wages, MFA 24 is a disk used to pay 2/3 hekat in wages\nover a 10 day period meant that daily wages were 1/15 hekat and monthly\nwages 2 hekat for a foreman of a work crew. Higher classifications of\nworkers were paid upto to 8 hekat a month based on family size.\nConfirming information is included in the Hekanakaht Papers and the Abu\nSir Papyri.\n\nIn summary, the RP was built upon a division of a hekat method described\nin the AWT, a text 200 years older than the RP. The RP method was\nadopted by Ahmes in the 150 year younger RMP. Concerning modern\nscholarship, the RP method follows Occam’s Razor, the simplest method is\nthe historical method. The RP remainder was written in terms of:\n\nn/10 = Q + R/10\n\nwhere Q, an integer or zero quotient, and R, a remainder.\n\nThe RP reports a 10 workmen digging rate using an exact quotient and\nremainder method. The digging rate method was reported in the RMP within\nits first six problems, thereby confirming the RP division method as a\nmeta formula.\n\nThe wage payment side of the terseset(trsst) method has been confirmed\nby the Kahun Papyrus, the Hekanakht Papers and the Abu Sir Papyrus.\n\n[6]{} Milo Gardner, *An Ancient Egyptian Problem and its Innovative\nSolution, Ganita Bharati*, MD Publications Pvt Ltd, 2006. Richard\nGillings, *Mathematics in the Time of the Pharaohs*, Dover Books, 1992.\nT.E. Peet, *Arithmetic in the Middle Kingdom*, Journal Egyptian\nArcheology, 1923. Gay Robins and Charles Shute, *The Rhind Mathematical\nPapyrus*, British Museum Publications, 1987, Dover reprint available.\nWilliam Kelly Simpson *The Reisner P*, JEA 59, 1973, pages 220-222. Hana\nVymazalova, *The Wooden Tablets from Cairo:The Use of the Grain Unit\nHK3T in Ancient Egypt, Archiv Orientalai*, Charles U Prague, 2002.",
  "language": "INFORMAL",
  "phrase": "Reisner Papyrus",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/ReisnerPapyrus"
    }
  ],
  "indexable": true
}