{
  "alternatePhrases": [
    "Egyptian math"
  ],
  "definition": ", From Wikipedia\n\nThe Rhind Mathematical Papyrus (RMP) has been housed in the British\nMuseum since 1864, and first published in 1879. Germans had visited the\nBritish Museum and published the text without permission, the first of\nmany controversies associated with decoding the scribal contents in an\nattested historical context.\n\nThe papyrus is named after Alexander Henry Rhind a modern era owner.\nRhind, a Scottish antiquarian, purchased the papyrus in Luxor , Egypt in\n1858. The papyrus was apparently found during an illegal excavation near\nthe Ramesseum. The British Museum(BM) acquired the RMP in 1864 along\nwith the Egyptian Mathematical Leather Roll (EMLR). Both documents were\ngifted to the BM after the untimely death of Henry Rhind. There are\nfragments of the RMP held by the Brooklyn Museum in New York.\n\nThe RMP is one of two well-known Middle Kingdom mathematical papyri. The\nsecond is the Moscow Mathematical Papyrus (MMP). The RMP contains 87\nproblems. The MMP contains 25 problems. \\[1\\] A third lesser known text,\nthe Akhmim Wooden Tablet (AWT) added an exact hekat unity scaling issue,\n1 hekat = (64/64) hekat, and its encoding method was used by Ahmes over\n60 times. The hekat scaling method used in the RMP was not fully decoded\nuntil 2006.\n\nThe RMP dates to the Second Intermediate Period of Egypt and is the best\nexample of Egyptian mathematics. The RMP was partly copied by its scribe\nAhmes (Ahmose) from a now-lost text likely written during the reign of\nking Amenemhat III (12th dynasty). The hieratic papyrus is 33 cm tall\nand over 5 meters long has been fairly transliterated in the 19th, 20th\nand 21st centuries. Translations from the 19th, 20th and 21st centuries\ndiffer in subtle ways. The document dates to Year 33 of the Hyksos king\nApophis and contains a later date, Year 11 on its verso likely from his\nsuccessor, Khamudi.\\[2\\].\n\nIn the opening paragraphs of the papyrus, Ahmes presents the papyrus as\ngiving - Accurate reckoning for inquiring into things, and the knowledge\nof all things, mysteries…all secrets.\n\nContents: 1 Mathematical problems 2. Mathematical knowledge 3.\nConclusion.\n\n1\\. Mathematical problems\n\nThe papyrus was written on both sides. The text began with a RMP 2/n\ntable, followed by 87 problems. Taking one third of the manuscript, the\nRMP 2/n table expressed 2 divided by the odd numbers from 5 to 101 in\nterms of unit fraction series, written in increasingly larger\ndenominators. Unit fractions were not repeated. Ahmes conversion method\nwas parsed three fragmented ways by 20th century and earlier\nresearchers. One way was identified by F. Hultsch in 1895, and confirmed\nby E.M. Bruins in 1945. Today the aliquot part method is called the\nHultsch-Bruins (H-B) method. A second way was red auxiliary numbers\nnoted by least common multipliers (by Gillings and others). Two of the\nLCM ways are implied by the student- based Egyptian Mathematical Leather\nRoll, selected single and double LCMs per rational number conversion. A\nthird way, considered in 2001, factored 2/95 = (2/19)(1/5) before the\nHultsch-Bruins Method and red auxiliary numbers were applied. Improved\ntranslations of the 2/n table and its ancient scribal meanings are being\nproposed after 2008.\n\nAhmes central rational number conversion method used red auxiliary\nnumbers, a subtle decoding change fully published in the 21st century. A\nfresh translation of RMP 36, the EMLR, and the Akhmim Wooden Tablet all\nscaled n/p by the best LCM (m/m) used in the 2/n table. Ahmes can now be\nread as scaling n/p and 2/n vulgar fractions to concise, but not always\noptimal, Egyptian fraction series by selecting the best LCM m. The best\nLCM m scaled n/p to mn/mp and 2/n to 2n/nm within red auxiliary\nshorthand notes. The best divisors of denominators summed numerators mn\nand 2n that were written in red. The red auxiliary numbers allowed exact\nunit fraction series to be recorded. By 2008, 2009, and 2011, it was\nclear that Ahmes’ red auxiliary number method converted 2/95 by\nselecting 12 as a LCM 12 such that:\n\n(2/95)(12/12) = 24/(12)(95) = (19 + 3 + 2)/1140 = 1/60 + 1/380 + 1/570\n\nConfirmation of the 2008 analysis included AWT scalings of the hekat by\n64/ 64 and 320 ro was confirmed in 2009 data from RMP 36 and RMP 81\ndata. The 2008 and 2009 analyses showed that Ahmes frequently omitted\naspects of the three of the intermediate steps within an unclear\nshorthand notation. In 2011 the Ahmes’ shorthand omissions were\ncorrected by publishing ‘ab initio’ longhand statements of rational\nnumbers in all RMP problems and over 60 examples of hekat scaled by\n(64/64) and 320 ro. Concerning geometry, RMP 41, RMP 42 and RMP 43\napplied algebra to validate three geometric formulas, one for the area\nof a circle and two for volumes of circular granaries.\n\nConfusions existed for over 100 years related to fully decoding Ahmes’\narithmetic operations in a validated historical context. This confusion\ncaused 20th century math historians to improperly propose incorrect ’ab\ninitio’ arithmetic operations like ‘false position’. For example,\nGillings in 1972 reported valid LCM multipliers by suggesting ‘false\nposition’ defined scribal division. Oddly, the majority of 20th century\nhistorians agreed that ‘false position’was used by Ahmes and other\nhieratic math texts, likely the reason that Gillings repeated the\nmisleading suggestion.\n\nScholars in the 1920s had guessed at Ahmes’ calculation steps, often by\nciting three steps, all of which were not made clear until the AWT, the\nEMLR and EMLR was fully decoded in 2008, without using ‘false position’.\nScribal division followed a modern rule, invert and multiple.\n\nAppying Ahmes’ three-step red reference number method, the RMP’s 87\nproblems began with six division by 10 problems, the subject of the\nReisner Papyrus. RMP 1-6 selected optimized red reference numbers to\ncalculate quotient and exact remainder answers. Confusingly, Ahmes’\nshorthand notes only outlined duplation proofs, the context in which\n1920s scholars suggested dominated scribal methods. Ahmes, however,\nshowed that n/10 divisions were returned to unity by multiplying answers\nby its divisor (a point mentioned by Robins-Shute in 1987, but minimized\nby 1920s math historians). There were 15 problems that dealt with\naddition, and 18 algebra problems. There were 15 algebra problems of the\nsame type. The algebra problems asked the reader to find x and a\nfraction of x such that their sum equals an integer. RMP 33 solved\n\nx +(2/3 + 1/2+ 1/7)x = 37\n\nx + (55/42)x = 37\n\n(97/42)x = 37\n\nx = 1554/97\n\nas modern arithmetic operations require today, with division defined as\nthe inverse to modern multiplication method, without one use of\nscholarly ‘false position’.\n\nAhmes further considered\n\nx = (16 + 2/97) = (quotient + remainder)\n\nwith quotient 16 and remainder 2/97 converted to an Egyptian fraction\nseries as the 2/n table selected LCM (56/56) to reach (112/5432), and\nthe best divisors (97 + 8 + 7) = 112 so that the entire longhand\nremainder states: remainder\n\n= (2/97)(56/56) = (112/54342) = (97 + 8 + 7)/(5432) = 1/56 + 1/679 +\n1/77 meant\n\n(quotient + remainder) =\n\n16 + 1/56 + 1/679 + 1/776\n\nwas Ahmes’ answer.\n\nIn other words, Ahmes’ shorthand notes often began with answers within\nbinary (duplation) procedures that led to definitions of RMP problems.\nBut what did Ahmes arithmetic write, outside of duplation, translated\ninto modern base 10 decimal arithmetic state?\n\nAhmes shorthand note are now decoded by adding back missing arithmetic\nfacts to reach exact longhand ’ab initio’ translations.\n\nEach of Ahmes 14 algebra shorthand notes converted vulgar fraction\nanswers to exact unit fraction series. All 14 algebraic problem steps\ncan be corrected to ‘ab initio’ longhand translations, as mentioned\nabove, to better grasp Ahmes’ primal thinking process.\n\nGenerally, Ahmes unit fraction answers were converted to concise\nEgyptian fraction series by selecting red reference numbers that scaled\nrational numbers by LCMs that sometimes are were not cited in shorthand\nnotes. Ahmes often discussed incomplete shorthand duplation statements\nand proofs. Scribal statements and proofs varied in completeness. Ahmes\nshorthand omitted important arithmetical facts that can be decoded into\nreadable base 10 decimal statements by preparing corrected longhand\ntranslations.\n\nIn geometry, Ahmes’ problems 41 and 42 modified the area (A) of a circle\nformula by replacing radius (R) with diameter (D/2), with pi estimated\nby 256/81 that added volume (V) by multiplying by height (H) such that\n\nSqrt(A) =(8/9)(D) cubits squared (algebraic geometry formula 1.0)\n\nreported in the MMP 300 years earlier, and\n\nV = (3/2)\\[(8/9)(D)(8/9)(D)\\] cubits cubed (algebraic geometry formula\n1.1)\n\nRMP 43 scaled algebraic geometry formula 1.1 by 3/2 considering\n\n(3/2)Sqrt(A) = (3/2)(8/9)(D) = (4/3)D\n\nand\n\nV = \\[(2/3)H(4/3)(D)(4/3)(D)\\]khar (algebraic geometry formula 1.2)\n\na formula reported in the Kahun Papyrus 250 years earlier was implied by\nRMP 47 and the heka . Two arithmetical progressions (A.P.) were solved\nin RMP 40 and RMP 64. A common method was defined and applied in the\nKahun Papyrus(KP). RMP 64 problem solved the A.P. sharing 10 hekats of\nbarley, between 10 men, with a difference of 1/8th of a hekat implied 1\n+ 7/16 as the largest term. The second A.P. problem was RMP 40. The\nproblem divided 100 loaves of bread between five men such that the\nsmallest two shares were 1/7 of the largest three shares’ sum (87 1/2).\nAhmes found the shares for each man, which he did without finding the\ndifference (9 1/6) or the largest term (38 1/3). All five shares 38 1/3,\n29 1/6, 20, 10 2/3 1/6, and 1 1/3) were calculated by first finding the\nfive terms from a proportional A.P. that summed to 60. The median and\nthe smallest term, x1, were used to find the differential and each term.\nAhmes then multiplied each term by 1 2/3 to obtain the sum to 100 A.P.\nterms.\n\nX + 7x = 60\n\nIn RMP 81, 29 examples of Akhmim Wooden Tablet partitioned a hekat unity\n(64/64) by rational numbers 1/64 ¡ n ¡ 64. In addition 15 RMP problems\nwere similar to Moscow Mathematical Papyrus problems.\n\nFinally, 23 RMP weights and measures problems often discussed the hekat,\nwith three recreational diversion problems following, the last being RMP\n84, the famous multiple of 7 riddle, passed down to the Medieval era as\nAs I was going to St. Ives from other sources.\n\nThe Rhind Mathematical Papyrus also contains geometry related\nproblems:\\[3\\] ”If a pyramid is 250 cubits high and the side of its base\n360 cubits long, what is its seked?”\n\nThe solution to the problem is given as the ratio of half the side of\nthe base of the pyramid to its height, or the run-to-rise ratio of its\nface. In other words, the quantity he found for the seked is the\ncotangent of the angle to the base of the pyramid and its face.\\[3\\]\n\n2\\. Mathematical knowledge\n\nUpon closer inspection, modern-day mathematical analysis of Ahmes’\nproblem-solving strategies reveal a basic awareness of composite and\nprime numbers;\\[4\\] arithmetic, geometric and harmonic means;\\[4\\] a\nsimplistic understanding of the Sieve of Eratosthenes\\[4\\], and perfect\nnumbers.\\[4\\]\\[5\\]\n\nThe papyrus also demonstrates knowledge of solving first order linear\nequations\\[5\\] and summing arithmetic and geometric series.\\[5\\]\n\nThe papyrus formally calculated Pi as (8/9) squared, 256/81 in RMP 41,\n42, 43 and 44. However, earlier in RMP 38 Ahmes informally corrected\ngranary losses by a Pi estimate of 22/7.\n\nOther problems in the Rhind papyrus demonstrate knowledge of number\ntheory, arithmetic progressions, algebra and geometry.\n\nThe papyrus also demonstrated knowledge of weights and measures,\nbusiness, and recreational diversions.\n\n3\\. Conclusion\n\nAhmes’ 2/n table, which took up 1/3 of the entire papyrus, was the\nfundamental numerical foundation of the Middle Kingdom. Ahmes used the\nsystem to scale rational numbers (2/n) and (n/p) by LCMs (m/m) by\nmultiplication to reach (mn/mp) such that red auxiliary numbers, the\nbest devisors of (mp), were summed to numerator (mn) calculated concise\nunit fraction series. Within the RMP’s 87 problems 1920s scholars\nsuggested scribal ‘false position’ was the scribal division operation,\nwhich it was not. Only a modern division rule, an inverse multiplication\noperation, corrects scribal shorthand, exactly adds back missing steps,\nto translate scribal shorthand omissions to scribal longhand arithmetic\nstatements that are double checked against other Middle Kingdom math\ndocuments in the 21st century.\n\nThe RMP document is slowly disclosing its subtle number theory, and\ndeeper math secrets as one of the main sources of ancient Middle Kingdom\nEgyptian mathematics. To confirm the historical contents and scribal\nmethods used by Ahmes, the EMLR, MMP, KP and the AP must be consulted in\nways that 21st century scholars are learning to apply\n\n[9]{} Milo Gardner, *The Egyptian Mathematical Leather Roll Attested\nShort Term and Long Term, History of Mathematical Sciences*, Hindustan\nBook Company, 2002. Milo Gardner, *An Ancient Egyptian Problem and its\nInnovative Solution, Ganita Bharati*, MD Publications Pvt Ltd, 2006.\nRichard Gillings, *Mathematics in the Time of the Pharaohs*, Dover\nBooks, 1992. Oystein Ore, *Number Theory and its History*, McGraw-Hill\nBooks, 1948, Dover reprints available. T.E. Peet, *Arithmetic in the\nMiddle Kingdom*, Journal Egyptian Archeology, 1923. Tanja Pommerening,\n*“Altagyptische Holmasse Metrologish neu Interpretiert” and relevant\nphramaceutical and medical knowledge, an abstract, Phillips-Universtat,\nMarburg, 8-11-2004, taken from \"Die Altagyptschen Hohlmass*,\nBuske-Verlag, 2005. Gay Robins, and Charles Shute *Rhind Mathematical\nPapyrus*, British Museum Press, Dover reprint, 1987. L.E. Sigler,\n*Fibonacci’s Liber Abaci: Leonardo Pisano’s Book of Calculation*,\nSpringer, 2002. Hana Vymazalova, *The Wooden Tablets from Cairo:The Use\nof the Grain Unit HK3T in Ancient Egypt, Archiv Orientalai*, Charles U\nPrague, 2002.",
  "language": "INFORMAL",
  "phrase": "Rhind Mathematical Papyrus",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/RhindMathematicalPapyrus"
    }
  ],
  "indexable": true
}