{
  "alternatePhrases": [],
  "definition": "[*Wikipedia*]{} is a free online encyclopedia that anyone may edit. Its\ncoverage of elementary mathematical topics is almost , and its coverage\nof intermediate and advanced topics is adequate. Wikipedia has articles\non the integers in the $-2 < n < 201$ as well as 220, 284, 496, 666,\n720, 1138, 1729, 69105 and certain powers of ten. Its biographical\ncoverage of the most famous mathematicians and physicists (Albert\nEinstein, Gauss, Ramanujan, Wiles, etc.) is on par with that of the best\npaper encyclopedias, and there is often at least a couple of on the more\nobscure mathematicians.\n\nThe Wikipedia articles on mathematical (and other) themes are not only\nin English, but also in many other languages; the available language\nalternatives of a given article are found in a box in the left margin.\nThe contents of distinct language versions are not identical, and the\nEnglish version is not always the most comprehensive. Although Wikipedia\ncan usually be relied on for definitions of mathematical terms, it is by\ndesign not meant for mathematical proofs; Wikipedia has only the most\nfamous and elementary proofs (such as Euclid’s proof that there are\ninfinitely many primes).\n\nBecause anyone may edit Wikipedia and introduce intentional or\nunintentional computational errors, it is advisable to double-check or\nrecalculate any number from Wikipedia before using it in any intensive\ncalculations. Unlike PlanetMath, Wikipedia does not use the Mathematics\nSubject Classification codes to organize its entries on mathematical\ntopics; however, the PlanetMath Exchange does use the MSC codes to\ncoordinate exchange between PlanetMath and Wikipedia. This would seem to\nreveal the same as PlanetMath, but Wikipedia has articles on those\ntopics from a more physics-oriented standpoint.",
  "language": "INFORMAL",
  "phrase": "Wikipedia",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Wikipedia"
    }
  ],
  "indexable": true
}