{
  "alternatePhrases": [],
  "definition": "### The Language and Axioms {#the-language-and-axioms .unnumbered}\n\nThe language of axiomatic projective geometry is a first-order language\nconsisting of two sorts: point and line, and one binary predicate $I$\ncalled “incidence” between points and lines. There are various ways to\ncall $I(p,L)$: point $p$ is incident with line $L$, $L$ is incident with\n$p$, $p$ lies on $L$, $p$ is on $L$, or $L$ passes through $p$.\n\nThere are three axioms for projective geometry:\n\n**Axiom 1**. For any two distinct points, there is exactly one line\nincident with the points.\n\nIf $p,q$ are points, we write $pq$ or $qp$ for the line incident with\n$p$ and $q$.\n\nIn order to state the next axiom, we define the concept of meet or\nintersection: two lines meet or intersect if there is a point incident\nwith both lines, and that they are parallel if no such a point exists.\n\n**Axiom 2**. (Veblen’s axiom) For any four pairwise distinct points\n$p,q,r,s$, if $pq$ meets $rs$, then $pr$ meets $qs$.\n\nA set of points is said to be collinear if there is a line incident with\neach of the points. Axiom 2 can be equivalently stated as: if points\n$x,q,s$ are not collinear, and if $p\\ne x$ is a point on $xq$, and\n$r\\ne x$ is a point on $xs$, then $pr$ meets $qs$.\n\n**Axiom 3**. Each line is incident with at least three points.\n\n### Models {#models .unnumbered}\n\nA model of projective geometry is called a projective space. It consists\nof a set $\\mathcal{P}$ of points, a set $\\mathcal{L}$ of lines, and a\nrelation $I\\subseteq \\mathcal{P}\\times \\mathcal{L}$ such that the three\naxioms above are satisfied. In other words, a projective space is an\nincidence structure satisfying the conditions stated by the axioms.\nHere, lines and blocks are synonymous. In addition, if two lines are\nincident with the identical set of points, this set must contain at\nleast three points, and so by Axiom 1, the lines are identical. In other\nwords, any projective space is a simple incidence structure, and\ntherefore any line may be identified with the set of points on it, which\nwe will do for the remainder of the entry.\n\n$\\varnothing$, a single point with no lines, a single line with at least\nthree points, are all projective spaces. A prototypical example of a\nprojective space is $PG(V)$, where $V$ is a vector space over some\ndivision ring $k$. The points and lines of $PG(V)$ are one- and\ntwo-dimensional subspaces and of $V$, respectively, and incidence is set\ninclusion.\n\nAxiom 3 is sometimes known as the non-degeneracy axiom. With it, one can\nshow that any two lines are equipolent in a projective space, and with\nthis, the *order* of a projective space may be defined: it is one less\nthan the cardinality of a line in the space.\n\nWithout Axiom 3, we would end up with projective spaces such that some\nlines containing fewer than three points. These are either the\ndegenerate cases where $I$ is such that all three axioms are satisfied\nvacuously (for example, a point and a line with no incidence relation at\nall, etc..), or structures that are disjoint union of spaces (satisfying\nall three axioms) such that pairs of points from different spaces lie on\na line consisting of exactly the pair of points.\n\n### Subspaces and Dimensions {#subspaces-and-dimensions .unnumbered}\n\nWhat seems to be absent in the axioms of projective geometry is any\nmentioning of another fundamental notion: plane. In fact, a plane can be\ndefined using points, lines, and the incidence relation: a plane is the\nsmallest set $P$ of points (in the projective space) such that there is\na line $\\ell \\subseteq P$ and a point $p\\in P$ not on $\\ell$, such that\n$pq\\subseteq P$ for any $q$ on $\\ell$. We may write\n$P=\\langle p,\\ell\\rangle$, and say that $P$ is determined by $p$ and\n$\\ell$. It is not hard to see that any non-incident pair of a line and a\npoint on $P$ determine $P$. A plane in a projective space is also a\nmodel of a projective plane (but not all models of a projective plane\nare isomorphic!).\n\nMore generally, we may define a subspace of a projective space as a set\n$X$ of points such that if $p,q\\in X$, then $pq\\subseteq X$.\nEquivalently, a subspace of a projective space, viewed as an incidence\nstructure, is an incidence substructure (with inherited incidence\nrelation) that is also a projective space. Given a projective space, the\nempty set is a subspace, and so is any point (properly a one-point set),\nas well as any line, and any plane.\n\nDimensions can also be defined on subspaces of a projective space,\nrecursively: $\\varnothing$ has dimension $-1$, a point has dimension\n$0$, and if subspace $V$ has dimension $n$, then any subspace containing\n$V$ and any point not in $V$ has dimension $n+1$. This process can go\non, until the whole space itself is reached, in which case, we say the\nprojective space is finite-dimensional. Or, it can go on indefinitely,\nin which case we say that the space is infinite-dimensional. But for an\ninfinite dimensional projective space, what is its dimension, since\nthere are different magnitudes of infinity. Veblen has shown the\nfollowing:\n\n> any projective spaces of dimension $n>2$ (including infinite\n> dimensional ones) is isomorphic to $PG(V)$ for some vector space $V$.\n\nThus, we may instead define the dimension of a projective space to be\n$\\operatorname{dim}(V)-1$, where the space is isomorphic to $PG(V)$.\nThis definition extends the recursive one given earlier. This also shows\nthat if a projective space is infinite dimensional, its dimension is the\nsame as the dimension of the vector space that generates it. A more\ndirect way of defining dimension is to use the concept of independent\nspanning set of a projective space, similar to that found for vector\nspaces.\n\n[6]{} A. Beutelspacher, U. Rosenbaum [*Projective Geometry, From\nFoundations to Applications*]{}, Cambridge University Press (2000) O.\nVeblen, J. W. Young [*Projective Geometry, Volumes I & II*]{}, Ginn &\nCo., Boston, MA (1916)",
  "language": "INFORMAL",
  "phrase": "Axiomatic Projective Geometry",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/AxiomaticProjectiveGeometry"
    }
  ],
  "indexable": true
}