{
  "alternatePhrases": [],
  "definition": "Alfred B. Kempe () first used these chains, now called after him, in\n1879 in a “proof” of the four-color conjecture. Although Percy Heawood\nfound a flaw in his proof 11 years later, the idea of Kempe chains\nitself is quite sound. Heawood used it to prove 5 colors suffice for\nmaps on the plane, and the 1976 proof by Appel, Haken and Koch is also\nbased on Kempe’s ideas.\n\nThe original Kempe chains were used in the context of colorings of\ncountries on a map, or in modern terminology [**face colorings**]{} of a\nplane graph $G$ (such that no two adjacent faces receive the same\ncolor). The idea was extended by Heawood to embeddings of a graph in any\nother surface. Here\n\n-   a Kempe chain of colors $a$ and $b$ is a maximal connected set of\n    faces that have either of those colors. as in: you can travel from\n    any face in the set to any other, through the set. Maximal as in:\n    there are no more faces of those colors you could enlarge the set\n    with, i.e. that border the area you’ve already got.\n\nIn the modern dual formulation of the four-color theorem, faces of $G$\nare replaced by vertices of the dual graph $G^*$ (and vice versa);\nvertices are adjacent (linked by an edge) in $G^*$ whenever the\ncorresponding faces of $G$ were adjacent (sharing a border). It now\nbecomes a [**vertex coloring**]{} problem (again, adjacent vertices must\nreceive different colors). Here\n\n-   a Kempe chain of colors $a$ and $b$ is a maximal connected subgraph\n    containing only vertices of those colors. Connected as usual in\n    graph theory (there’s a path between any two vertices) and maximal\n    as in: there are no more vertices of those colors you could enlarge\n    the subgraph with, i.e. that are adjacent to a vertex you’ve already\n    got.\n\n    An alternative formulation: let $G(a,b)$ be the subgraph induced by\n    all the vertices of color $a$ or $b$ (that is, with all the edges\n    that run between those vertices). Now any connected component\n    $H(a,b)$ of $G(a,b)$ is a Kempe chain.\n\nWhile faces imply an embedding in a surface, the vertex version of the\ndefinition does not rely on any embedding. The chains are more useful in\nthe context of an embedding though.\n\nKempe chains of edges {#kempe-chains-of-edges .unnumbered}\n---------------------\n\nWith [**edge coloring**]{} of graphs (again, with different colors for\nadjacent edges i.e. those that meet at a vertex), an analogous concept\ncan defined. Here\n\n-   a Kempe chain of colors $a$ and $b$ is a maximal connected subgraph\n    where the edges have either of those colors. Connected and maximal\n    as before.\n\n    An alternative formulation: let $G(a,b)$ be the subgraph consisting\n    of all the edges of color $a$ or $b$ (with any vertices incident to\n    them). Now any connected component $H(a,b)$ of $G(a,b)$ is a Kempe\n    chain.\n\nWhile superficially similar to the previous definition, these “Kempe\nchains” are rather different animals. Their structure is far simpler. At\nany vertex of $H(a,b)$, there can be at most one edge of color $a$ and\none edge of color $b$ (at most two edges in all). Two things can happen:\n\n-   Every vertex in the chain has two such edges. In a finite graph,\n    this must mean a closed path (cycle). Note that, being colored\n    alternatingly, the number of edges must now be even.\n\n-   A vertex misses out on having an edge of one of those colors, and\n    the chain stops there (it can’t miss out on both colors because then\n    it wouldn’t be part of the chain). In a finite graph, the other end\n    of the chain must now also terminate somewhere (at a vertex that\n    misses out either one of the colors). The chain is an open path of\n    one or more edges (its length can be even or odd).\n\nKempe chain arguments {#kempe-chain-arguments .unnumbered}\n---------------------\n\nOne technique that can be used with all these types of chains is\n\n-   swapping the colors in one $H(a,b)$. This is always possible: by\n    definition, there are no adjacent items that could lead to a color\n    clash.\n\n    Kempe slipped up when he swapped an $H(a,b)$ and an $H(a,c)$ without\n    taking in account that swapping colors $a$ and $b$ in part of the\n    graph could alter the shape and connectedness of any $H(a,c)$, but\n    swapping colors in one Kempe chain at a time (and then taking stock\n    of the lay of the land afresh) is quite safe.\n\n    Swapping can be used to free up a color somewhere, see the for a\n    repeated use of this ploy on edge-based Kempe chains.\n\nSpecific to the use in plane graphs we have that\n\n-   if a Kempe chain forms a cycle, it disconnects the sphere or plane\n    area into disjoint parts (on the plane, inside and outside the\n    cycle).\n\nSpecifically when four colors are used for faces:\n\n-   The whole area is divided into red/green swathes and yellow/blue\n    ones. Alternatively, into red/yellow and green/blue ones. Or\n    red/blue and yellow/green ones.\n\nSpecifically for edge-based Kempe chains in regular $\\rho$-valent\ngraphs, if we try to edge-color the graph with only $\\rho$ colors:\n\n-   No vertex can miss out on any of the $\\rho$ colors, so every\n    $H(a,b)$ must be a cycle (of even length).",
  "language": "INFORMAL",
  "phrase": "Kempe Chain",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/KempeChain"
    }
  ],
  "indexable": true
}