{
  "alternatePhrases": [],
  "definition": "The Jacobi $\\vartheta$ functions are 4 basic functions of Jacobi’s\ntheory of elliptic functions. They are functions of two complex\nvariables, $z$ and $\\tau$, known as the argument and the half-period\nratio, respectively. It is often convenient to use the quantity\n$q=e^{\\pi i \\tau}$, which is known as the *nome*. When the half-period\nratio is used, these functions are denoted $\\vartheta_{j}(z|\\tau)$ (the\nindex $j$ runs from 1 to 4), and when the nome is used, the functions\nare denoted $\\vartheta_{j}(z;q)$. $q$ and $\\tau$ are sometimes snipped\nfor brevity when they are obvious from the context, and when that is\ndone, the functions are denoted $\\vartheta_{j}(z)$.\n\nThese functions can be defined by the following series. It is also\npossible to express them as products and — see the attachments to this\nentry for details.\n$$\\vartheta_{1}(z;q)=\\sum_{n=-\\infty}^{\\infty} (-1)^n q^{(n+1/2)^2} e^{(2n+1)iz}  = 2 \\sum_{n=0}^\\infty (-1)^n  q^{(n+1/2)^2} \\sin (2n+1) z$$\n$$\\vartheta_{1}(z \\mid \\tau)=\\sum_{n=-\\infty}^{\\infty} (-1)^n e^{i \\pi \\tau (n+1/2)^2 +(2n+1)iz}$$\n$$\\vartheta_{2}(z;q)=\\sum_{n=-\\infty}^{\\infty} q^{(n+1/2)^2} e^{(2n+1)iz} = 2 \\sum_{n=0}^\\infty q^{(n+1/2)^2} \\cos (2n+1) z$$\n$$\\vartheta_{2}(z \\mid \\tau)=\\sum_{n=-\\infty}^{\\infty} e^{i \\pi \\tau (n+1/2)^2 +(2n+1)iz}$$\n$$\\vartheta_{3}(z;q)=\\sum_{n=-\\infty}^{\\infty} q^{n^2} e^{2inz} = 1 + 2 \\sum_{n=1}^\\infty q^{n^2} \\cos (2nz)$$\n$$\\vartheta_{3}(z \\mid \\tau)=\\sum_{n=-\\infty}^{\\infty} e^{i \\pi \\tau n^2 + 2inz}$$\n$$\\vartheta_{4}(z;q)=\\sum_{n=-\\infty}^{\\infty} (-1)^{n} q^{n^2} e^{2inz} = 1 + 2 \\sum_{n=1}^\\infty (-1)^{n} q^{n^2} \\cos (2nz)$$\n$$\\vartheta_{4}(z \\mid \\tau)=\\sum_{n=-\\infty}^{\\infty} (-1)^{n} e^{i \\pi \\tau n^2 + 2inz}$$\n\nNote that these series converge for all complex values of $z$ whenever\n$|q| < 1$ (equivalently, when $\\Im \\tau > 0$). Furthermore, these series\nconverge uniformly on compact subsets (this may be shown using the\nWeierstrass M-test) so these functions are analytic.\n\nThe theta functions satisfy many identities, the most important of which\nare , , and Landen’s transformation. For these identities and others,\nplease see the attachments.\n\nThe theta functions were originally introduced because it is possible to\nexpress the Jacobi elliptic functions as ratios of theta functions. In\nsome ways, this role is similar to the role the complex exponential\nplays in the theory of trigonometric functions. Just as one can derive\ncomplicated trigonometric identities form the properties of the\nexponential functions, so too one can derive complicated identites for\nelliptic functions using the properties of theta functions.\n\nThey are very useful in the numerical analysis of elliptic functions,\nsince the series given above converge rapidly. Hence (as was realized\nearly on by Jacobi), it is usually better to compute elliptic functions\nby first computing theta functions.\n\nIn addition, theta functions are interesting in their own right and\nappear in numerous, often surprising contexts, as the following exampes\nshow. Theta functions appear as Green’s functions for the heat equation.\nIn number theory, they are used to study the representations of integers\nas sums of squares. Theta functions can be used to construct modular\nfunctions. They can be used to construct integral representations of\ngenerating functions. In theoretical physics, they are used to perform\nsums over crystals and describe hexagonal lattices of vortices.",
  "language": "INFORMAL",
  "phrase": "Jacobi $\\Vartheta$ Functions",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/JacobivarthetaFunctions"
    }
  ],
  "indexable": true
}