{
  "alternatePhrases": [
    "real",
    "$\\mathbb{R}$"
  ],
  "definition": "Definition\n==========\n\nThere are several equivalent definitions of real number, all in common\nuse. We give one definition in detail and mention the other ones.\n\nA [*Cauchy sequence of rational numbers*]{} is a sequence\n$\\{x_i\\},\\ i=0,1,2,\\dots$ of rational numbers with the property that,\nfor every rational number $\\epsilon > 0$, there exists a natural number\n$N$ such that, for all natural numbers $n,m > N$, the absolute value\n$|x_n - x_m|$ satisfies $|x_n - x_m| < \\epsilon$.\n\nThe set $\\mathbb{R}$ of [*real numbers*]{} is the set of equivalence\nclasses of Cauchy sequences of rational numbers, under the equivalence\nrelation $\\{x_i\\} \\sim \\{y_i\\}$ if the interleave sequence of the two\nsequences is itself a Cauchy sequence. The real numbers form a ring,\nwith addition and multiplication defined by\n\n-   $\\{x_i\\} + \\{y_i\\} = \\{(x_i+y_i)\\}$\n\n-   $\\{x_i\\} \\cdot \\{y_i\\} = \\{(x_i \\cdot y_i)\\}$\n\nThere is an ordering relation on $\\mathbb{R}$, defined by\n$\\{x_i\\} \\leq \\{y_i\\}$ if either $\\{x_i\\} \\sim \\{y_i\\}$ or there exists\na natural number $N$ such that $x_n < y_n$ for all $n > N$. This\ndefinition is well-defined and does not depend on the choice of Cauchy\nsequences used to represent the equivalence classes.\n\nOne can prove that the real numbers form an ordered field and that they\nsatisfy the *Dedekind completeness property* (also known as the *least\nupper bound property*): For every nonempty subset\n$S \\subset \\mathbb{R}$, if $S$ has an upper bound then $S$ has a lowest\nupper bound. It is also true that every ordered field with the least\nupper bound property is isomorphic to the real numbers.\n\nAlternative definitions of the set of real numbers include:\n\n1.  Equivalence classes of decimal sequences (sequences consisting of\n    natural numbers between 0 and 9, and a single decimal point), where\n    two decimal sequences are equivalent if they are identical, or if\n    one has an infinite tail of 9’s, the other has an infinite tail of\n    0’s, and the leading portion of the first sequence is one lower than\n    the leading portion of the second.\n\n2.  Dedekind cuts of rational numbers (that is, subsets $S$ of\n    $\\mathbb{Q}$ with the property that, if $a \\in S$ and $b < a$, then\n    $b \\in S$).\n\n3.  The real numbers can also be defined as the unique (up to\n    isomorphism) ordered field satisfying the least upper bound\n    property, after one has proved that such a field exists and is\n    unique up to isomorphism.\n\nCompleteness\n============\n\nThe main reason for introducing the reals is that the reals contain all\nlimits. More technically, the reals are complete (in the sense of metric\nspaces or uniform spaces, which is a different sense than the Dedekind\ncompleteness of the order in the previous section). This means the\nfollowing:\n\nA sequence $(x_n)$ of real numbers is called a Cauchy sequence if for\nany $\\varepsilon > 0$ there exists an integer $N$ (possibly depending on\n$\\varepsilon$) such that the distance $|x_n - x_m|$ is less than\n$\\varepsilon$ provided that $n$ and $m$ are both greater than $N$. In\nother words, a sequence is a Cauchy sequence if its elements $x_n$\neventually come and remain arbitrarily close to each other.\n\nA sequence $(x_n)$ converges to the limit $x$ if for any\n$\\varepsilon > 0$ there exists an integer $N$ (possibly depending on\n$\\varepsilon$) such that the distance $|x_n - x|$ is less than\n$\\varepsilon$ provided that $n$ is greater than $N$. In other words, a\nsequence has limit $x$ if its elements eventually come and remain\narbitrarily close to $x$.\n\nIt is easy to see that every convergent sequence is a Cauchy sequence.\nNow the important fact about the real numbers is that the converse is\ntrue:\n\n> Every Cauchy sequence of real numbers is convergent.\n\nThat is, the reals are complete.\n\nNote that the rationals are not complete. For example, the sequence $1$,\n$1.4$, $1.41$, $1.414$, $1.4142$, $1.41421$, $\\ldots$ is Cauchy but it\ndoes not converge to a rational number. (In the real numbers, in\ncontrast, it converges to the square root of $2$.)\n\nThe existence of limits of Cauchy sequences is what makes calculus work\nand is of great practical use. The standard numerical test to determine\nif a sequence has a limit is to test if it is a Cauchy sequence, as the\nlimit is typically not known in advance.\n\nFor example the standard series of the exponential function\n\n$$e^x = \\sum_{n=0}^\\infty \\frac{x^n}{n!}$$\n\nconverges to a real number because for every $x$ the sums\n\n$$\\sum_{n=N}^M \\frac{x^n}{n!}$$\n\ncan be made arbitrarily small by choosing $N$ sufficiently large. This\nproves that the sequence is Cauchy, so we know that the sequence\nconverges even if we don’t know ahead of time what the limit is.\n\n“The complete ordered field”\n============================\n\nThe real numbers are often described as “the complete ordered field,” a\nphrase that can be interpreted in several ways.\n\nFirst, an order can be lattice complete. It’s easy to see that no\nordered field can be lattice complete, because it can have no largest\nelement (given any element $z$, $z + 1$ is larger), so this is not the\nsense that is meant.\n\nAdditionally, an order can be Dedekind-complete, as defined in the\nDefinitions section. The uniqueness result at the end of that section\njustifies using the word “the” in the phrase “complete ordered field”\nwhen this is the sense of “complete” that is meant. This sense of\ncompleteness is most closely related to the construction of the reals\nfrom Dedekind cuts, since that construction starts from an ordered field\n(the rationals) and then forms the Dedekind-completion of it in a\nstandard way.\n\nThese two notions of completeness ignore the field structure. However,\nan ordered group (and a field is a group under the operations of\naddition and subtraction) defines a uniform structure, and uniform\nstructures have a notion of completeness (topology); the description in\nthe Completeness section above is a special case. (We refer to the\nnotion of completeness in uniform spaces rather than the related and\nbetter known notion for metric spaces, since the definition of metric\nspace relies on already having a characterisation of the real numbers.)\nIt is not true that $\\mathbb{R}$ is the only uniformly complete ordered\nfield, but it is the only uniformly complete Archimedean field, and\nindeed one often hears the phrase “complete Archimedean field” instead\nof “complete ordered field.” Since it can be proved that any uniformly\ncomplete Archimedean field must also be Dedekind complete (and vice\nversa, of course), this justifies using “the” in the phrase “the\ncomplete Archimedean field.” This sense of completeness is most closely\nrelated to the construction of the reals from Cauchy sequences (the\nconstruction carried out in full in this article), since it starts with\nan Archimedean field (the rationals) and forms the uniform completion of\nit in a standard way.\n\nBut the original use of the phrase “complete Archimedean field” was by\nDavid Hilbert, who meant still something else by it. He meant that the\nreal numbers form the largest Archimedean field in the sense that every\nother Archimedean field is a subfield of $\\mathbb{R}$. Thus $\\mathbb{R}$\nis “complete” in the sense that nothing further can be added to it\nwithout making it no longer an Archimedean field. This sense of\ncompleteness is most closely related to the construction of the reals\nfrom surreal numbers, since that construction starts with a proper class\nthat contains every ordered field (the surreals) and then selects from\nit the largest Archimedean subfield.\n\n*This article contains material from the which is incorporated herein\nunder the terms of the .*",
  "language": "INFORMAL",
  "phrase": "Real Number",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/RealNumber"
    }
  ],
  "indexable": true
}