{
  "alternatePhrases": [
    "numbers",
    "pi"
  ],
  "definition": "So, basically. I am now introducing a new number system called\nkenosymplirostic numbers. It is a type of number that you get when\ndividing by 0. So, what does kenosymplirostic mean? The name comes from\ntwo Greek words, “*keno*” meaning “gap” and “*sympliroste*” meaning\n“fill”. These numbers fill the gap that was left open, the gap people\nthought will never be closed.\n\nHere is how it works: $$\\frac{1}{0}= 1\\mathit{k}$$ The value of the\nnumerator is the coefficient of “kenosym unit” k.\n\n**So, what about 0/0?**\n\nThe thing is, it will be 0. Why? Because 0\\*k(the kenosym unit) is still\n0 by definition.\n\nAnd now, we talk about its place in the complex plane, or with the\naddition of kenosyymplirostic numbers, the complex space. It will go\nthrough the complex plane where it will meet in 0, the origin of real,\nimaginary and kenosymplirostic numbers.\n\nADDITION AND SUBTRACTION\n\nSo, let’s say we have:\n\n$$1\\mathit{k}+3\\mathit{k}$$ It will be equal to:\n$$\\frac{1}{0}+\\frac{3}{0}$$ Which will be $$\\frac{4}{0} or 4\\mathit{k}$$\nThis means that subtraction is just the same, as we treat 0 as a normal\nnumber.\n\nMULTIPLICATION\n\nSo, let’s say we have:\n\n$$3k \\cdot 5k$$ That would mean 3/0 \\* 5/0 which will be 15/0 or 15k. (K\nIS NOT TREATED AS A VARIABLE) Kenosymplirostic numbers cannot be divided\nsince it will always equal to 0 per the properties of dividing\nfractions.\n\nEXPONENT\n\nThe kenosym unit k acts like the real number 1, where k to the power of\nany number n is k. kenosym numbers with coefficients will just raise the\ncoefficient to that power and just copy the kenosym unit k.\n\nRULES OF COEFFICIENTS\n\nOnly integers coefficients are allowed since there cant be a fourth\ndimension in the complex space and to avoiid many numbers having the\nsame kenosym.\n\nAxioms: Addition: **Shoutouts: Herve Arki from the Mathematics G+\ncommunity for bringing up an issue. :)**\n\nAs of now, there are some paradoxes that might arise, but I will resolve\nall once I gain more knowledge. Also, if someone would help suggest to\nme a better kenosym unit, You can comment below this article.",
  "language": "INFORMAL",
  "phrase": "Kenosymplirostic Numbers",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/KenosymplirosticNumbers"
    }
  ],
  "indexable": true
}