{
  "alternatePhrases": [],
  "definition": "A function $f:S\\subseteq \\mathbb{R}\\to \\mathbb{R}$ is said to be\n*nowhere differentiable* if it is not differentiable at any point in the\ndomain $S$ of $f$.\n\nIt is easy to produce examples of nowhere differentiable functions.\nIndeed, any functions discontinuous at every point in $S$ is nowhere\ndifferentiable, as seen in the example $f(x)=x+1$ if\n$x\\in S\\cap \\mathbb{Q}$ and $f(x)=x-1$ otherwise. Less trivial examples\nare those that are everywhere continuous, but nowhere differentiable\n(hence not an analytic function). These functions are simply termed\n*continuous nowhere differentiable functions*.\n\nThe prototypical example of a continuous nowhere differentiable function\nis the Weierstrass function. The formula for the Weierstrass function is\n\n$$f(x) = \\sum_{n=1}^\\infty b^n \\cos(a^n \\pi x)$$\n\nwith $a$ odd, $0 < b < 1$, and $ab > 1 + \\frac{3}{2}\\pi$.\n\nIn the following series of figures, sequential renderings of the\nWeierstrass function are shown, each time zoomed in on the origin by a\nfactor of ten. This shows the fractal nature of the function and\nillustrates how it is continuous, yet doesn’t get any “smoother” as one\nlooks closer (a prerequisite for differentiability).\n\n![image](weier1) \n\n![image](weier2) \n\n![image](weier3) **Figure.** Weierstrass function for $a=9$, $b=0.7$,\nwith successive 10x zooms on the origin.\n\n### Notes {#notes .unnumbered}\n\nDuring eighteenth and early nineteenth centuries it was widely believed\nthat every continuous function has a well defined tangent - at least at\n“” points. As the Weierstrass function shows that this is clearly not\nthe case. The function is named after Karl Weierstrass who presented it\nin a lecture for the Berlin Academy in 1872 [@stewart].\n\nAlternative examples of continuous and nowhere differentiable functions\nare given by the sample paths of standard Brownian motion, also known as\nthe Wiener process or white noise. It was to handle such ill behaved\nprocesses, which have important applications to both pure and applied\nmathematics, that the techniques of stochastic calculus were developed.\n\n**Remark**. It can actually be shown that the Weierstrass function is in\nfact a fractal (that is, its graph in $\\mathbb{R}^2$ has topological\ndimension $1$ but Hausdorff dimension $>1$). Indeed, many other examples\nof continuous nowhere differentiable functions can be found in functions\nwhose graphs are fractals. An example of a continuous nowhere\ndifferentiable function whose graph is not a fractal is the van der\nWaerden function.\n\nNowhere differentiability can be generalized. For example, a function\n$f:S\\subseteq \\mathbb{R}\\to \\mathbb{R}^n$ is called nowhere\ndifferentiable if at each $x\\in S$, $f=(f_1,\\ldots,f_n)$ is not\ndifferentiable. This means that at least one of the coordinate functions\n$f_i$ is not differentiable at $x$, for every $x\\in S$. Given any\nfunction $f:S\\subseteq \\mathbb{R}\\to \\mathbb{R}^n$, for any point\n$x\\in S$, we say that $x$ is of type $(i_1,\\ldots,i_n)$ where $i_j=1$ or\n$0$ according to whether $f_j$ is differentiable or not. If $f$ is\nnowhere differentiable, then no points of $S$ can be of type\n$(1,\\ldots,1)$. Question:\n\n> *is there a continuous nowhere differentiable function\n> $f:S\\subseteq \\mathbb{R}\\to \\mathbb{R}^2$ such that for every pair of\n> type-$(0,1)$ points $x_1<x_2$, there is a type-$(1,0)$ point $y$ such\n> that $x_1<y<x_2$, and every pair of type-$(1,0)$ points $y_1<y_2$,\n> there is a type-$(0,1)$ point $x$ such that $y_1<x<y_2$?*\n\n**Remark**. The above generalized definition leads to the definition of\na *nowhere differentiable curve*: it is a curve such that it admits a\nnowhere differentiable parametrization. With this definition, we see\nthat the graph of the Weierstrass function, as a curve, is nowhere\ndifferentiable. Other fractals, such as the Koch curve, is also nowhere\ndifferentiable.\n\n[9]{} I. Stewart, *The Problems of Mathematics*, Oxford University\nPress, 1987. M. Yamaguti, M. Hata, J. Kigami, *Mathematics of Fractals*,\nAMS, 1997",
  "language": "INFORMAL",
  "phrase": "Nowhere Differentiable",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/NowhereDifferentiable"
    }
  ],
  "indexable": true
}