{
  "alternatePhrases": [],
  "definition": "PREFACE\n\nThe significance of the Calculus, the possibility of applying it in\nother fields, its usefulness, ought to be kept constantly and vividly\nbefore the student during his study of the subject, rather than be\ndeferred to an uncertain future.\n\nNot only for students who intend to become engineers, but also for those\nplanning a profound study of other sciences, the usefulness of the\nCalculus is universally recognized by teachers; it should be consciously\nrealized by the student himself. It is obvious that students interested\nprimarily in mathematics, particularly if they expect to instruct\nothers, should recognize the same fact.\n\nTo all these, and even to the student who expects only general culture,\nthe use of certain types of applications tends to make the subject more\nreal and tangible, and offers a basis for an interest that is not\nartificial. Such an interest is necessary to secure proper attention and\nto insure any real grasp of the essential ideas.\n\nFor this reason, the attempt is made in this book to present as many and\nas varied applications of the Calculus as it is possible to do without\nventuring into technical fields whose subject matter is itself unknown\nand incomprehensible to the student, and without abandoning an orderly\npresentation of fundamental principles.\n\nThe same general tendency has led to the treatment of topics with a view\ntoward bringing out their essential usefulness. Thus the treatment of\nthe logarithmic derivative is vitalized by its presentation as the\nrelative rate of change of a quantity; and it is fundamentally connected\nwith the important “ compound interest law,” which arises in any\nphenomenon in the relative rate of increase (logarithmic derivative) is\nconstant.\n\nAnother instance of the same tendency is the attempt, in the\nintroduction of the precise concept of curvature, to explain the reason\nfor the adoption of this, as opposed to other simpler but cruder\nmeasures of bending. These are only instances, of two typical kinds, of\nthe way in which the effort to bring out the usefulness of the subject\nhas influenced the presentation of even the traditional topics.\n\nRigorous forms of demonstration are not insisted upon, especially where\nthe precisely rigorous proofs would be beyond the present grasp of the\nstudent. Rather the stress is laid upon the student’s certain\ncomprehension of that which is done, and his conviction that the results\nobtained are both reasonable and useful. At the same time, all effort\nhas been made to avoid those grosser errors and actual misstatements of\nfact which have often offended the teacher in texts otherwise attractive\nand teachable.\n\nThus a proof for the formula for differentiating a logarithm is given\nwhich lays stress on the very meaning of logarithms; while it is not\nabsolutely rigorous, it is at least just as rigorous as the more\ntraditional proof which makes use of the limit of $(1+1/n)^{n}$ as $n$\nbecomes infinite, and it is far more convincing and instructive. The\nproof used for the derivative of the sine of an angle is quite as sound\nas the more traditional proof (which is also indicated), and makes use\nof fundamentally useful concrete concepts connected with circular\nmotion. These two proofs again illustrate the tendency to make the\nsubject vivid, tangible, and convincing to the student; this tendency\nwill be found to dominate, in so far as it was found possible, every\nphase of every topic.\n\nMany traditional theorems are omitted or reduced in importance. In many\ncases, such theorems are reproduced in exercises, with a sufficient hint\nto enable the student to master them. Thus Taylor’s Theorem in several\nvariables, for which wide applications are not apparent until further\nstudy of mathematics and science, is presented in this manner.\n\nOn the other hand, many theorems of importance, both from mathematical\nand scientific grounds, which have been omitted traditionally, are\nincluded. Examples of this sort are the brief treatment of simple\nharmonic motion, the wide application of Cavalieri’s theorem and the\nprismoid formula, other approximation formulas, the theory of least\nsquares (under the head of exercises in maxima and minima), and many\nother topics.\n\nThe Exercises throughout are colored by the views expressed above, to\nbring out the usefulness of the subject and to give tangible concrete\nmeaning to the concepts involved. Yet formal exercises are not at all\navoided, nor is this necessary if the student’s interest has been\nsecured through conviction of the usefulness of the topics considered.\nFar more exercises are stated than should be attempted by any one\nstudent. This will lend variety, and will make possible the assignment\nof different problems to different students and to classes in successive\nyears. It is urged that care be taken in selecting from the exercises,\nsince the lists are graded so that certain groups of exercises prepare\nthe student for other groups which follow; but it is unnecessary that\nall of any group be assigned, and it is urged that in general less than\nhalf be used for any one student. Exercises that involve practical\napplications and others that involve bits of theory to be worked out by\nthe student are of frequent occurrence. These should not be avoided, for\nthey are in tune with the spirit of the whole book; great care has been\ntaken to select these exercises to avoid technical concepts strange to\nthe student or proofs that are too difficult.\n\nAn effort is made to remove many technical difficulties by the\nintelligent use of tables. Tables of Integrals and many other useful\ntables are appended; it is hoped that these will be found usable and\nhelpful.\n\nParts of the book may be omitted without destroying the essential unity\nof the whole. Thus the rather complete treatment of Differential\nEquations (of the more elementary types) can be omitted. Even the\nchapter on Functions of Several Variables can be omitted, at least\nexcept for a few paragraphs, without vital harm; and the same may be\nsaid of the chapter on Approximations. The omission of entire chapters,\nof course, would only be contemplated where the pressure of time is\nunusual; but many paragraphs may be omitted at the discretion of the\nteacher.\n\nAlthough care has been exercised to secure a consistent order of topics,\nsome teachers may desire to alter it; for example, an earlier\nintroduction of transcendental functions and of portions of the chapter\non Approximations may be desired, and is entirely feasible. But it is\nurged that the comparatively early introduction of Integration as a\nsummation process be retained, since this further impresses the\nusefulness of the subject, and accustoms the student to the ideas of\nderivative and integral before his attention is diverted by a variety of\nformal rules.\n\nPurely destructive criticism and abandonment of coherent arrangement are\njust as dangerous as ultra-conservatism. This book attempts to preserve\nthe essential features of the Calculus, to give the student a thorough\ntraining in mathematical reasoning, to create in him a sure mathematical\nimagination, and to meet fairly the reasonable demand for enlivening and\nenriching the subject through applications at the expense of purely\nformal work that contains no essential principle.\n\nE. W. DAVIS,\n\nW. C. BRENKE,\n\nE. R. HEDRICK, Editor.\n\nJune, 1912.",
  "language": "INFORMAL",
  "phrase": "Preface",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Preface1"
    }
  ],
  "indexable": true
}