{
  "alternatePhrases": [
    "arithmetics"
  ],
  "definition": "[*Arithmetic*]{} is “ the science of numbers and operations on sets of\nnumbers. Arithmetic is understood to include problems on the origin and\ndevelopment of the concept of a number, methods and means of\ncalculation, the study of operations on numbers of different kinds, as\nwell as analysis of the axiomatic structure of number sets and the\nproperties of numbers.” The four basic operations are addition,\nsubtraction, multiplication and division; in the absence of parentheses\nthese are performed according to the rules of operator precedence. From\nmultiplication follows exponentiation.\n\nMost civilizations usually develop arithmetic before any other branches\nof mathematics, and in modern times children are usually taught\narithmetic first (though in some curricula they might be taught set\ntheory first).\n\nNumeral systems of ancient civilizations often took letter symbols for\nnumbers. Boyer called these letter symbols one-to-one ciphered numerals.\nThe ancient Greeks, for example, used letters in Ionian and Dorian\nalphabets to represent numbers, as did the Romans in one alphabet. These\nsystems were additive in one sense (that is, the value of the overall\n“word” was merely the sum of the values of the individual symbols). To\nconvert rational numbers into a ciphered numeration system, Fibonacci\nimplemented seven rules, one being a LCM multiple. For example, four of\nFibonacci’s rules were used by earlier cultures. One was an Egyptian\nscribe. In 1650 BCE Ahmes converted $\\frac{n}{p}$ by using large\nmultiples. About 200 years earlier, a student converted $\\frac{n}{pq}$\nby using small LCM multiples.\n\nIt was not just the invention of zero as a symbol for that integers\nbetween 1 and -1 allowed Hindu-Arabic numerals to significant expand\nman’s ability to perform arithmetic operations. Significantly larger\nnumbers came into use after zero became a placeholder in the new\nadditive-exponential system. An algorithm written in Hindu-Arabic\nnumbers before 1600 AD was also added. Modern decimals apply few lessons\nlearned during the 3,200 year life of Egyptian fractions. One exception\nis aliquot parts, used in the fundamental theorem of arithmetic, and\nhigher arithmetic.\n\nThe next great expansion of arithmetic power occurred with the invention\nof calculators and computers in the 20th Century, with both kinds of\ndevices performing arithmetic in a binary algorithm. The algorithm,\nstated in a cursive form, had been used prior to 2,000 BCE.\n\nAs number theory generalizes the principles of arithmetic to all numbers\nor all numbers of a given kind, it is sometimes called the “higher\narithmetic.”\n\nExternal links\n--------------\n\n-   -   -",
  "language": "INFORMAL",
  "phrase": "Arithmetic",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Arithmetic"
    }
  ],
  "indexable": true
}