{
  "alternatePhrases": [],
  "definition": "A [*calculator*]{} is an electronic, electrical or mechanical device\n(hardware) or a computer program (software) designed to perform a\npredefined set of arithmetic computations on numbers entered by the user\nand display the results.\n\nThe abacus is sometimes given as an example of an early calculator;\nhowever, the completion of a calculation requires the active\nparticipation of the user and is easily subject to user error even when\nthe device passes a diagnostic with flying colors, whereas a modern\ncalculator in working order calculates and displays the correct result\nregardless of whether or not the user sticks around to see it (this is\nsubject to certain caveats regarding precision, however). Of course it\nhas always been the case in the history of calculators that users may\nenter incorrect inputs or misunderstand the operation of the device and\nthus get irrelevant results.\n\nOne of the first mechanical calculators was designed by Blaise Pascal in\nthe 17th Century. It used a gear for each digit and the gears were\nconnected, it took up a little space on a desk. It was limited to\naddition and subtraction. By the 1990s, electronic calculators were\nubiquitous and small enough to put in a pocket.\n\nA basic calculator has about twenty keys: the digits 0 to 9, a decimal\npoint, sign change, addition, subtraction, multiplication, division,\nequal or Enter key and a C key to clear error exceptions. Occasionally\nsuch calculators also have keys for percentage and square root. Another\noption sometimes found on basic calculators is a memory register and\nassociated keys M+, MR and MC (for adding to memory register, recalling\nmemory and clearing memory, respectively).\n\nMore advanced calculators include scientific calculators, graphing\ncalculators, programmable calculators. Most calculators use standard\ninfix notation, but there are reverse Polish notation calculators also\navailable on the market.",
  "language": "INFORMAL",
  "phrase": "Calculator",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Calculator"
    }
  ],
  "indexable": true
}