{
  "alternatePhrases": [
    "mathematical description",
    "meta-construct"
  ],
  "definition": "The [*definition*]{} of a mathematical term is a meta-mathematical\nconstruct or statement that specifies as precisely as possible the\nmeaning of that term. For example, a definition of “sphenic number” is\n“a composite integer with three distinct prime factors.” A mathematical\nconcept is well-defined if its content can be formulated independently\nof the form or the alternative representative which is used for defining\nit. Furthermore, one should distinguish between mathematical definitions\nand mathematical descriptions of a real system; mathematical definitions\nexpress completely and meaningfully a mathematical concept in terms of\nother, related mathematical concepts that have been already defined, and\nalso primary or primitive concepts that can no longer be defined in\nterms of other mathematical concepts and logical operands. For example,\nthe primitive concept of ‘collection of elements or members’ or\nensemble, has no explicit definition even though it is employed to\nmathematically define the concept of set. A definition of a fundamental\nconcept, such as set, category, topos, topology, homology etc., also\ncontains several axioms, or basic assumptions/conditions imposed on the\nauxilliary concepts employed by such a fundamental concept definition.\nFor example, the category of sheaves on a site is called a\n(Grothendieck) topos; however, a topos can also be defined directly by\nspecifying only a few (Grothendieck topos) axioms.\n\nTherefore, ultimately, a mathematical definition depends on the choice\nof the mathematical foundation selected, e.g., set-theoretical,\ncategory-theoretical, or topos-theoretical, as well as the type of logic\nadopted, e.g., Boolean, intuitionistic or many-valued logic. Thus, the\ngeneral definition of a mathematical definition is not simply a\nmathematical concept, but it is instead a [*meta-mathematical\nconstruct*]{}, or the $<construct>$ of a construct. In the case of\ntopos-theoretical foundations the Brouwer-intuitionistic logic is\nexplicitly assumed in the construction/definition of the topos. As an\nexample, the category of sets–subject to certain axioms, including the\naxiom of choice– may be considered a canonical example of a Boolean\ntopos, but it is not the only one possible, as different axioms may be\nselected to avoid several known antimonies in set theory.\n\nThus, a mathematical concept is well-defined only when its mathematical\nfoundation framework is also specified either explicitly or by its\ncontext. For reasons related to apparent ‘simplicity’, many a\nmathematician prefers only Boolean logic and a set-theoretical\nfoundation for definitions, in spite of severe limitations, known\ninherent paradoxes and incompleteness.\n\nAlternative definitions of the same concept often offer additional\ninsights into the meaning(s) of the concept being defined, as well as\nadded flexibility in solving problems and discovering proofs.\n\nA definition of a constant is an equation with a symbol (or some other\nnotation) on the left and either an exact value or a formula for a value\non the right. For example, the definition of the golden ratio is\n$$\\phi = \\frac{1 + \\sqrt{5}}{2}.$$\n\nA definition of a function is an equation, usually with function\nnotation on the left (a symbol, with an argument or a list of arguments\nin parentheses) and on the right a formula using the arguments to\ncalculate the value of the function for those arguments. Optionally, the\nequation could be accompanied by statements of what acceptable arguments\nare. For example, Euler’s totient function is defined as\n$$\\phi (n) = n \\prod_{p|n} \\left( 1- \\frac{1}{p} \\right)$$ for\n$n \\in \\mathbb{Z}$. To give one more example: the factorial function is\ndefined as $$n! = \\prod_{i = 1}^n i$$ for $0 < n \\in \\mathbb{Z}$.\nEuler’s gamma function $\\Gamma(x)$ is sometimes said to extend the\ndefinition of factorials to any $x \\in \\mathbb{C}$.",
  "language": "INFORMAL",
  "phrase": "Definition",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Definition"
    }
  ],
  "indexable": true
}