{
  "alternatePhrases": [],
  "definition": "There is no technical distinction a lemma, a proposition, and a theorem.\nA *lemma* is a proven statement, typically named a lemma to distinguish\nit as a truth used as a stepping stone to a larger result rather than an\nimportant statement in and of itself. Of course, some of the most\npowerful statements in mathematics are known as lemmas, including Zorn’s\nLemma, Bezout’s Lemma, Gauss’ Lemma, Fatou’s lemma, etc., so one clearly\ncan’t get too much simply by reading into a proposition’s name.\n\nEven less well-defined is the distinction between a proposition and a\ntheorem. Many authors choose to name results only one or the other, or\nuse both more or less interchangeably. A partially standard set of\nnomenclature is to use the *proposition* to denote a significant result\nthat is still shy of deserving a proper name. In contrast, a *theorem*\nunder this format would a major result, and would often be named in to\nmathematicians who worked on or solved the problem in question.\n\nThe Greek word “lemma” itself means “anything which is received, such as\na gift, profit, or a bribe.” According to [@Higham], the plural ’Lemmas’\nis commonly used. The correct Greek plural of lemma, however, is\nlemmata. The Greek “Theoria” means “view, or vision\" and is clearly\nlinguistically related to the word “theatre.” The apparent relation is\nthat a theorem is a mathematical fact which you see to be true (and can\nnow show others!).\n\nA somewhat more distinct concept (though still subject to author\ndiscretion) is that of a *corollary*, which is a result that can be\nconsidered an immediate consequence of a previous theorem (typically,\nthe preceding theorem in the text).\n\nFinally, it is worth observing that the above terms are occasionally\nused to refer to a statement of the prescribed form without reference to\nthe actual truth of the result, e.g., as in the phrase “While the\ntheorem itself is valid, the is actually false.\" See this for more on\nthis last example.\n\n[9]{} N. Higham, Handbook of writing for the mathematical sciences,\nSociety for Industrial and Applied Mathematics, 1998. (pp. 16)",
  "language": "INFORMAL",
  "phrase": "Lemma",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Lemma"
    }
  ],
  "indexable": true
}