{
  "alternatePhrases": [],
  "definition": "The [*metric system*]{} is a system of weights and measures first\nproposed in France and gradually coming closer to worldwide acceptance\nin which for each given dimension, each larger unit is ten times the\nsmaller unit (or viceversa, each smaller unit is a tenth of the larger\nunit). This makes it easier and more convenient to convert larger units\nto smaller units and viceversa. In ancient systems prior to the metric\nsystem, units for a given dimension often related to one another by\ndifferent scaling factors. For example, in Biblical times, a talent was\n60 mina, a mina was 60 shekels and a shekel was 24 giru. To convert 17\ntalents to shekels was thus different from converting shekels to giru or\ntalents to giru, etc. By contrast, to convert 17.29 kilograms to\ncentigrams is a simple matter of moving the decimal point to the right\n(and adding significant zeroes as necessary), and the difference in\nconverting kilograms to milligrams or hectograms entails only changes in\nwhere to move the decimal point and how far. Furthermore, the basic\nunits are determined by measurements which are known to remain constant\nand double-checkable throughout the planet, and not ephemeral and\nhard-to-verify measurements (such as the shoe size of the current king).\nThe system is further standardized by the use of consistent prefixes to\nadd to the basic units to make them larger or smaller.\n\nThe basic units are:\n\n  ------------- --------\n                Meter\n  Mass          Gram\n  Time          Second\n  Temperature   Kelvin\n  ------------- --------\n\nThe standard prefixes are:\n\n  -------- -----------\n  Kilo       1000.0000\n  Hecto       100.0000\n  Deca         10.0000\n  (none)        1.0000\n  Deci          0.1000\n  Centi         0.0100\n  Milli         0.0010\n  Micro         0.0001\n  -------- -----------\n\nMeasurement systems consistently based on 10 (rather than arbitrarily\nvarying practical numbers like 12, 24 and 60) had been proposed since at\nleast the 15th Century. It wasn’t until after the French Revolution that\nthe proposals were taken seriously. Nowadays, the metric system has been\nadopted by scientists all over the world, but the general population of\nthe United States remains an important group of hold-outs.",
  "language": "INFORMAL",
  "phrase": "Metric System",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/MetricSystem"
    }
  ],
  "indexable": true
}