{
  "alternatePhrases": [],
  "definition": "[*Multiplication*]{} is a mathematical operation in which two or more\nnumbers are added up to themselves by a factor of other numbers. For\nexample, $2 \\times 3 = 2 + 2 + 2 = 3 + 3 = 6$. The numbers may be real,\nimaginary or complex, they may be integers or fractions. Among real\nnumbers, if an odd number of multiplicands are negative, the overall\nresult is negative; if an even number of multiplicands are negative, the\noverall result is positive. Two examples: $(-3) \\times (-5) = 15$;\n$(-2) \\times (-3) \\times (-5) = (-30)$.\n\nThe usual operator is the cross with its four arms of equal length\npointing northeast, northwest, southeast and southwest: $\\times$. Other\noptions are the central dot $\\cdot$ and the tacit multiplication\noperator. In many computer programming languages the asterisk is often\nused as it is almost always available on the keyboard (Shift-8 in most\nAmerican layouts, as well as dedicated key if the keyboard has a numeric\nkeypad), and this is the operator likely to be used in a computer\nimplementation of a reverse Polish notation calculator. In Mathematica,\nthe space can sometimes function as a multiplication operator, but more\nexperienced users warn novices not to rely on this feature.\n\nJust as with addition, multiplication is commutative: $xyz = xzy = yxz$,\netc.\n\nThe iterative operator is the Greek capital letter pi:\n$$\\prod_{i = 1}^n a_i,$$ which is a compact way of writing\n$a_1 \\times a_2 \\times \\ldots \\times a_n$.\n\nMultiplication of complex numbers is helped by the following identity:\n$(a + bi) \\times (x + yi)=(ax - by) + (ay + bx)i$. To give three\nexamples: $(17 + 29i)(11 + 38i) = -915 + 965i$ (the result has both real\nand imaginary parts), $(1 + 2i)(1 - 2i) = 5$ (the result is a real\nprime) and $(4 + 7i)(7 + 4i) = 65i$ (the result has only an imaginary\npart).",
  "language": "INFORMAL",
  "phrase": "Multiplication",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Multiplication"
    }
  ],
  "indexable": true
}