{
  "alternatePhrases": [],
  "definition": "A common problem in mathematics is to prove the existence and uniqueness\nof a solution, element, object in a category, etc. The typical approach\nfor such a proof is to establish the existence of the solution, then\ndetermine the uniqueness. In instances like this, uniqueness is often\nproved by assuming there are two solutions and concluding they are\nindeed equal.\n\n**Needle-in-a-haystack Heuristic**\n\nAn alternative and often more constructive approach is to prove\nuniqueness first, then prove existence – we call this the\n*needle-in-the-haystack* heuristic because it is much easier to find a\nneedle in a haystack when you first prove you know where it will be if\nit is there at all.[^1]\n\nWe give a basic example from elementary mathematics.\n\nTwo distinct non-parallel lines in a the $xy$-plane intersect at exactly\none point.\n\nWe pause to observe this is an existence and uniqueness question: a\npoint of intersection must exist, and it must be unique. Because we care\nonly about illustrating the heuristic we assume our meaning of lines\nexcludes vertical lines, so each line is given by a function of the form\n$y=mx+b$.\n\nLet $y_1=m_1 x+b_1$ and $y_2=m_2 x+b_2$ be distinct lines which are\nnon-parallel; hence, $m_1\\neq m_2$. If $y_1=y_2$ for some $x$ then\n$m_1 x+b_1=m_2 x+b_2$ so $(m_1-m_2)x=b_2-b_1$. This leads to\n$\\displaystyle x=\\frac{b_2-b_1}{m_1-m_2}$. Thus we have uniquely\ncharacterized any intersection point as the point\n$\\displaystyle (x,y_1(x))$, with\n$\\displaystyle x=\\frac{b_2-b_1}{m_1-m_2}$, if an intersection exists.\n\nTo see that an intersection exists we appeal to the unique\ncharacterization.\n$$y_1\\left(\\frac{b_2-b_1}{m_1-m_2}\\right)=m_1\\frac{b_2-b_1}{m_1-m_2}+b_1\n =\\frac{m_1 b_2-m_2 b_1}{m_1-m_2}\n=m_2\\frac{b_2-b_1}{m_1-m_2}+b_2\n=y_2\\left(\\frac{b_2-b_1}{m_1-m_2}\\right)\n.$$\n\nAfter establishing a unique characterization of a solution it is often\nso convincing as to leave no need for the verification of the solution,\nso the existence stage of the proof may be omitted. \\[Indeed, a standard\npre-calculus course would not hesitate to stop the proof at end of the\nuniqueness stage.\\]\n\nIf we chose to write the theorem in the traditional manner and introduce\nthe existence first, then we would have begun with a rather\nunpredictable beginning:\n\n> Let $\\displaystyle x=\\frac{b_2-b_1}{m_1-m_2}$.\n\nSuch an approach is no less logical but can leave a reader confused as\nto the reason these choices are being made.\n\nFurthermore, to prove the uniqueness of a solution by means of assuming\nthere are two solutions can be a misleading approach for some problems.\nFor example, the intersection of $f(x)=x^2-8x$ with $g(x)=-3x-4$ is\nunique, but given two solutions $(x_1,y_1)$, $(x_2,y_2)$, it becomes\nrather difficult to conclude $(x_1,y_1)=(x_2,y_2)$ directly. With the\nneedle-in-the-haystack heuristic one begins the proof by showing the\nonly solution is $(4,-16)$, if there is a solution. Thus we never\ncompare two systems of equations in several variables.\n\n**When to use the heuristic**\n\nWhen an existence and uniqueness is claimed where there are accompanying\nequations or structures that must be satisfied by the solution, it is\noften possible to apply the heuristic. Often such problems can be worded\nas two sets intersecting at a single point. If the possible point of\nintersection is characterized before we know the intersection is\nnon-empty, then we have an immediate candidate with which we may prove\nthe intersection is non-empty.\n\n**When not to use the heuristic**\n\nThere are, however, many examples where the traditional approach of\nestablishing existence first is preferable. For instance, in a proof\nthat every integer has a unique factorization, establishing some\nfactorization exists is nearly trivial: choose a prime $p$ which divides\n$n$, then by induction choose a prime factorization $q_1\\cdots q_s$ of\n$n/p$, and then $n=p q_1\\cdots q_s$ is a prime factorization of $n$.\nHowever, establishing the uniqueness of a prime factorization is a far\nmore delicate matter.\n\nThe heuristic applies best when the definition of the solution, element,\nor object in question is not immediately presentable from the\ndefinition. When a definition provides a blue-print for establishing\nexistence then the traditional method may be preferable.\n\n[^1]: This terminology is due to F. R. Beyl",
  "language": "INFORMAL",
  "phrase": "Needle-In-The-Haystack",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Needleinthehaystack"
    }
  ],
  "indexable": true
}