{
  "alternatePhrases": [],
  "definition": "A [*negative number*]{} is a number that is less than zero. It is the\n“opposite” of a positive number. It can be the result of a subtraction\nin which the subtrahend is greater than the minuend. In everyday life,\nnegative numbers are most often used to indicate debts.\n\nFor example, Bob’s checking account has \\$47.20 and Alice cashes the\ncheck he gave her for \\$80.00, and the bank gives the requested amount.\nBob’s account is then down to $-32.80$, and could be further indebted if\nthe bank collects some sort of fee for giving more money than was\navailable.\n\nIn a number line, negative numbers are usually to the left of zero:\n\n(-1,-0.3)(5,0.3) (-1,0)(5,0) (0,0)(1,0)(2,0)(3,0)(4,0) (0,-0.3)[-2]{}\n(1,-0.3)[-1]{} (2,-0.3)[0]{} (3,-0.3)[+1]{} (4,-0.3)[+2]{} (-1,0)[.]{}\n(5,0)[.]{}\n\nIn a 2-dimensional coordinate plane, negative numbers on the vertical\naxis are usually below zero. (In the complex plane, technically, they\nmay be above if desired).\n\nWhereas giving a plus sign for positive numbers is optional, giving the\nminus sign for negative numbers is a must.\n\nAddition and subtraction of negative numbers is fairly straightforward\nand intuitive. Suppose Bob also gave Carol and Dick a check for \\$80.00\neach and they both cash their checks after Alice cashed hers. This is\n$-32.80 - 80.00 - 80.00 = -192.80$. Multiplication of a negative number\nby a positive number is also straightforward. Suppose Bob’s bank charges\na fee of \\$25.00 for each instance of overdraft. This translates to\n$-25.00 \\times 3 = -75.00$.\n\nHowever, multiplication of a negative number by another negative number\ngives a positive number. In all honesty, I can’t think of a situation in\neveryday life in which it would be necessary to multiply two negative\nnumbers. At any rate, the rule of sign changes has the consequence that\n$(-x)^a > 0$ if $a$ is even and $(-x)^a < 0$ if $a$ is odd. This comes\nin very handy in number theory for creating alternating sums or checking\nthe relative density of one kind of number to another. For example, for\nsquarefree $n$, the Möbius function $\\mu(n) = (-1)^{\\omega(n)}$ (where\n$\\omega(n)$ is the number of distinct prime factors function).\n\nAs a consequence of these sign changes, a positive real number $x^2$\ntechnically has two square roots, $x$ and $-x$. The specific case of\n$x^2 = 25$ was used in [*The Simpsons*]{} episode “Girls Just Want to\nHave Sums,” (first aired April 30, 2006) in which Lisa Simpson dressed\nup as a boy to sneak into a math class. Asked for the solution, Lisa\nanswers 5, but the teacher says this is wrong. Martin then gives the two\ncorrect answers, 5 and $-5$. Even computer algebra systems, and\ncertainly most scientific calculators, will only give the positive\nanswer.\n\nWhat numbers are the square roots of a negative real number? No such\nnumbers exist. More precisely, they are imaginary numbers, multiples of\nthe imaginary unit. For example, $\\sqrt{-25} = 5i$ or $-5i$.\n\nA question that comes up much less often is: What is a negative number\nraised to a fractional power? As you may know, raising a positive number\nto the reciprocal of $n$ has the same effect as taking the $n$th root of\n$n$. We can plot the integer powers of, say, 2, with dots and then\nconnect the dots with straight lines; the result, though not technically\ncorrect, would not be too far off the mark (which would be a smooth\ncurve connecting the dots). From such a graphic we might draw the\nincorrect conclusion that $2^{1.5} = 3$, while the correct answer (the\nbase 2 logarithm of 3) is more like 1.5849625007211561815.\n\nWhether we connect the dots in a plot of $(-2)^n$ with either straight\nlines or curves, we might be fooling ourselves. The incorrect conclusion\nof $(-2)^{1.5} = 0$ just doesn’t make sense.\n\n![image](NegTwoIntegerPowers)\n\nOn most scientific calculators, trying to raise a negative number to a\nfractional power will result in an error exception (unless of course you\nenter it in such a way that the calculator interprets as merely a\npositive number raised to a fractional power and then multiplied by\n$-1$).\n\nOnce again, imaginary numbers come to the rescue. Since the square root\nof a negative number is an imaginary number, it only makes sense to\nextend this to negative numbers raised to fractional powers. For\nexample, $(-2)^{\\frac{3}{2}} = -2i\\sqrt{2}$ (and of course the complex\nconjugate of that).\n\nIn Mathematica, I made the following plot of $(-2)^n$ in steps of\n$\\frac{1}{10}$ and then separated the resulting complex numbers into\ntheir real and imaginary parts.\n\n![image](NegTwoFractPowers2D)\n\nNot entirely convinced this is right, I tried a 3-dimensional plot (in\nthe plot, $x$ runs from 1 to 2, $y$ runs from 1 to 40 and $z$ runs from\n$-20$ to 20):\n\n![image](NegTwoFractPowers)\n\nAs a final sanity check, I compared this to a similar plot of $2^n$\n(with the axes oriented in the same way as in the previous plot):\n\n![image](PosTwoWImPlot)\n\nIn the end, though the 3-dimensional plots may look “cooler,” the\n2-dimensional plot is actually more enlightening, showing the powers of\na negative number fall on a logarithmic spiral.\n\n[2]{} Screen name “Cromulent Kwyjibo”. Personal communication, June 8,\n2007. Alberto A. Martínez, [*Negative Math: How Mathematical Rules Can\nBe Positively Bent*]{}. Princeton and Oxford: Princeton University Press\n(2006)",
  "language": "INFORMAL",
  "phrase": "Negative Number",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/NegativeNumber"
    }
  ],
  "indexable": true
}