{
  "alternatePhrases": [
    "OEIS",
    "Online Encyclopedia of Integer Sequences"
  ],
  "definition": "An Internet database of sequences of integers, together with formulas,\ngenerating functions, computer programs, keywords and cross-references\nto other sequences. Sometimes referred to by its acronym, [*OEIS*]{}. It\nwas started by Neil Sloane as an outgrowth of his printed catalogs of\ninteger sequences.\n\nEach sequence is assigned a unique identification number (the letter A\nfollowed by six digits in base 10) based on the date of its addition to\nthe database, though most entries contain information on their\nlexicographic context. In 2010 the database had almost 200000 sequences.\n\nThe most important sequences are tagged with the keyword “core.\"\nSequences of fractions are split into two sequences (numerators and\ndenominators), while important mathematical constants like e are split\ninto their base 10 digits. Zero is sometimes used as a placeholder value\nfor non-existent terms.\n\nA few other important keywords include: “frac\" for most fractions,\n“cofr\" for continued fractions, “eigen\" for eigenvalues, “mult\" for\nmultiplicative sequences, “walk\" for sequences pertaining to\nself-avoiding paths, etc.\n\nThe sequences included in the database range in subject from Sloane’s\nlove of combinatorics to number theory, geometry, calculus,\ncryptography, quantum physics, etc., as well as many subjects that would\nseem to be far removed from mathematics, like archaeology and\npsychiatry.\n\nIn 2010 there was an effort to move the whole database to a Wiki\nplatform, but this ultimately abandoned in favor of a custom-designed\nplatform with a more rigorous editorial control. However, the OEIS does\nhave a Wiki for subsidiary pages.\n\n[6]{} A. Del Arte, “\" [*The South End*]{} (Detroit), 11 Nov., Wayne\nState University (2004) V. Origlio, “L’Enciclopedia delle sequenze\nintere\" [*Biblioteche Oggi*]{}, Jan.-Feb. (2006): 41 - 45",
  "language": "INFORMAL",
  "phrase": "On-Line Encyclopedia Of Integer Sequences",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/OnLineEncyclopediaOfIntegerSequences"
    }
  ],
  "indexable": true
}