{
  "alternatePhrases": [],
  "definition": "An [*opus number*]{} is a number attached to a particular musical\ncomposition or set of compositions by a publisher to denote the order of\npublication by the given composer. Theoretically, opus numbers would\ngive musicologists a simple means to chart the growth of a composer\nchronologically, to make statements to the effect that there is a direct\ncorrelation between such and such composer’s handling of a particular\nmusical technique and the opus numbers.\n\nIn practice, however, many factors contribute to making the opus numbers\nfor certain composers less than useful, such as their being assigned by\nthe composer rather than the publisher. Antonín Dvořák, for example,\ntried to fool publishers in an effort to get the best deal, and thus\noften gave misleadingly low or high opus numbers to his compositions.\nThe confusion with Carl Nielsen’s opus numbers arose not from any\nwheeling and dealing, but from his not having an exclusive publisher and\nnot keeping track of which opus numbers he hadn’t used (see sequence\nA113529 in Sloane’s OEIS for a listing of opus numbers skipped over by\nCarl Nielsen).\n\nOther composers just never had any opus numbers given to their\ncompositions by either publishers or themselves; musicologists then\nsometimes try to create a catalog with numbers named after themselves.\nIn the case of Mozart, the Köchel numbers by Ludwig von Köchel are\nalmost universally accepted, but in the case of Domenico Scarlatti,\nthree different musicologists came up with three different catalogs,\nleading to many of Scarlatti’s sonatas to be known by three different\nnumbers. The lack of opus numbers is not a problem for composers whose\nrepertory works consist of less than a dozen of large-scale works (e.g.,\nBruckner and Mahler).\n\n[1]{} Schönzeler, H. H. [*Dvořák*]{} London: M. Boyers (1984): 220 - 239",
  "language": "INFORMAL",
  "phrase": "Opus Number",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/OpusNumber"
    }
  ],
  "indexable": true
}