{
  "alternatePhrases": [],
  "definition": "In mathematical writing, the adjective *strict* is used in to modify\ntechnical which have meanings. It indicates that the exclusive meaning\nof the term is to be understood. (More formally, one could say that this\nis the meaning which implies the other meanings.)\n\nThis term is commonly used in the context of inequalities — the phrases\n“strictly less than” and “strictly greater than” mean “less than and not\nequal to” and “greater than and not equal to”, respectively. A related\nuse occurs when comparing numbers to zero — “strictly positive” and\n“strictly negative” mean “positive and not equal to zero” and “negative\nand not equal to zero”, respectively. Also, in the context of functions,\nthe adverb “strictly ” is used to modify the terms “monotonic”,\n“increasing”, and “decreasing”.\n\nOn the other hand, sometimes one wants to specify the inclusive meanings\nof terms. In the context of comparisons, one can use the phrases\n“non-negative”, “non-positive”, “non-increasing”, and “non-decreasing”\nto make it clear that the inclusive sense of the terms is intended.\n\nUsing such terminology helps avoid possible ambiguity and confusion. For\ninstance, upon reading the phrase “x is negative”, it is not immediately\nclear whether x = 0 is possible, since some authors consider zero to be\npositive while others consider zero not to be positive. Therefore, it is\nprudent to write either “x is strictly negative” or “x is non-positive”\nunless the distinction is unimportant or the context makes obvious which\nmeaning is intended or it has been explicitly stated that the term\n“positive” is to be used in only one sense. (Here, in Planet Math, we\nhave taken the third option by adopting the convention that zero is\nneither positive nor negative. Hence, the terms “strictly positive” and\n“positive” are synonyms here. However, the adverb “strictly” may still\nbe necessary in some of the other contexts described avove.)",
  "language": "INFORMAL",
  "phrase": "Strict",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Strict"
    }
  ],
  "indexable": true
}