{
  "alternatePhrases": [],
  "definition": "The word *variable* as used in mathematics (and in other scientific\nfields that use mathematics) is somewhat vague and may have different\nmeanings depending on the context. Variables are usually denoted by a\nsingle Roman or Greek letter, e.g. $x$, although sometimes a whole word\nor phrase can be used also.\n\nHere is a list of some of the meanings of *variable*:\n\n(i) As “mathematical” variables.\n\n:   These stand for a concrete object, for example, an element of the\n    real numbers That is, when we write the symbol $x$, it is a stand-in\n    for various numbers: e.g. $2, 3, \\pi, e, 578.24$. But we do not name\n    these numbers specifically, because we may want to talk about all\n    these numbers at once, in a general statement, theorem, or proof\n    about numbers.\n\n    Sense (i) is probably the most common usage in mainstream\n    mathematics.\n\n(ii) As placeholders in functional notation.\n\n:   For example, we may be defining a function using the phrase “define\n    the function $f(z) = z^2 + 4$ for complex numbers $z$. This usage of\n    a variable is slightly different from sense (i), because our\n    objective is to talk about the *function* $f$, *and not its value*\n    at a number $z$ which is $f(z)$. The notation “$f(z) = z^2 + 4$” is\n    merely a much more convenient way of saying: “define the function\n    $f$ which takes a complex number, multiplies it by itself, and then\n    adds four to it”. It could also be rephrased this way: “define a\n    function $f$ such that the statement $f(z) = z^2 + 4$ is true for\n    all complex numbers $z$ (in sense (i))”.\n\n    On the other hand, the symbol $f$, if we were to contemplate it as a\n    “variable”, arguably belongs to the sense (i); in this case we are\n    talking about *some specific function*, not all functions.\n\n(iii) As “formal” variables.\n\n:   For instance, we may talk about a formal polynomial\n    $p(x) = 1 + x + x^2$. This is similar to sense (ii), but is not\n    exactly the same. The variable $x$ here is not necessarily a complex\n    number, or in any fixed domain at all. It is a formal symbol, which\n    we later replace by actual elements of the real numbers, or\n    matrices, etc. at our whim. And $p$ here is *not a function*; it is\n    a polynomial.\n\n    The variables used in formal logic can also be considered to fall in\n    sense (iii). For example, we may have a set of variables\n    $ \\{ x, y, z \\}$ and a formula from the first-order language using\n    such variables: $( \\exists x (( x \\leq 0) \\land \\mathrm{R}(z) )$.\n\n(iv) As pieces of (experimental) data.\n\n:   Used in the sciences. One may say “at $t=4 \\: \\mathrm{s}$,\n    $x=23.1 \\: \\mathrm{m}$” which may really mean: “at 4 seconds from\n    the start of the experiment, the object is 23.1 metres to the right\n    of its initial position”.\n\n    So the symbols $t$ and $x$ are being used in the meaning of “time”\n    and “position” in general. There may or may not be a functional\n    relation between the “variables” $t$ and $x$. If there is, we might\n    say “$x$ is a function of $t$”, and we can talk about quantities\n    such as $dx/dt$.\n\n    If we want to talk about a specific (but unnamed) time, we can use a\n    notation such as “when $t = t_0, \\dotsc$” for some variable $t_0$ in\n    sense (i).\n\n    The field of probability and statistics follows a similar practice\n    for what are termed “random variables”, which are really functions\n    defined on a measure space $\\Omega$. But in practice they are\n    usually denoted with variable notation: e.g. “the random variable\n    $X$”, and a specific value of this random variable $X$, at some\n    unspecified $\\omega \\in \\Omega$, is denoted by $x$.\n\n(v) As state variables in computer algorithms.\n\n:   In this case, a variable $x$ stands for a computer memory location.\n    Or in more abstract language, $x$ is a name for a container which\n    may hold some object. The contents of this container may change as\n    time passes or when it is modified by a program that the computer is\n    executing.\n\n    In formal language, putting a value in the container is often\n    denoted by notation like “$x \\leftarrow 2$”.\n\nNote that the above distinctions are not always clear-cut. and the same\nsymbol $x$ may be used for different purposes at once, which of course,\nmay lead to confusion.",
  "language": "INFORMAL",
  "phrase": "Variable",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/Variable"
    }
  ],
  "indexable": true
}