{
  "alternatePhrases": [],
  "definition": "[*Morse homology*]{} is a tool developed by Thom, Smale, and Milnor for\nhomology theory.\n\nTake $M$ to be a smooth compact manifold. Throughout we assume that $f$\nis a suitable Morse function, that is, all critical points of $f$ are\nnondegenerate. We must first make some definitions before defining the\nMorse homology. Choose a Riemannian metric on $M$ so that the notion of\na gradient vector field makes sense. The map\n$\\phi\\colon\\mathbb{R} \\times M \\rightarrow M$ such that\n$$\\frac{d}{dt}\\phi(t,x) = -\\nabla f(\\phi(t,x)),$$ with\n$\\phi(0,x) = \\operatorname{Id}$, is called the negative gradient flow of\n$f$. Let $p$ be a critical point of $f$, and define\n$$W_p^s :=  \\{ x \\in M | \\lim_{t\\rightarrow \\infty} \\phi(t,x) = p \\} \\text{\\ and \\ } W_p^u := \\{ x\\in M | \\lim_{t \\rightarrow -\\infty} \\phi(t,x) = p \\}$$\nto be the stable and unstable manifolds respectively. Thom realized that\none could decompose $M$ into its unstable manifolds and arrive at\nsomething that is homologically equivalent to its handle decomposition,\nbut this decomposition was not a CW complex, hence it was hard to say\nanything about the homotopy type of $M$. But Smale realized that if we\nimpose more conditions on the metric itself, then we can make this into\na CW complex.\n\nThe pair $(f,g)$, where $f$ is a Morse function and $g$ is the\nRiemannian metric, is called Morse-Smale pair, if for every pair $p$,\n$q$ of critical points of $f$, $W_p^u$ is transverse to $W_q^s$. This is\nknown as the Morse-Smale condition. This condition actually holds for a\ngeneric Riemannian metric on M. With this restriction, this makes Thom’s\ndecomposition into a CW complex.\n\nWe can define a complex called the Morse complex as follows:\n\nLet $\\operatorname{Crit}_k (f)$ be the set of critical points of $f$ of\nindex $k$. We define the chain group , $C_k(f)$ to be the formal linear\ncombination with integer coefficients of elements of\n$\\operatorname{Crit}_k (f)$. We must also keep track of the signs of the\nflow lines. (However, it is true if you count mod 2, the Morse complex\ncomputes homology with coefficients in $Z \\over 2$.) To make this a\nchain complex we must define the differential map. The map\n$\\delta _k : C_k \\rightarrow C_{k-1}$ applied to a critical point $p$ is\na formal sum of critical points with $q$ given by this number. It is\npossible to prove that $\\delta^2 = 0$ , making this into a chain\ncomplex.\n\nThe homology of this complex is called the Morse homology. It can be\nshown to be isomorphic to the singular homology of $M$.\n\nNote: There is another way of realizing the Morse homology using Hodge\ntheory, an idea pioneered by Edward Witten. His idea is essentially to\nconjugate the $d$ operator by $e^{sf}$ and it can be shown that this\nconjugation again leads to another isomorphism between the set of\nharmonic forms and the De Rham cohomology. This parameter $s$ is like a\ncurve of chain complexes and Witten claimed that if $s$ is large enough,\nthen we can obtain a space whose dimension is the number of critical\npoints of a given index and the boundary operator induced on $d$ is the\nnumber of critical paths between critical points, as before. Witten did\nnot prove this idea rigorously, but it was done later by Helffer and\nSjostrand.",
  "language": "INFORMAL",
  "phrase": "Morse Homology",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/MorseHomology"
    }
  ],
  "indexable": true
}