{
  "alternatePhrases": [],
  "definition": "A representation of a group/algebra into $GL(V,k)$, $End_k V$,\n$\\mathfrak{gl}_k(V)$, etc. is called *modular* if the characteristic of\n$k$ is positive. An algebra $A$ is called *modular* if the\ncharacteristic of the field $k$ is positive (thus prime for some $p$.)\nAs the algebra can be represented in $End_k A$ by left or right\nmultiplication (often called the regular or adjoint representation) this\ndefinition matches the requirements for a modular representation.\n\nModular representations and modular theory in this sense should not be\nconfused with modular forms from number theory. Though applications of\none to another may exist, these two topics are generally unrelated.\n\nTypically theory for representations over fields of characteristic 0\ncannot be transplanted directly to modular representations. For example,\nMaschke’s theorem, Lie’s theorem, the use of the Killing form for a Lie\nalgebra all fail in various ways in modular representations. There are\ntwo common obstructions in modular representations.\n\n1.  A theorem/formula in characteristic 0 makes use of rational\n    fractions $a/b$ where $p|b$. Thus the fraction causes division by 0\n    over characteristic $p$. Examples of this obstruction include\n    Maschke’s theorem and the definition of exponentials of nilpotent\n    matrices.\n\n2.  A theorem/formula involves polynomials which are inseparable, or\n    have repeated roots over fields with positive characteristic. This\n    is especially problematic when the polynomials are the minimal or\n    characteristic polynomials of linear transformations for this causes\n    the rational canonical form and Jordan canonical form of the\n    transforms to change. Examples of this problem include Lie’s\n    theorem.\n\nThere are also two common workarounds for these obstructions.\n\n1.  Treat the rational coefficients as formal coefficients. For example,\n    start in characteristic 0 and define an integer subalgebra with\n    basis elements of the form $\\frac{x^n}{n!}$ (or similarly useful\n    combinations.) Then tensor (over $\\mathbb{Z}$) the\n    $\\mathbb{Z}$-subalgebra with $k$. Thus the fractions of the form\n    $1/n!$ are not actually coefficients in $k$ but formal coefficients\n    and so they do not cause division by 0. This technique is used in\n    the theory of Chevalley groups over arbitrary fields as it allows\n    for version of the exponential of a nilpotent element of a Lie\n    algebra.\n\n2.  Make restrictions on the dimensions of the representation, for\n    instance, $(p,\\dim V)=1$ or $x^n=0$ for $n<p$ etc. Thus the division\n    by 0 and polynomial oddities are avoided. For example, with\n    Maschke’s theorem the solution is to assume that the characteristic\n    $p$ does not divide the order of the group $G$ which is being\n    represented. The second approach to insist on large $p$ often\n    excludes $p=2,3$ but provides workable results for $p\\geq 5$, or 7,\n    etc. Then the small prime cases are studied as exceptional examples.\n\nThere is a third problem which can arise for modular representations\nwhich has no obvious work around. This is when the definition and/or\ntheorems still work but their implications are useless.\n\nFor example, with the Killing form of a Lie algebra we take the trace of\na linear transformation. However, over characteristic $p$ it is possible\nfor the identity matrix to have trace 0, for example, in dimension\n$d=mp$ for any integer $m$. This situation cannot be be avoided as\neasily as with Maschke’s theorem by assuming restrictions on the\ndimension of the representation. For we can use $d=2$ and the diagonal\nmatrix $Diag(1,p-1)$ to obtain a similar problem with the trace. And\nthis problem embeds into all higher dimensions thus a straight forward\nuse of trace would work only in 1 dimensional representations.\n\nThere is no problem with the definition of the Killing form for modular\nrepresentations but the results may no longer be applicable. In these\nsituations usually entirely new approaches are required.",
  "language": "INFORMAL",
  "phrase": "Modular Theory",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/ModularTheory"
    }
  ],
  "indexable": true
}