{
  "alternatePhrases": [],
  "definition": "Given a modular Lie algebra $L$, that is, a Lie algebra defined over a\nfield of positive characteristic $p$, then we say $L$ is *restricted* if\nthere exists a *power map* $[p]:L\\rightarrow L$ satisfying\n\n1.  $(\\operatorname{ad~}a)^p=\\operatorname{ad~}(a^{[p]})$ for all\n    $a\\in L$ (where\n    $(\\operatorname{ad~}a)^p=\\operatorname{ad~}a\\cdots \\operatorname{ad~}a$\n    in the associative product of linear transformations in\n    $\\mathfrak{gl}_k V=\\operatorname{End}_k V$.)\n\n2.  For every $\\alpha\\in k$ and $a\\in L$ then\n    $(\\alpha a)^{[p]}=\\alpha^p a^{[p]}$.\n\n3.  For all $a,b\\in L$,\n    $$(a+b)^{[p]}=a^{[p]}+b^{[p]}+\\sum_{i=1}^{p-1} s_i(a,b)$$ where the\n    terms $s_i(a,b)$ are determined by the formula\n    $$(\\operatorname{ad~}(a\\otimes x+b\\otimes 1))^{p-1} (a\\otimes 1)\n    =\\sum_{i=1}^{p-1} i s_i(a,b)\\otimes x^{i-1}$$ in $L\\otimes_k k[x]$.\n\nThe definition and terminology of a restricted Lie algebra was developed\nby N. Jacobson as a method to mimic the properties of Lie algebras of\ncharacteristic 0. The usual methods of using minimal polynomials to\nestablish the Jordan normal form of a transform fail in positive\ncharacteristic as certain polynomials become inseparable or reducible.\nThus one cannot simply establish the typical nilpotent+semisimple\ndecomposition of elements.\n\nHowever, given a linear Lie algebra (subalgebra of $\\mathfrak{gl}_k V$)\nover a field $k$ of positive characteristic $p$ then the map\n$x\\mapsto x^p$ on the matrices captures many of the properties of the\nfield. For example, a diagonal matrix $D$ with entries in $\\mathbb{Z}_p$\nsatisfies $D^p=D$ simply because the power map $p$ is a field\nautomorphism. Thus in various ways the power map captures the\nrequirements of semisimple and toral elements of Lie algebras. By\nmodifying the definitions of semisimple, toral, and nilpotent elements\nto use the power maps of the field, Jacobson and others were able to\nreproduce much of the classical theory of Lie algebras for restricted\nLie algebras.\n\nThe definition given above reflects the abstract requirements for a\nrestricted Lie algebra. However an important observation is that given a\nlinear Lie algebra $L$ over a field of characteristic $p$, then the\nusual associative power map serves as a power map for establishing a\nrestricted Lie algebra. The only added requirement is that\n$L^p\\subseteq L$.\n\nA Lie algebra is said to be *restrictable* if it can be given a power\nmapping which makes it a restricted Lie algebra.\n\nIt is generally not true that a restrictable Lie algebra has a unique\npower mapping. Notice that the definition of a power mapping relates the\npower mapping to the linear power mapping of the adjoint representation.\nThis suggests (correctly) that power maps can be defined in various ways\nbut agree modulo the center of the Lie algebra.\n\nJacobson, Nathan *Lie algebras*, Interscience Tracts in Pure and Applied\nMathematics, No. 10, Interscience Publishers (a division of John Wiley &\nSons), New York-London, 1962.\n\nStrade, Helmut and Farnsteiner, Rolf *Modular [L]{}ie algebras and their\nrepresentations*, Monographs and Textbooks in Pure and Applied\nMathematics, vol. 116, Marcel Dekker Inc., New York, 1988.",
  "language": "INFORMAL",
  "phrase": "Restricted Lie Algebra",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/RestrictedLieAlgebra"
    }
  ],
  "indexable": true
}