{
  "alternatePhrases": [],
  "definition": "Zipf’s law (named for Harvard linguistic professor George Kingsley Zipf)\nmodels the occurrence of distinct objects in particular sorts of\ncollections. Zipf’s law says that the $i$th most frequent object will\nappear $1/i^\\theta$ times the frequency of the most frequent object, or\nthat the $i$th most frequent object from an object “vocabulary” of size\n$V$ occurs\n\n$$O(i) = \\frac{n}{i^{\\theta} H_{\\theta}(V) }$$\n\ntimes in a collection of $n$ objects, where $H_{\\theta}(V)$ is the\nharmonic number of order $\\theta$ of $V$.\n\n  ----------------------------------------------------------------------------------------------------------------------------------------------------------------\n   ![A typical Zipf-law rank distribution. The y-axis represents occurrence frequency, and the x-axis represents rank (highest at the left)](zipfslaw.eps \"fig:\")\n                                                             [(generated by GNU Octave and gnuplot) ]{}\n  ----------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nZipf’s law typically holds when the “objects” themselves have a property\n(such as length or size) which is modelled by an exponential\ndistribution or other skewed distribution that places restrictions on\nhow often “larger” objects can occur.\n\nAn example of where Zipf’s law applies is in English texts, to frequency\nof word occurrence. The commonality of English words follows an\nexponential distribution, and the nature of communication is such that\nit is more efficient to place emphasis on using shorter words. Hence the\nmost common words tend to be short and appear often, following Zipf’s\nlaw.\n\nThe value of $\\theta$ typically ranges between 1 and 2, and is between\n1.5 and 2 for the English text case.\n\nAnother example is the populations of cities. These follow Zipf’s law,\nwith a few very populous cities, falling off to very numerous cities\nwith a small population. In this case, there are societal forces which\nsupply the same type of “restrictions” that limited which length of\nEnglish words are used most often.\n\nA final example is the income of companies. Once again the ranked\nincomes follow Zipf’s law, with competition pressures limiting the range\nof incomes available to most companies and determining the few most\nsuccessful ones.\n\nThe underlying theme is that efficiency, competition, or attention with\nregards to resources or information tends to result in Zipf’s law\nholding to the ranking of objects or datum of concern.\n\nReferences\n----------\n\n-   References on Zipf’s law -\n\n-   Baeza-Yates and Ribeiro-Neto, *Modern Information Retrieval*, ACM\n    Press, 1999.",
  "language": "INFORMAL",
  "phrase": "Zipf'S Law",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/ZipfsLaw"
    }
  ],
  "indexable": true
}