{
  "language": "INFORMAL",
  "remarks": "",
  "statement": "In this entry we give a theorem that generalizes such results as “the of\na subgroup is a subgroup” and “the closure of a convex set is convex”.\n\nTheorem and proof {#theorem-and-proof .unnumbered}\n=================\n\nSince the theorem involves two different concepts of closure — algebraic\nand topological — we must be careful how we phrase it.\n\nLet $X$ be a topological space with a continuous $X^n\\to X$. If\n$A\\subseteq X$ is closed under this operation, then so is $\\closure{A}$.\n\n[**Proof**]{}\n\nLet $\\beta$ be the $n$-ary operation, and suppose that $A$ is closed\nunder this operation, that is,\n$\\beta(A\\times\\cdots\\times A)\\subseteq A$. From the fact that the , we\nhave $$\\beta(\\closure{A}\\times\\cdots\\times\\closure{A}) =\n  \\beta(\\closure{A\\times\\cdots\\times A}).$$ From the , we have\n$$\\beta(\\closure{A\\times\\cdots\\times A}) \\subseteq\n  \\closure{\\beta(A\\times\\cdots\\times A)}.$$ From the assumption that\n$\\beta(A\\times\\cdots\\times A)\\subseteq A$, we have\n$$\\closure{\\beta(A\\times\\cdots\\times A)} \\subseteq \\closure{A}.$$\nPutting all this together gives\n$$\\beta(\\closure{A}\\times\\cdots\\times\\closure{A}) \\subseteq \\closure{A},$$\nas required.\n\nExamples {#examples .unnumbered}\n========\n\nIf $H$ is a subgroup of a topological group $G$, then $H$ is closed\nunder both the group operation and the operation of inversion, both of\nwhich are continuous, and therefore by the theorem $\\closure{H}$ is also\nclosed under both operations. Thus the closure of a subgroup of a\ntopological group is also a subgroup.\n\nIt similarly follows that the closure of a normal subgroup of a\ntopological group is a normal subgroup. In this case there are\nadditional unary operations to consider: the maps $x\\mapsto g^{-1}xg$\nfor each $g$ in the group. But these maps are all continuous, so the\ntheorem again applies.\n\nNote that it does not follow that the closure of a characteristic\nsubgroup of a topological group is characteristic, because this would\nrequire applying the theorem to arbitrary automorphisms of the group,\nand these automorphisms need not be continuous.\n\nStraightforward application of the theorem also shows that the closure\nof a subring of a topological ring is a subring. Considering also the\nunary operations $x\\mapsto rx$ for each $r$ in the ring, we see that the\nclosure of a left ideal of a topological ring is a left ideal.\nSimilarly, the closure of a right ideal of a topological ring is a right\nideal.\n\nWe also see that the closure of a vector subspace of a topological\nvector space is a vector subspace. In this case the operations to\nconsider are vector addition and for each scalar $\\lambda$ the unary\noperation $x\\mapsto\\lambda x$.\n\nAs a final example, we look at convex sets. Let $A$ be a convex subset\nof a real (or complex) topological vector space. Convexity means that\nfor every $t\\in[0,1]$ the set is closed under the binary operation\n$(x,y)\\mapsto(1-t)x+ty$. These binary operations are all continuous, so\nthe theorem again applies, and we conclude that $\\closure{A}$ is convex.",
  "citations": [
    {
      "textCitation": "https://planetmath.org/ClosureOfSetsClosedUnderAFinitaryOperation"
    }
  ],
  "indexable": true,
  "names": [
    "closure of sets closed under a finitary operation"
  ]
}