{
  "alternatePhrases": [],
  "definition": "Commutative case {#commutative-case .unnumbered}\n----------------\n\nA commutative ring with multiplicative identity is called [*local*]{} if\nit has exactly one maximal ideal. This is the case if and only if\n$1\\not=0$ and the sum of any two non- in the ring is again a non-unit;\nthe unique maximal ideal consists precisely of the non-units.\n\nThe name comes from the fact that these rings are important in the study\nof the local behavior of and manifolds: the ring of function germs at a\npoint is always local. (The reason is simple: a germ $f$ is invertible\nin the ring of germs at $x$ if and only if $f(x)\\not=0$, which implies\nthat the sum of two non-invertible elements is again non-invertible.)\nThis is also why schemes, the generalizations of varieties, are defined\nas certain locally ringed spaces. Other examples of local rings include:\n\n-   All fields are local. The unique maximal ideal is $(0)$.\n\n-   Rings of formal power series over a field are local, even in several\n    variables. The unique maximal ideal consists of those without .\n\n-   if $R$ is a commutative ring with multiplicative identity, and\n    $\\mathfrak{p}$ is a prime ideal in $R$, then the localization of $R$\n    at $\\mathfrak{p}$, written as $R_{\\mathfrak{p}}$, is always local.\n    The unique maximal ideal in this ring is\n    $\\mathfrak{p}R_{\\mathfrak{p}}$.\n\n-   All discrete valuation rings are local.\n\nA local ring $R$ with maximal ideal $\\mathfrak{m}$ is also written as\n$(R,\\mathfrak{m})$.\n\nEvery local ring $(R,\\mathfrak{m})$ is a topological ring in a natural\nway, taking the powers of $\\mathfrak{m}$ as a neighborhood base of 0.\n\nGiven two local rings $(R,\\mathfrak{m})$ and $(S,\\mathfrak{n})$, a\n*local ring homomorphism* from $R$ to $S$ is a ring homomorphism\n$f:R\\to S$ (respecting the multiplicative identities) with\n$f(\\mathfrak{m})\\subseteq\\mathfrak{n}$. These are precisely the ring\nhomomorphisms that are continuous with respect to the given topologies\non $R$ and $S$.\n\nThe [*residue field*]{} of the local ring $(R,\\mathfrak{m})$ is the\nfield $R/\\mathfrak{m}$.\n\nGeneral case {#general-case .unnumbered}\n------------\n\nOne also considers non-commutative local rings. A with multiplicative\nidentity is called *local* if it has a unique maximal left ideal. In\nthat case, the ring also has a unique maximal right ideal, and the two\ncoincide with the ring’s Jacobson radical, which in this case consists\nprecisely of the non-units in the ring.\n\nA ring $R$ is local if and only if the following condition holds: we\nhave $1\\not=0$, and whenever $x\\in R$ is not invertible, then $1-x$ is\ninvertible.\n\nAll skew fields are local rings. More interesting examples are given by\nendomorphism rings: a finite-length module over some ring is\nindecomposable if and only if its endomorphism ring is local, a\nconsequence of Fitting’s lemma.",
  "language": "INFORMAL",
  "phrase": "Local Ring",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/LocalRing"
    }
  ],
  "indexable": true
}