{
  "alternatePhrases": [
    "noetherian"
  ],
  "definition": "A ring $R$ is *right noetherian* if it is a , considered as a right\nmodule over itself in the natural way (that is, an element $r$ acts by\n$x\\mapsto xr$). Similarly, $R$ is *left noetherian* if it is a left\nnoetherian module over itself (equivalently, if the opposite ring of $R$\nis right noetherian). We say that $R$ is *noetherian* if it is both left\nnoetherian and right noetherian.\n\nExamining the definition, it is relatively easy to show that $R$ is\nright noetherian if and only if the three equivalent conditions hold:\n\n1.  right ideals are finitely generated,\n\n2.  the ascending chain condition holds on right ideals, or\n\n3.  every nonempty family of right ideals has a maximal element.\n\nExamples of Noetherian rings include:\n\n-   any field (as the only ideals are 0 and the whole ring),\n\n-   the ring $\\mathbb{Z}$ of integers (each ideal is generated by a\n    single integer, the greatest common divisor of the elements of the\n    ideal),\n\n-   the , $\\mathbb{Z}_p$ for any prime $p$, where every ideal is\n    generated by a multiple of $p$, and\n\n-   the ring of complex polynomials in two variables, where some ideals\n    (the ideal generated by $X$ and $Y$, for example) are not principal,\n    but all ideals are finitely generated.\n\nThe Hilbert Basis Theorem says that a ring $R$ is noetherian if and only\nif the polynomial ring $R[x]$ is.\n\nA ring can be right noetherian but not left noetherian.\n\nThe word noetherian is used in a number of other places. A topology can\nbe ; although this is not related in a simple way to the property for\nrings, the definition is based on an ascending chain condition. A site\ncan also be noetherian; this is a generalization of the notion of\nnoetherian for topological space.\n\nNoetherian rings (and by extension most other uses of the word\nnoetherian) are named after Emmy Noether (see for a short biography) who\nmade many contributions to algebra. Older references tend to capitalize\nthe word (Noetherian) but in some fields, such as algebraic geometry,\nthe word has come into such common use that the capitalization is\ndropped (noetherian). A few other objects with proper names have\nundergone this process (abelian, for example) while others have not\n(Galois groups, for example). Any particular work should of course\nchoose one convention and use it consistently.",
  "language": "INFORMAL",
  "phrase": "Noetherian Ring",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/NoetherianRing"
    }
  ],
  "indexable": true
}