{
  "alternatePhrases": [],
  "definition": "A **sign relation** is a special type of triadic relation that arises in\nthe use of signs to connote meanings and denote objects. If this sounds\nreminiscent of what we do in applying logic and reasoning to the world,\nactual and ideal, it is no accident. Indeed, the polymathematician\nCharles Sanders Peirce famously defined *logic* as “formal semiotic\",\nthat is, the formal theory of signs.\n\nHistory\n=======\n\nIt is possible to trace the idea of a triadic sign relation back to\nhints in Plato and what we know of the Stoics, but one of the most\ndetailed early formulations is found in this passage by Aristotle:\n\n> Words spoken are symbols or signs\n> $(\\sigma\\upsilon\\mu\\beta o\\lambda\\alpha)$ of affections or impressions\n> $(\\pi\\alpha\\theta\\eta\\mu\\alpha\\tau\\alpha)$ of the soul\n> $(\\psi\\upsilon\\chi\\eta)$; written words are the signs of words spoken.\n> As writing, so also is speech not the same for all races of men. But\n> the mental affections themselves, of which these words are primarily\n> signs $(\\sigma\\eta\\mu\\epsilon\\iota\\alpha)$, are the same for the whole\n> of mankind, as are also the objects\n> $(\\pi\\rho\\alpha\\gamma\\mu\\alpha\\tau\\alpha)$ of which those affections\n> are representations or likenesses, images, copies\n> $(o\\mu o\\iota\\omega\\mu\\alpha\\tau\\alpha)$. (Aristotle, *De\n> Interpretatione*, $1.16^{a}4$).\n\nDefinition\n==========\n\nA definition of sign relations that is explicit enough to support the\ndevelopment of a formal theory was given by C.S. Peirce in the process\nof defining logic, and so it is informative to view it in that context.\n\n> Logic will here be defined as *formal semiotic*. A definition of a\n> sign will be given which no more refers to human thought than does the\n> definition of a line as the place which a particle occupies, part by\n> part, during a lapse of time. Namely, a sign is something, $A$, which\n> brings something, $B$, its *interpretant* sign determined or created\n> by it, into the same sort of correspondence with something, $C$, its\n> *object*, as that in which itself stands to $C$. It is from this\n> definition, together with a definition of “formal\", that I deduce\n> mathematically the principles of logic. I also make a historical\n> review of all the definitions and conceptions of logic, and show, not\n> merely that my definition is no novelty, but that my non-psychological\n> conception of logic has *virtually* been quite generally held, though\n> not generally recognized. (Peirce, NEM 4, 20–21).\n\nIn the general discussion of diverse theories of signs, the question\nfrequently arises whether signhood is an absolute, essential, indelible,\nor *ontological* property of a thing, or whether it is a relational,\ninterpretive, and mutable role that a thing can be said to exercise only\nwithin a particular context of relationships.\n\nPeirce’s definition of a *sign* defines it in relation to its and its\n*interpretant sign*, and thus it defines signhood in relative terms, by\nmeans of a predicate with three places. In this definition, signhood is\na role in a triadic relation, a role that a thing fills in a given\ncontext of relationships — it is not an *absolute* or *non-relative*\nproperty of a thing-in-itself, one that it possesses independently of\nall relationships to other things.\n\nSome of the terms that Peirce uses in his definition of a sign may need\nto be elaborated for the contemporary reader.\n\n-   **Correspondence.** The form of correspondence invoked in the above\n    definition is what Peirce elsewhere calls a “triple correspondence\",\n    that is, just another way of referring to the whole triadic sign\n    relation itself. A sign relation, as a triadic relation, may involve\n    various types of binary correspondences or dyadic relations, but it\n    does not reduce to any combination of them. In particular, the\n    triple correspondence that we find in sign relations should not be\n    confused with the sort of “mirror image\" correspondence between\n    realities and representations that is debated in contemporary\n    controversies about “correspondence theories of truth\".\n\n-   **Determination.** The concept of determination intended here is\n    much more general than the concept we use in discussing strictly\n    deterministic causal-temporal processes. First of all, we are\n    speaking of a *formal* or *informational* determination, as when we\n    say “two points determine a line\". Causal and temporal\n    determinations imply formal and informational determinations, but\n    the converse does not always hold. In addition, we are allowing here\n    for what is called *determination in measure*, that is, an order of\n    determinism that admits the full spectrum of more determined and\n    less determined relationships.\n\n-   **Non-psychological.** Peirce’s “non-psychological conception of\n    logic\" must be distinguished from any variety of\n    *anti-psychologism*. He was quite interested in matters of\n    psychology and had much to say about them. But logic and psychology\n    operate on different planes of study even when they have occasion to\n    view the same data, as logic is a normative science where psychology\n    is a descriptive science, and so they have very different aims,\n    methods, and rationales.\n\nExamples of sign relations\n==========================\n\nBecause the examples to follow have been artificially constructed to be\nas simple as possible, their detailed elaboration can run the risk of\ntrivializing the whole theory of sign relations. Despite their\nsimplicity, however, these examples have subtleties of their own, and\ntheir careful treatment will serve to illustrate many important issues\nin the general theory of signs.\n\nImagine a discussion between two people, $\\mathrm{Ann}$ and\n$\\mathrm{Bob}$, and attend only to that aspect of their interpretive\npractice that involves the use of the following nouns and pronouns:\n$\\text{``Ann\"}, \\text{``Bob\"}, \\text{``I\"}, \\text{``you\"}$.\n\nIn this setting the *object domain* is the set of two people,\n$\\{ \\mathrm{Ann}, \\mathrm{Bob} \\}$, while the *sign system* or\n*syntactic domain* is the set of four signs,\n$\\{ \\text{``Ann\"}, \\text{``Bob\"}, \\text{``I\"}, \\text{``you\"} \\}$.\n\nIn their use of this sign system, $\\mathrm{Ann}$ and $\\mathrm{Bob}$ are\nnot only the passive objects of nominative and accusative references but\nalso the active interpreters of the language that they use. The *system\nof interpretation* that is associated with each language user can be\nrepresented in the form of a triadic relation called the *sign relation*\nof that interpreter.\n\nUnderstood in terms of its set-theoretic extension, a sign relation $L$\nis a subset of a cartesian product $O \\times S \\times I$. Here, $O$,\n$S$, $I$ are three sets that are known respectively as the *object\ndomain*, the *sign domain*, and the *interpretant domain* of the sign\nrelation $L \\subseteq O \\times S \\times I$.\n\nBroadly speaking, the three domains of a sign relation can be any sets\nwhatsoever, but the kinds of sign relations that are typically\ncontemplated in computational settings are usually constrained to having\n$I \\subseteq S$. In these situations interpretants are just special\ncases of signs, and this makes it convenient to lump signs and\ninterpretants together into a single class called the *syntactic\ndomain*. In the forthcoming examples, $S$ and $I$ are identical as sets,\nso the same elements manifest themselves in two different roles of the\nsign relations in question. When it is necessary to refer to the whole\nset of objects and signs in the union of the domains $O$, $S$, $I$ for a\ngiven sign relation $L$, one may refer to this set as the *world* of $L$\nand write $W = W_L = O \\cup S \\cup I$.\n\nTo facilitate an interest in the abstract structures of sign relations,\nand to keep the notations as brief as possible as the examples become\nmore complicated, it serves to introduce the following general\nnotations:\n\n>   ----- --- ---------------------\n>    $O$  =   Object Domain\n>    $S$  =   Sign Domain\n>    $I$  =   Interpretant Domain\n>   ----- --- ---------------------\n>\nIntroducing a few abbreviations for use in considering the present\nExample, we have the following data:\n\n>   ----- --- ------------------------------------------------------------------ --- ------------------------------------------------------------------\n>    $O$  =   $\\{ \\mathrm{Ann}, \\mathrm{Bob} \\}$                                 =   $\\{ \\mathrm{A},   \\mathrm{B}   \\}$\n>    $S$  =   $\\{ \\text{``Ann\"}, \\text{``Bob\"}, \\text{``I\"}, \\text{``You\"} \\}$   =   $\\{ \\text{``A\"},   \\text{``B\"},   \\text{``i\"}, \\text{``u\"}   \\}$\n>    $I$  =   $\\{ \\text{``Ann\"}, \\text{``Bob\"}, \\text{``I\"}, \\text{``You\"} \\}$   =   $\\{ \\text{``A\"},   \\text{``B\"},   \\text{``i\"}, \\text{``u\"}   \\}$\n>   ----- --- ------------------------------------------------------------------ --- ------------------------------------------------------------------\n>\nIn the present Example, $S$ = $I$ = Syntactic Domain.\n\nThe next two Tables give the sign relations associated with the\ninterpreters $\\mathrm{A}$ and $\\mathrm{B}$, respectively, putting them\nin the form of relational databases. Thus, the rows of each Table list\nthe ordered triples of the form $(o, s, i)$ that make up the\ncorresponding sign relations,\n$L_{\\mathrm{A}}, L_{\\mathrm{B}} \\subseteq O \\times S \\times I$. It is\noften tempting to use the same names for objects and for relations\ninvolving these objects, but it is best to avoid this in a first\napproach, taking up the issues that this practice raises after the less\nproblematic features of these relations have been treated.\n\n> [|c|c|c|p[2cm]{}|c|c|c|]{} & &\\\n> Object & Sign & Interpretant & & Object & Sign & Interpretant\\\n> $\\mathrm{A}$ & $\\text{``A\"}$ & $\\text{``A\"}$ && $\\mathrm{A}$ &\n> $\\text{``A\"}$ & $\\text{``A\"}$\\\n> $\\mathrm{A}$ & $\\text{``A\"}$ & $\\text{``i\"}$ && $\\mathrm{A}$ &\n> $\\text{``A\"}$ & $\\text{``u\"}$\\\n> $\\mathrm{A}$ & $\\text{``i\"}$ & $\\text{``A\"}$ && $\\mathrm{A}$ &\n> $\\text{``u\"}$ & $\\text{``A\"}$\\\n> $\\mathrm{A}$ & $\\text{``i\"}$ & $\\text{``i\"}$ && $\\mathrm{A}$ &\n> $\\text{``u\"}$ & $\\text{``u\"}$\\\n> $\\mathrm{B}$ & $\\text{``B\"}$ & $\\text{``B\"}$ && $\\mathrm{B}$ &\n> $\\text{``B\"}$ & $\\text{``B\"}$\\\n> $\\mathrm{B}$ & $\\text{``B\"}$ & $\\text{``u\"}$ && $\\mathrm{B}$ &\n> $\\text{``B\"}$ & $\\text{``i\"}$\\\n> $\\mathrm{B}$ & $\\text{``u\"}$ & $\\text{``B\"}$ && $\\mathrm{B}$ &\n> $\\text{``i\"}$ & $\\text{``B\"}$\\\n> $\\mathrm{B}$ & $\\text{``u\"}$ & $\\text{``u\"}$ && $\\mathrm{B}$ &\n> $\\text{``i\"}$ & $\\text{``i\"}$\\\n\nThese Tables codify a rudimentary level of interpretive practice for the\nagents $\\mathrm{A}$ and $\\mathrm{B}$, and provide a basis for\nformalizing the initial semantics that is appropriate to their common\nsyntactic domain. Each row of a Table names an object and two\nco-referent signs, making up an ordered triple of the form $(o, s, i)$\nthat is called an *elementary relation*, that is, one element of the\nrelation’s set-theoretic extension.\n\nAlready in this elementary context, there are several different meanings\nthat might attach to the project of a *formal semiotics*, or a formal\ntheory of meaning for signs. In the process of discussing these\nalternatives, it is useful to introduce a few terms that are\noccasionally used in the philosophy of language to point out the needed\ndistinctions.\n\nDyadic aspects of sign relations\n================================\n\nFor an arbitrary triadic relation $L \\subseteq O \\times S \\times I$,\nwhether it is a sign relation or not, there are six dyadic relations\nthat are obtained by projecting $L$ on one of the planes of the\n$OSI$-space $O \\times S \\times I$. The six dyadic projections of a\ntriadic relation $L$ are defined and notated as follows:\n\n>   ---------- --- ----------------------------- --- --------------------------------------------------------------------\n>   $L_{OS}$   =   $\\operatorname{proj}_{OS}L$   =   $\\{ (o, s) \\in O \\times S : (o, s, i) \\in L\\ (\\exists i \\in I) \\}$\n>   $L_{SO}$   =   $\\operatorname{proj}_{SO}L$   =   $\\{ (s, o) \\in S \\times O : (o, s, i) \\in L\\ (\\exists i \\in I) \\}$\n>   $L_{IS}$   =   $\\operatorname{proj}_{IS}L$   =   $\\{ (i, s) \\in I \\times S : (o, s, i) \\in L\\ (\\exists o \\in O) \\}$\n>   $L_{SI}$   =   $\\operatorname{proj}_{SI}L$   =   $\\{ (s, i) \\in S \\times I : (o, s, i) \\in L\\ (\\exists o \\in O) \\}$\n>   $L_{OI}$   =   $\\operatorname{proj}_{OI}L$   =   $\\{ (o, i) \\in O \\times I : (o, s, i) \\in L\\ (\\exists s \\in S) \\}$\n>   $L_{IO}$   =   $\\operatorname{proj}_{IO}L$   =   $\\{ (i, o) \\in I \\times O : (o, s, i) \\in L\\ (\\exists s \\in S) \\}$\n>   ---------- --- ----------------------------- --- --------------------------------------------------------------------\n>\nBy way of unpacking the set-theoretic notation, here is what the first\ndefinition says in ordinary language. The dyadic relation that results\nfrom the projection of $L$ on the $OS$-plane $O \\times S$ is written\nbriefly as $L_{OS}$ or written more fully as\n$\\operatorname{proj}_{OS}L$, and it is defined as the set of all ordered\npairs $(o, s)$ in the cartesian product $O \\times S$ for which there\nexists an ordered triple $(o, s, i)$ in $L$ for some interpretant $i$ in\nthe interpretant domain $I$.\n\nIn the case where $L$ is a sign relation, which it becomes by satisfying\none of the definitions of a sign relation, some of the dyadic aspects of\n$L$ can be recognized as formalizing aspects of sign meaning that have\nreceived their share of attention from students of signs over the\ncenturies, and thus they can be associated with traditional concepts and\nterminology. Of course, traditions may vary as to the precise formation\nand usage of such concepts and terms. Other aspects of meaning have not\nreceived their fair share of attention, and thus remain anonymous on the\ncontemporary scene of sign studies.\n\nDenotation\n----------\n\nOne aspect of a sign’s complete meaning is concerned with the reference\nthat a sign has to its objects, which objects are collectively known as\nthe *denotation* of the sign. In the pragmatic theory of sign relations,\ndenotative references fall within the projection of the sign relation on\nthe plane that is spanned by its object domain and its sign domain.\n\nThe dyadic relation that makes up the *denotative*, *referential*, or\n*semantic* aspect or component of a sign relation $L$ is notated as\n$\\operatorname{Den}(L)$. Information about the denotative aspect of\nmeaning is obtained from $L$ by taking its projection on the object-sign\nplane, in other words, on the 2-dimensional space that is generated by\nthe object domain $O$ and the sign domain $S$. This semantic component\nof a sign relation $L$ is written in any one of the forms,\n$\\operatorname{proj}_{OS}L$, $L_{OS}$, $\\operatorname{proj}_{12}L$,\n$L_{12}$, and it is defined as follows:\n\n> $\\operatorname{Den}(L) = \\operatorname{proj}_{OS}L = \\{ (o, s) \\in O \\times S : (o, s, i) \\in L\\ (\\exists i \\in I) \\}.$\n\nLooking to the denotative aspects of $L_{\\mathrm{A}}$ and\n$L_{\\mathrm{B}}$, various rows of the Tables specify, for example, that\n$\\mathrm{A}$ uses $``i\"$ to denote $\\mathrm{A}$ and $``u\"$ to denote\n$\\mathrm{B}$, whereas $\\mathrm{B}$ uses $``i\"$ to denote $\\mathrm{B}$\nand $``u\"$ to denote $\\mathrm{A}$. All of these denotative references\nare summed up in the projections on the $OS$-plane, as shown in the\nfollowing Tables:\n\n> [|c|c|p[2cm]{}|c|c|]{} & &\\\n> Object & Sign & & Object & Sign\\\n> $\\mathrm{A}$ & $\\text{``A\"}$ && $\\mathrm{A}$ & $\\text{``A\"}$\\\n> $\\mathrm{A}$ & $\\text{``i\"}$ && $\\mathrm{A}$ & $\\text{``u\"}$\\\n> $\\mathrm{B}$ & $\\text{``B\"}$ && $\\mathrm{B}$ & $\\text{``B\"}$\\\n> $\\mathrm{B}$ & $\\text{``u\"}$ && $\\mathrm{B}$ & $\\text{``i\"}$\\\n\nConnotation\n-----------\n\nAnother aspect of meaning concerns the connection that a sign has to its\ninterpretants within a given sign relation. As before, this type of\nconnection can be vacuous, singular, or plural in its collection of\nterminal points, and it can be formalized as the dyadic relation that is\nobtained as a planar projection of the triadic sign relation in\nquestion.\n\nThe connection that a sign makes to an interpretant is here referred to\nas its *connotation*. In the full theory of sign relations, this aspect\nof meaning includes the links that a sign has to affects, concepts,\nideas, impressions, intentions, and the whole realm of an agent’s mental\nstates and allied activities, broadly encompassing intellectual\nassociations, emotional impressions, motivational impulses, and real\nconduct. Taken at the full, in the natural setting of semiotic\nphenomena, this complex system of references is unlikely ever to find\nitself mapped in much detail, much less completely formalized, but the\ntangible warp of its accumulated mass is commonly alluded to as the\nconnotative import of language.\n\nFormally speaking, however, the connotative aspect of meaning presents\nno additional difficulty. For a given sign relation $L$, the dyadic\nrelation that constitutes the *connotative aspect* or *connotative\ncomponent* of $L$ is notated as $\\operatorname{Con}(L)$.\n\nThe connotative aspect of a sign relation $L$ is given by its projection\non the plane of signs and interpretants, and is thus defined as follows:\n\n> $\\operatorname{Con}(L) = \\operatorname{proj}_{SI}L = \\{ (s, i) \\in S \\times I : (o, s, i) \\in L\\ (\\exists o \\in O) \\}.$\n\nAll of these connotative references are summed up in the projections on\nthe $SI$-plane, as shown in the following Tables:\n\n> [|c|c|p[2cm]{}|c|c|]{} & &\\\n> Sign & Interpretant & & Sign & Interpretant\\\n> $\\text{``A\"}$ & $\\text{``A\"}$ && $\\text{``A\"}$ & $\\text{``A\"}$\\\n> $\\text{``A\"}$ & $\\text{``i\"}$ && $\\text{``A\"}$ & $\\text{``u\"}$\\\n> $\\text{``i\"}$ & $\\text{``A\"}$ && $\\text{``u\"}$ & $\\text{``A\"}$\\\n> $\\text{``i\"}$ & $\\text{``i\"}$ && $\\text{``u\"}$ & $\\text{``u\"}$\\\n> $\\text{``B\"}$ & $\\text{``B\"}$ && $\\text{``B\"}$ & $\\text{``B\"}$\\\n> $\\text{``B\"}$ & $\\text{``u\"}$ && $\\text{``B\"}$ & $\\text{``i\"}$\\\n> $\\text{``u\"}$ & $\\text{``B\"}$ && $\\text{``i\"}$ & $\\text{``B\"}$\\\n> $\\text{``u\"}$ & $\\text{``u\"}$ && $\\text{``i\"}$ & $\\text{``i\"}$\\\n\nEnnotation\n----------\n\nThe aspect of a sign’s meaning that arises from the dyadic relation of\nits objects to its interpretants has no standard name. If an\ninterpretant is considered to be a sign in its own right, then its\nindependent reference to an object can be taken as belonging to another\nmoment of denotation, but this neglects the mediational character of the\nwhole transaction in which this occurs. Denotation and connotation have\nto do with dyadic relations in which the sign plays an active role, but\nhere we have to consider a dyadic relation between objects and\ninterpretants that is mediated by the sign from an off-stage position,\nas it were. As a relation between objects and interpretants that is\nmediated by a sign, this aspect of meaning may be referred to as the\n*ennotation* of a sign, and the dyadic relation that constitutes the\n*ennotative aspect* of a sign relation $L$ may be notated as\n$\\operatorname{Enn}(L)$.\n\nThe ennotational component of meaning for a sign relation $L$ is\ncaptured by its projection on the plane of the object and interpretant\ndomains, and it is thus defined as follows:\n\n> $\\operatorname{Enn}(L) = \\operatorname{proj}_{OI}L = \\{ (o, i) \\in O \\times I : (o, s, i) \\in L\\ (\\exists s \\in S) \\}.$\n\nAs it happens, the sign relations $L_{\\mathrm{A}}$ and $L_{\\mathrm{B}}$\nare fully symmetric with respect to exchanging signs and interpretants,\nso all of the data of $\\operatorname{proj}_{OS}L_{\\mathrm{A}}$ is echoed\nunchanged in $\\operatorname{proj}_{OI}L_{\\mathrm{A}}$ and all of the\ndata of $\\operatorname{proj}_{OS}L_{\\mathrm{B}}$ is echoed unchanged in\n$\\operatorname{proj}_{OI}L_{\\mathrm{B}}$.\n\n> [|c|c|p[2cm]{}|c|c|]{} & &\\\n> Object & Interpretant & & Object & Interpretant\\\n> $\\mathrm{A}$ & $\\text{``A\"}$ && $\\mathrm{A}$ & $\\text{``A\"}$\\\n> $\\mathrm{A}$ & $\\text{``i\"}$ && $\\mathrm{A}$ & $\\text{``u\"}$\\\n> $\\mathrm{B}$ & $\\text{``B\"}$ && $\\mathrm{B}$ & $\\text{``B\"}$\\\n> $\\mathrm{B}$ & $\\text{``u\"}$ && $\\mathrm{B}$ & $\\text{``i\"}$\\\n\nSemiotic equivalence relations\n==============================\n\nSee .",
  "language": "INFORMAL",
  "phrase": "Sign Relation",
  "remarks": "",
  "citations": [
    {
      "textCitation": "https://planetmath.org/SignRelation"
    }
  ],
  "indexable": true
}